{"title":"U2 - Rattle And Hum 1988 FLAC Stangman 1234","magnet":"magnet:?xt=urn:btih:011ab2739faee0f2cbdce9f3b73fae2600cc3c6a&dn=U2+-+Rattle+And+Hum+1988+FLAC+Stangman+1234&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Stangman1234","categoryP":"audio","categoryS":"flac","size":"464782435","seeders":"0","leechers":"0","description":"Rattle and Hum is the sixth studio album by Irish rock band U2, and a companion rockumentary film directed by Phil Joanou. The album was produced by Jimmy Iovine and was released on 10 October 1988, while the film was distributed by Paramount Pictures and was released on 27 October 1988. Following the breakthrough success of the band&apos;s previous studio album, The Joshua Tree, the Rattle and Hum project captures their continued experiences with American roots music on the Joshua Tree Tour, further incorporating elements of blues rock, folk rock, and gospel music into their sound. A collection of new studio tracks, live performances, and cover songs, the project includes recordings at Sun Studios in Memphis and collaborations with Bob Dylan, B. B. King, and Harlem&apos;s New Voices of Freedom gospel choir. \r\nAlthough Rattle and Hum was intended to represent the band paying tribute to rock legends, some critics accused U2 of trying to place themselves amongst the ranks of these artists. Critical reception to both the album and the film was mixed; one Rolling Stone editor spoke of the album&apos;s &quot;excitement&quot;, another described it as &quot;misguided and bombastic&quot;.[2] The film grossed just $8.6 million, but the album was a commercial success, reaching number one in several countries and selling 14 million copies. Lead single &quot;Desire&quot; became the band&apos;s first UK number-one song while reaching number three in the US.[3] Facing creative stagnation and a critical backlash to Rattle and Hum, U2 reinvented themselves in the 1990s through a new musical direction and public image","last_updated":"2018-08-25T12:09:58.228Z","parsed":{"xt":"urn:btih:011ab2739faee0f2cbdce9f3b73fae2600cc3c6a","dn":"U2 - Rattle And Hum 1988 FLAC Stangman 1234","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"011ab2739faee0f2cbdce9f3b73fae2600cc3c6a","infoHashBuffer":{"type":"Buffer","data":[1,26,178,115,159,174,224,242,203,220,233,243,183,63,174,38,0,204,60,106]},"name":"U2 - Rattle And Hum 1988 FLAC Stangman 1234","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}