{"title":"Tennessee Williams by John Lahr EPUB","magnet":"magnet:?xt=urn:btih:0154bf8ad426ca65633766d7cddbf529beae47e5&dn=Tennessee+Williams+by+John+Lahr+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3569538","seeders":"32","leechers":"3","description":"xx \r\n\r\nTennessee Williams: Mad Pilgrimage of the Flesh by John Lahr EPUB \r\n\r\nThe definitive biography of America&apos;s greatest playwright from the celebrated drama critic of The New Yorker. \r\n\r\nJohn Lahr has produced a theater biography like no other. Tennessee Williams: Mad Pilgrimage of the Flesh gives intimate access to the mind of one of the most brilliant dramatists of his century, whose plays reshaped the American theater and the nation&apos;s sense of itself. This astute, deeply researched biography sheds a light on Tennessee Williams&apos;s warring family, his guilt, his creative triumphs and failures, his sexuality and numerous affairs, his misreported death, even the shenanigans surrounding his estate. \r\n\r\nWith vivid cameos of the formative influences in Williams&apos;s life - his fierce, belittling father Cornelius; his puritanical, domineering mother Edwina; his demented sister Rose, who was lobotomized at the age of thirty-three; his beloved grandfather, the Reverend Walter Dakin - Tennessee Williams: Mad Pilgrimage of the Flesh is as much a biography of the man who created A Streetcar Named Desire, The Glass Menagerie, and Cat on a Hot Tin Roof as it is a trenchant exploration of Williams&#x2019;s plays and the tortured process of bringing them to stage and screen. \r\n\r\nThe portrait of Williams himself is unforgettable: a virgin until he was twenty-six, he had serial homosexual affairs thereafter as well as long-time, bruising relationships with Pancho Gonzalez and Frank Merlo. \r\n\r\nxx","last_updated":"2018-09-11T12:20:03.971Z","parsed":{"xt":"urn:btih:0154bf8ad426ca65633766d7cddbf529beae47e5","dn":"Tennessee Williams by John Lahr EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0154bf8ad426ca65633766d7cddbf529beae47e5","infoHashBuffer":{"type":"Buffer","data":[1,84,191,138,212,38,202,101,99,55,102,215,205,219,245,41,190,174,71,229]},"name":"Tennessee Williams by John Lahr EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}