{"title":"Fallout by Fred Pearce EPUB","magnet":"magnet:?xt=urn:btih:01f44ae77c23ba1e9253bf32a63cdf04077d608d&dn=Fallout+by+Fred+Pearce+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2174503","seeders":"0","leechers":"0","description":"xx\r\n\r\nFallout by Fred Pearce EPUB\r\n\r\nAn investigation into our complicated seven-decade-long relationship with nuclear technology, from the bomb to nuclear accidents to nuclear waste. \r\n\r\nFrom Hiroshima to Chernobyl, Fukushima to the growing legacy of lethal radioactive waste, humanity&apos;s struggle to conquer atomic energy is rife with secrecy, deceit, human error, blatant disregard for life, short-sighted politics, and fear. Fallout is an eye-opening odyssey through the first eight decades of this struggle and the radioactive landscapes it has left behind. We are, Pearce finds, forever torn between technological hubris and all-too-human terror about what we have created.\r\n\r\nAt first, Pearce reminds us, America loved the bomb. Las Vegas, only 70 miles from the Nevada site of some hundred atmospheric tests, crowned four Miss Atomic Bombs in 1950s. Later, communities downwind of these tests suffered high cancer rates. The fate of a group of Japanese fishermen, who suffered high radiation doses from the first hydrogen bomb test in Bikini Atoll, was worse. The United States Atomic Energy Commission accused them of being Red spies and ignored requests from the doctors desperately trying to treat them.\r\n\r\nPearce moves on to explore the closed cities of the Soviet Union, where plutonium was refined and nuclear bombs tested throughout the &apos;50s and &apos;60s, and where the full extent of environmental and human damage is only now coming to light. Exploring the radioactive badlands created by nuclear accidents - not only the well-known examples of Chernobyl and Fukushima, but also the little known area around Satlykovo in the Russian Ural Mountains and the Windscale fire in the UK - Pearce describes the compulsive secrecy, deviousness, and lack of accountability that have persisted even as the technology has morphed from military to civilian uses.\r\n\r\n..\r\n\r\n..\r\n\r\nxx","last_updated":"2018-05-23T12:01:31.638Z","parsed":{"xt":"urn:btih:01f44ae77c23ba1e9253bf32a63cdf04077d608d","dn":"Fallout by Fred Pearce EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"01f44ae77c23ba1e9253bf32a63cdf04077d608d","infoHashBuffer":{"type":"Buffer","data":[1,244,74,231,124,35,186,30,146,83,191,50,166,60,223,4,7,125,96,141]},"name":"Fallout by Fred Pearce EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}