{"title":"High on Arrival by Mackenzie Phillips EPUB","magnet":"magnet:?xt=urn:btih:021558c933bcace373aa8bdb5a60f15d54144b11&dn=High+on+Arrival+by+Mackenzie+Phillips+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"757742","seeders":"0","leechers":"0","description":"xx\r\n\r\nHigh on Arrival by Mackenzie Phillips EPUB\r\n\r\nNot long before her 50th birthday, Mackenzie Phillips walked into Los Angeles International Airport. She was on her way to a reunion of One Day at a Time, the hugely popular 70s sitcom on which she once starred as the lovable rebel Julie Cooper. Within minutes, Mackenzie was in handcuffs, arrested for possession of cocaine and heroin.\r\n\r\nBorn into rock and roll royalty, Mackenzie grew up in an all-access kingdom of hippie freedom and heroin cool. It was a kingdom over which her father, the legendary John Phillips of The Mamas &amp; the Papas, presided, often in absentia, a spellbinding, visionary phantom.\r\n\r\nWhen Mackenzie was a teenager, Hollywood and the world took notice of the charming, talented, precocious child actor after her star-making turn in American Graffiti. As a young woman, she joined the nonstop party in the hedonistic pleasure dome her father created for himself and his fellow revelers, and a rapt TV audience watched as Julie Cooper wasted away before their eyes.\r\n\r\nBy the time Mackenzie discovered how deep and dark her father&apos;s trip was going, it was too late. And as an adult, she has paid dearly for a lifetime of excess, working tirelessly to reconcile a wonderful, terrible past in which she succumbed to the power of addiction and the pull of her magnetic father.\r\n\r\nAs her astounding, outrageous, and often tender life story unfolds, Phillips overcomes seemingly impossible obstacles again and again, and journeys toward redemption and peace. By exposing the shadows and secrets of the past to the light of day, the star who turned up High on Arrival has finally come back down to earth - to stay.\r\n\r\nxx","last_updated":"2018-04-16T12:14:27.477Z","parsed":{"xt":"urn:btih:021558c933bcace373aa8bdb5a60f15d54144b11","dn":"High on Arrival by Mackenzie Phillips EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"021558c933bcace373aa8bdb5a60f15d54144b11","infoHashBuffer":{"type":"Buffer","data":[2,21,88,201,51,188,172,227,115,170,139,219,90,96,241,93,84,20,75,17]},"name":"High on Arrival by Mackenzie Phillips EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}