{"title":"Dead on Arrival by Kiki Swinson EPUB","magnet":"magnet:?xt=urn:btih:024352df61d6a8e393808b40dd23df826d3d2413&dn=Dead+on+Arrival+by+Kiki+Swinson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"685265","seeders":"1","leechers":"0","description":"xx\r\n\r\nDead on Arrival by Kiki Swinson EPUB\r\n\r\nKiki Swinson&apos;s &quot;tension-packed&quot; (Library Journal) and &quot;unrelenting&quot; (Publishers Weekly) best-selling novels deliver startling twists, unforgettable characters - and a stark, unforgettable portrait of life in the South. Now she detonates an explosive tale about a couple who can&apos;t get enough - and a risk that will exact a merciless price.\r\n\r\nNobody will get hurt: Dawn and Reese Spencer just can&apos;t get ahead. Between her desperate desire to start a family and his gambling debts, they barely keep afloat, even with well-paying Norfolk International port jobs. But their calculating co-worker has the perfect plan: help him smuggle containers of precious, illegal - human - cargo past US Customs.\r\n\r\nNobody will know: For Dawn, risking the innocent lives of undocumented immigrants is unthinkable. But Reese persuades her that no one will get hurt. And once things proceed without a hitch and a fortune starts rolling in, the Spencers are sure their dreams are about to come true.\r\n\r\nNobody will live to tell: Until several immigrants turn up dead on arrival. Until Reese bets more than he can ever repay. Now the Feds and cold-blooded loan sharks are closing in, as the real brains behind the operation start killing off loose ends. And between love, lies, and revenge, it&apos;s every betrayer for themselves - no matter how lethal the cost.\r\n\r\nxx","last_updated":"2018-04-26T12:04:51.657Z","parsed":{"xt":"urn:btih:024352df61d6a8e393808b40dd23df826d3d2413","dn":"Dead on Arrival by Kiki Swinson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"024352df61d6a8e393808b40dd23df826d3d2413","infoHashBuffer":{"type":"Buffer","data":[2,67,82,223,97,214,168,227,147,128,139,64,221,35,223,130,109,61,36,19]},"name":"Dead on Arrival by Kiki Swinson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}