{"title":"The Lord Who Is Half Woman: Ardhanarisvara in Indian and Feminis","magnet":"magnet:?xt=urn:btih:02ad0c9b6e9ecbed38bfec997e39b602f51aed70&dn=The+Lord+Who+Is+Half+Woman%3A+Ardhanarisvara+in+Indian+and+Feminis&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Horisarte","categoryP":"other","categoryS":"e_books","size":"4699010","seeders":"0","leechers":"0","description":"A fascinating study from a modern feminist perspective of an androgynous Hindu god in Indian culture.\r\n\r\nThe designation &#x201C;Lord Who Is Half Woman&#x201D; refers to the androgynous Hindu god Ardhanarisvara (also known as Siva-Sakti). While iconographical aspects of this significant image have been addressed, the complex theological, philosophical, and social implications inherent in a dual gendered deity have not. This book provides the first extensive study of the influence of Ardhanarisvara, exploring four distinct areas of Indian culture, namely iconography, hatha yoga, devotional poetry (bhakti), and mythology. Ellen Goldberg also offers a feminist analysis of the ways in which &#x201C;male&#x201D; and &#x201C;female&#x201D; have been constructed in this image and the various representations pertaining to the broader gender implications of an androgynous deity.\r\n\r\n&#x201C;As a contribution to Indology and religious studies the book offers a careful reading of the iconography of the androgyne (or perhaps, &#x2018;gynandro&#x2019;), an innovative connection between ritual image and practice in the context of hathayoga, and a set of thoughtful reflections on the possibilities and limits of religion in re-imagining gendered identities.&#x201D; &#x2014; Journal of the American Academy of Religion\r\n\r\n&#x201C;A very sympathetic but also very critical look at the image from a variety of sophisticated hermeneutical perspectives. Goldberg is able to move through the image itself to the much broader issues of sexual differentiation, sexual justice, gender construction, androgyny across cultures, and more. The icon, in other words, acts as a kind of lens through which the author and her readers can &#x2018;see anew&#x2019; the world. I loved this book. It has the potential to become a classic Indological work.&#x201D; &#x2014; Jeffrey J. Kripal, author of Kali&apos;s Child: The Mystical and the Erotic in the Life and Teachings of Ramakrishna\r\n\r\nEllen Goldberg is Associate Professor of Religious Studies at Queen&#x2019;s University in Kingston, Ontario.\r\n <a href=\"\nhttp://www.sunypress.edu/p-3558-the-lord-who-is-half-woman.aspx\" rel=\"nofollow\" target=\"_NEW\">\nhttp://www.sunypress.edu/p-3558-the-lord-who-is-half-woman.aspx</a>","last_updated":"2018-02-08T12:00:54.201Z","parsed":{"xt":"urn:btih:02ad0c9b6e9ecbed38bfec997e39b602f51aed70","dn":"The Lord Who Is Half Woman: Ardhanarisvara in Indian and Feminis","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"02ad0c9b6e9ecbed38bfec997e39b602f51aed70","infoHashBuffer":{"type":"Buffer","data":[2,173,12,155,110,158,203,237,56,191,236,153,126,57,182,2,245,26,237,112]},"name":"The Lord Who Is Half Woman: Ardhanarisvara in Indian and Feminis","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}