{"title":"Sugar in the Blood by Andrea Stuart EPUB","magnet":"magnet:?xt=urn:btih:041867141656662b76ab5b732f959f03bf46110d&dn=Sugar+in+the+Blood+by+Andrea+Stuart+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4455586","seeders":"0","leechers":"0","description":"xx\r\n\r\nSugar in the Blood by Andrea Stuart EPUB\r\n\r\nIn the late 1630s, lured by the promise of the New World, Andrea Stuart&apos;s earliest known maternal ancestor, George Ashby, set sail from England to settle in Barbados. He fell into the life of a sugar plantation owner by mere chance, but by the time he harvested his first crop, a revolution was fully under way: the farming of sugar cane, and the swiftly increasing demands for sugar worldwide, would not only lift George Ashby from abject poverty and shape the lives of his descendants, but it would also bind together ambitious white entrepreneurs and enslaved black workers in a strangling embrace.\r\n\r\nStuart uses her own family story - from the seventeenth century to the present-as the pivot for this epic tale of migration, settlement, survival, slavery, and the making of the Americas. As it grew, the sugar trade enriched Europe as never before, financing the Industrial Revolution and fuelling the Enlightenment. It also became the basis of many economies in South America, played an important part in the evolution of the United States as a world power, and transformed the Caribbean into an archipelago of riches. But this sweet and hugely profitable trade - &#x201C;white gold,&#x201D; as it was known-had profoundly less palatable consequences in its precipitation of the enslavement of Africans to work the fields on the islands and, ultimately, throughout the American continents.\r\n\r\nInterspersing the tectonic shifts of colonial history with her family&apos;s experience, Stuart explores the interconnected themes of settlement, sugar, and slavery with extraordinary subtlety and sensitivity. In examining how these forces shaped her own family - its genealogy, intimate relationships, circumstances of birth, varying hues of skin - she illuminates how her family, among millions of others like it, in turn transformed the society in which they lived and how that interchange continues to this day.\r\n\r\n..\r\n\r\nxx","last_updated":"2018-06-06T12:03:25.318Z","parsed":{"xt":"urn:btih:041867141656662b76ab5b732f959f03bf46110d","dn":"Sugar in the Blood by Andrea Stuart EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"041867141656662b76ab5b732f959f03bf46110d","infoHashBuffer":{"type":"Buffer","data":[4,24,103,20,22,86,102,43,118,171,91,115,47,149,159,3,191,70,17,13]},"name":"Sugar in the Blood by Andrea Stuart EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}