{"title":"The Death's Head Chess Club by John Donoghue EPUB","magnet":"magnet:?xt=urn:btih:046cbf5479a3ad057dc3760c47c88cf4b80e8666&dn=The+Death%27s+Head+Chess+Club+by+John+Donoghue+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"951735","seeders":"59","leechers":"6","description":"xx\r\n\r\nThe Death&apos;s Head Chess Club by John Donoghue EPUB\r\n\r\nDebut author John Donoghue presents a suspenseful new novel about the improbable friendship between a Nazi officer and a Jewish chess player in Auschwitz.\r\n\r\nSS Obersturmf&#xFC;hrer Paul Meissner arrives in Auschwitz from the Russian front wounded and fit only for administrative duty. His most pressing task is to improve camp morale, so he establishes a chess club and allows officers and enlisted men to gamble on the games. Soon Meissner learns that chess is also played among the prisoners, and there are rumors of an unbeatable Jew known as &quot;the Watchmaker&quot;. Meissner&apos;s superiors begin to demand that he demonstrate German superiority by pitting this undefeated Jew against the best Nazi players. Meissner finds Emil Cl&#xE9;ment, the Watchmaker, and a curious relationship arises between them. As more and more games are played, the stakes rise, and the two men find their fates deeply entwined.\r\n\r\nTwenty years later, the two meet again in Amsterdam. Meissner has become a bishop, and Emil is playing in an international chess tournament. Having lost his family in the horrors of the death camps, Emil wants nothing to do with the ex-Nazi officer despite their history, but Meissner is persistent. &quot;What I hope,&quot; he tells Emil, &quot;is that I can help you to understand that the power of forgiveness will bring healing.&quot; As both men search for a modicum of peace, they recall a gripping tale of survival and trust.\r\n\r\nA suspenseful meditation on understanding and guilt, John Donoghue&apos;s The Death&apos;s Head Chess Club is a bold debut and a rich portrait of a surprising friendship.\r\n\r\nxx","last_updated":"2018-06-16T12:10:17.864Z","parsed":{"xt":"urn:btih:046cbf5479a3ad057dc3760c47c88cf4b80e8666","dn":"The Death's Head Chess Club by John Donoghue EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"046cbf5479a3ad057dc3760c47c88cf4b80e8666","infoHashBuffer":{"type":"Buffer","data":[4,108,191,84,121,163,173,5,125,195,118,12,71,200,140,244,184,14,134,102]},"name":"The Death's Head Chess Club by John Donoghue EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}