{"title":"The Piranhas: The Boy Bosses of Naples by Roberto Saviano EPUB","magnet":"magnet:?xt=urn:btih:04af6138edc569afe21a9e379955f26b39eb75b9&dn=The+Piranhas%3A+The+Boy+Bosses+of+Naples+by+Roberto+Saviano+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1241246","seeders":"1","leechers":"1","description":"xx\r\n\r\nThe Piranhas: The Boy Bosses of Naples by Roberto Saviano EPUB\r\n\r\n&#x201C;With the openhearted rashness that belongs to every true writer, Saviano returns to tell the story of the fierce and grieving heart of Naples.&#x201D; (Elena Ferrante)\r\n\r\nIn Gomorrah, a New York Times Book Review Notable Book of the Year, Roberto Saviano revealed a true, devastating portrait of Naples, Italy, under the rule of the Camorra, a crime organization more powerful and violent than the Mafia. In The Piranhas, the international best-selling author returns to his home city with an book about gang warfare and a young man&#x2019;s dark desire to rise to the top of Naples&#x2019; underworld.  \r\n\r\nNicolas Fiorillo is a brilliant and ambitious 15-year-old from the slums of Naples, eager to make his mark and to acquire power and the money that comes with it. With nine friends, he sets out to create a new paranza, or gang. Together they roam the streets on their motor scooters, learning how to break into the network of small-time hoodlums that controls drug dealing and petty crime in the city. They learn to cheat and to steal, to shoot semiautomatic pistols and AK-47s. Slowly they begin to wrest control of the neighborhoods from enemy gangs while making alliances with failing old bosses. Nicolas&#x2019; strategic brilliance is prodigious, and his cohorts&#x2019; rapid rise and envelopment in the ensuing maelstrom of violence and death is riveting and impossible to turn away from.   \r\n\r\nIn The Piranhas, Roberto Saviano imagines the lurid glamour of Nicolas&#x2019; story with all the vividness and insight that made Gomorrah a worldwide sensation.\r\n\r\nxx","last_updated":"2018-10-01T12:07:21.109Z","parsed":{"xt":"urn:btih:04af6138edc569afe21a9e379955f26b39eb75b9","dn":"The Piranhas: The Boy Bosses of Naples by Roberto Saviano EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"04af6138edc569afe21a9e379955f26b39eb75b9","infoHashBuffer":{"type":"Buffer","data":[4,175,97,56,237,197,105,175,226,26,158,55,153,85,242,107,57,235,117,185]},"name":"The Piranhas: The Boy Bosses of Naples by Roberto Saviano EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}