{"title":"Barbara Epstein.The Minsk Ghetto","magnet":"magnet:?xt=urn:btih:052a322dbb35f5ec317971aed607ee96048ba9b6&dn=Barbara+Epstein.The+Minsk+Ghetto&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Xiadxico","categoryP":"other","categoryS":"e_books","size":"1501029","seeders":"1","leechers":"0","description":"Drawing from engrossing survivors&apos; accounts, many never before published, The Minsk Ghetto 1941-1943 recounts a heroic yet little-known chapter in Holocaust history. In vivid and moving detail, Barbara Epstein chronicles the history of a Communist-led resistance movement inside the Minsk ghetto, which, through its links to its Belarussian counterpart outside the ghetto and with help from others, enabled thousands of ghetto Jews to flee to the surrounding forests where they joined partisan units fighting the Germans. Telling a story that stands in stark contrast to what transpired across much of Eastern Europe, where Jews found few reliable allies in the face of the Nazi threat, this book captures the texture of life inside and outside the Minsk ghetto, evoking the harsh conditions, the life-threatening situations, and the friendships that helped many escape almost certain death. Epstein also explores how and why this resistance movement, unlike better known movements at places like Warsaw, Vilna, and Kovno, was able to rely on collaboration with those outside ghetto walls. She finds that an internationalist ethos fostered by two decades of Soviet rule, in addition to other factors, made this extraordinary story possible","last_updated":"2018-03-17T12:04:24.771Z","parsed":{"xt":"urn:btih:052a322dbb35f5ec317971aed607ee96048ba9b6","dn":"Barbara Epstein.The Minsk Ghetto","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"052a322dbb35f5ec317971aed607ee96048ba9b6","infoHashBuffer":{"type":"Buffer","data":[5,42,50,45,187,53,245,236,49,121,113,174,214,7,238,150,4,139,169,182]},"name":"Barbara Epstein.The Minsk Ghetto","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}