{"title":"The Ables by Jeremy Scott AZW","magnet":"magnet:?xt=urn:btih:05685df3ad02d4ad3e9464fdf91c12d4a8a21e36&dn=The+Ables+by+Jeremy+Scott+AZW&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"505929","seeders":"32","leechers":"3","description":"xx\r\n\r\nThe Ables by Jeremy Scott AZW\r\n\r\nI did have fantastic hearing, mostly by virtue of being blind.But that couldn&apos;t actually mean that he&apos;s trying to tell me I have super powers, right? Because that would be ridiculous.\r\n\r\nIt wasn&apos;t the sex talk he expected. Phillip Sallinger&apos;s dad has told him he&apos;s a custodian - a guardian - and his genetically inherited power is telekinesis. He&apos;ll learn to move objects with his mind. Excited to begin superhero high school until he discovers he&apos;s assigned to a special-ed class for disabled empowered kids, he suddenly feels like an outsider. Bullied, threatened, and betrayed, Phillip struggles even as he and his friends - calling themselves the Ables - find ways to maximize their powers to overcome their disabilities and are the first to identify the growing evil threatening humanity. As vital custodians disappear and the custodian leadership is mired in indecision, a mysterious and powerful figure taunts Phillip, and the enemy is poised to strike. But what if the next &quot;one who does all&quot;, the multigifted custodian predicted to come, is one of the Ables?\r\n\r\nThe Ables is a fast-paced, captivating debut novel from Jeremy Scott, a bold new voice in fantasy and sci fi and already a widely popular storyteller as cocreator and narrator of CinemaSins, a YouTube channel that has amassed more than 3.8 million subscribers in under two years.\r\n\r\nxx","last_updated":"2018-06-03T12:08:07.119Z","parsed":{"xt":"urn:btih:05685df3ad02d4ad3e9464fdf91c12d4a8a21e36","dn":"The Ables by Jeremy Scott AZW","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"05685df3ad02d4ad3e9464fdf91c12d4a8a21e36","infoHashBuffer":{"type":"Buffer","data":[5,104,93,243,173,2,212,173,62,148,100,253,249,28,18,212,168,162,30,54]},"name":"The Ables by Jeremy Scott AZW","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}