{"title":"Time's Convert (Time's Convert, Book 1) by Deborah Harkness EPUB","magnet":"magnet:?xt=urn:btih:05ddcd0cd9d9d90fbff2e2f817789d27bbb77fc4&dn=Time%27s+Convert+%28Time%27s+Convert%2C+Book+1%29+by+Deborah+Harkness+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1848170","seeders":"1","leechers":"0","description":"xx\r\n\r\nTime&apos;s Convert (Time&apos;s Convert, Book 1) by Deborah Harkness EPUB\r\n\r\nFrom the number-one New York Times best-selling author of A Discovery of Witches, a novel about what it takes to become a vampire. \r\n\r\nSet in contemporary Paris and London, and the American colonies during the upheaval and unrest that exploded into the Revolutionary War, a sweeping story that braids together the past and present.  \r\n\r\nOn the battlefields of the American Revolution, Matthew de Clermont meets Marcus MacNeil, a young surgeon from Massachusetts, during a moment of political awakening when it seems that the world is on the brink of a brighter future. When Matthew offers him a chance at immortality and a new life, free from the restraints of his puritanical upbringing, Marcus seizes the opportunity to become a vampire. But his transformation is not an easy one, and the ancient traditions and responsibilities of the de Clermont family clash with Marcus&apos;s deeply held beliefs in liberty, equality, and brotherhood.  \r\n\r\nFast forward to contemporary London, where Marcus has fallen for Phoebe Taylor, a young employee at Sotheby&apos;s. She decides to become a vampire, too, and though the process at first seems uncomplicated, the couple discovers that the challenges facing a human who wishes to be a vampire are no less formidable in the modern world than they were in the 18th century. The shadows that Marcus believed he&apos;d escaped centuries ago may return to haunt them both - forever.  \r\n\r\nA passionate love story and a fascinating exploration of the power of tradition and the possibilities for change, Time&apos;s Convert will delight fans of the All Souls trilogy and all readers of magic, the supernatural, and romance.\r\n\r\nxx","last_updated":"2018-09-19T12:04:03.030Z","parsed":{"xt":"urn:btih:05ddcd0cd9d9d90fbff2e2f817789d27bbb77fc4","dn":"Time's Convert (Time's Convert, Book 1) by Deborah Harkness EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"05ddcd0cd9d9d90fbff2e2f817789d27bbb77fc4","infoHashBuffer":{"type":"Buffer","data":[5,221,205,12,217,217,217,15,191,242,226,248,23,120,157,39,187,183,127,196]},"name":"Time's Convert (Time's Convert, Book 1) by Deborah Harkness EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}