{"title":"The Gray Ghost by Clive Cussler (MOBI, EPUB, PDF)","magnet":"magnet:?xt=urn:btih:066844cd58e4e3eb38223439a878c07c6911b296&dn=The+Gray+Ghost+by+Clive+Cussler+%28MOBI%2C+EPUB%2C+PDF%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"mwsfan","categoryP":"other","categoryS":"e_books","size":"3673461","seeders":"45","leechers":"15","description":"The search for a legendary automobile threatens the careers and lives of husband-and-wife team Sam and Remi Fargo in this thrilling new adventure in Clive Cussler&apos;s bestselling series.\r\n\r\nIn 1906, a groundbreaking Rolls-Royce prototype known as the Gray Ghost vanishes from the streets of Manchester, England, and it is only the lucky intervention of an American detective named Isaac Bell that prevents it from being lost forever. Not even he can save the good name of Jonathan Payton, however, the man wrongly blamed for the theft, and more than a hundred years later, it is his grandson who turns to Sam and Remi Fargo to help prove his grandfather&apos;s innocence.\r\n\r\nBut there is even more at stake than any of them know. For the car has vanished again, and in it is an object so rare that it has the capacity to change lives. Men with everything to gain and a great deal to lose have a desperate plan to find it--and if anybody gets in their way? They have a plan for that, too.\r\n\r\n**\r\n\r\nReview\r\n\r\nPraise for *The Gray Ghost*\r\n\r\n&#x201C;The Gray Ghost showcases why readers love the various series of books written by Cussler and his co-authors. Burcell does a wonderful job adding richness and depth to the already established characters of Sam and Remi while telling a rip-roaring story.&#x201D;&#x2014;Associated Press\r\n\r\n&#x201C;A fast-paced tale that reaches back to the early days of automotive glory...A complicated and clever plot...The Fargos are great series characters, whip-smart and altruistic...Thriller fans will delight in this latest escapade. Cussler and co-author Burcell have delievered a winner.&#x201D;&#x2014;Kirkus Reviews (starred review)\r\n\r\n&#x201C;Refreshing...[The plot&#x2019;s] imaginative mix pumps new energy into [the] series.&#x201D;&#x2014;***Publishers Weekly\r\n\r\n&#x201C;The Fargo novels...deliver the goods for readers seeking action, adventure, and larger-than-life characters.&#x201D;&#x2014;*Booklist*\r\n\r\nAbout the Author\r\n\r\nCLIVE CUSSLER is the author or coauthor of more than seventy previous books in five bestselling series, including Dirk Pitt, NUMA Files, Oregon Files, Isaac Bell, and Sam and Remi Fargo. He lives in Arizona.\r\n\r\nROBIN BURCELL spent nearly three decades working in California law enforcement as a police officer, detective, hostage negotiator, and FBI-trained forensic artist. She is the author of ten novels, and co-author with Cussler of the Sam and Remi Fargo novel Pirate and The Romanov Ransom. She lives in Lodi, California","last_updated":"2018-07-02T12:13:16.916Z","parsed":{"xt":"urn:btih:066844cd58e4e3eb38223439a878c07c6911b296","dn":"The Gray Ghost by Clive Cussler (MOBI, EPUB, PDF)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"066844cd58e4e3eb38223439a878c07c6911b296","infoHashBuffer":{"type":"Buffer","data":[6,104,68,205,88,228,227,235,56,34,52,57,168,120,192,124,105,17,178,150]},"name":"The Gray Ghost by Clive Cussler (MOBI, EPUB, PDF)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}