{"title":"Invention of Murder [Victorians,Death and Detection]-J. Flanders","magnet":"magnet:?xt=urn:btih:069d45c4e196f3be6ea512e11ae52d8a965a0f15&dn=Invention+of+Murder+%5BVictorians%2CDeath+and+Detection%5D-J.+Flanders&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ComGetMe","categoryP":"audio","categoryS":"audio_books","size":"1046054239","seeders":"25","leechers":"16","description":"\r\nMurder in the nineteenth century was rare and it&#x2019;s unlikely that the British thought of murder much at all during the first decade of the 19th century in 1810, there were a mere 15 murder convictions in England and Wales combined. \r\n \r\nThe public&#x2019;s perception of random lethal violence changed with the horrific 1811 Ratcliffe Highway killings, brutal mass murders in London&#x2019;s East End that coincided with technological advances that enabled swifter and cheaper production of broadsheets describing the crimes. Flanders&#x2019;s convincing and smart synthesis of the evolution of an official police force, fictional detectives, and real life cause c&#xE9;l&#xE8;bres will appeal to devotees of true crime and detective fiction alike\r\n \r\nIn this meticulously researched and engrossing book, Judith Flanders retells the gruesome stories of many different types of murder in Great Britain, both famous and obscure: from Greenacre, who transported his dismembered fianc&#xE9;e around town by omnibus, to Burke and Hare&#x2019;s body snatching business in Edinburgh; from the crimes [and myths] of Sweeney Todd and Jack the Ripper, to the tragedy of the murdered Marr family in London&#x2019;s East End. \r\n \r\nThrough these stories of murder from the brutal to the pathetic Flanders builds a rich and multi faceted portrait of Victorian society in Great Britain.\r\n \r\nThe author does not track the history of crime solving during this period; most crimes were solved by the simple expedient of someone pointing a finger. \r\n \r\nThe accused had very few rights, and those who couldn&#x2019;t afford to pay a lawyer were on their own. Flanders devotes most of her book to murders one after another after another, many sensational, and others notable for the innocence of the executed. Since the author does not present the murders chronologically, it&#x2019;s difficult to tell if the murder trials had any effect on the evolution of the rights of defendants. Instead, Flanders organizes the text according to who killed whom: husband/wife, servants/employers, etc...\r\n\r\n\r\nRead by: Janice McKenzie\r\n\r\nFormat: Stereo mp3\r\n\r\nBit Rate: 128Kbps/44.1Hz\r\n\r\n\r\nRemember to tip your uploader and seed! :)","last_updated":"2018-06-03T12:08:17.213Z","parsed":{"xt":"urn:btih:069d45c4e196f3be6ea512e11ae52d8a965a0f15","dn":"Invention of Murder [Victorians,Death and Detection]-J. Flanders","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"069d45c4e196f3be6ea512e11ae52d8a965a0f15","infoHashBuffer":{"type":"Buffer","data":[6,157,69,196,225,150,243,190,110,165,18,225,26,229,45,138,150,90,15,21]},"name":"Invention of Murder [Victorians,Death and Detection]-J. Flanders","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}