{"title":"Positive Grid BIAS AMP 2 Pack 2.1.0.870 Elite [TeamOS]","magnet":"magnet:?xt=urn:btih:06b0d2c67adf97595385a55947e2495fd93355cd&dn=Positive+Grid+BIAS+AMP+2+Pack+2.1.0.870+Elite+%5BTeamOS%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"OnlyByTheRain","categoryP":"applications","categoryS":"windows","size":"218853349","seeders":"9","leechers":"7","description":"BIAS AMP 2 is the ultimate virtual amp designer, authentically recreating the tone and feel of real tube amplifiers, while allowing you to mix and match components to create your ideal amp. You can use Amp Match to clone the tone of real hardware or a guitar track, or connect to the ToneCloud&#xAE; to gain access to thousands of custom amps from artists and recording studios, or upload your own custom tones to the cloud. BIAS AMP 2 represents a revolution in virtual amplifier design, providing the tools to take your ultimate guitar tone with you anywhere, from the studio to the stage and back again. \r\n\r\nDYNAMIC TONE ENGINE \r\n\r\nFor BIAS AMP 2 we worked with artists, engineers and recording studios to improve the already hyper-authentic touch response of our amplifier circuits. The result is a new playing experience, with increased touch responsiveness and dynamics. With new tubes, transformer, dynamic tone control and a completely redesigned speaker cabinet module with multi-mic capability, you now have the tools to take your tone explorations further than ever before! \r\n\r\nBIAS MEETS CELESTION \r\n\r\nWhen it comes to speakers, Celestion is the most trusted name in the history of rock and roll. Their drivers have been used on more classic songs and tones than any other manufacturer, and their impulse responses are the favorites of guitarists ranging from Pete Thorn and Scott Henderson to George Lynch. We&#x2019;ve partnered with Celestion to make their IR&#x2019;s easier to use than ever before, so you can forget loading individual files! Just select a custom Celestion cab and start moving the mics around &#x2013; BIAS AMP 2 does the rest","last_updated":"2018-03-17T12:12:13.326Z","parsed":{"xt":"urn:btih:06b0d2c67adf97595385a55947e2495fd93355cd","dn":"Positive Grid BIAS AMP 2 Pack 2.1.0.870 Elite [TeamOS]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"06b0d2c67adf97595385a55947e2495fd93355cd","infoHashBuffer":{"type":"Buffer","data":[6,176,210,198,122,223,151,89,83,133,165,89,71,226,73,95,217,51,85,205]},"name":"Positive Grid BIAS AMP 2 Pack 2.1.0.870 Elite [TeamOS]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}