{"title":"Endless Legend","magnet":"magnet:?xt=urn:btih:06f376bc59771fd906bac113a7e040e2122b9e24&dn=Endless+Legend&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"freedisk","categoryP":"games","categoryS":"pc","size":"1842796483","seeders":"0","leechers":"0","description":"Create your own Legend\r\nAnother sunrise, another day of toil. Food must be grown, industries built, science and magic advanced, and wealth collected. Urgency drives these simple efforts, however, for your planet holds a history of unexplained apocalypse, and the winter you just survived was the worst on record. A fact that has also been true for the previous five.\r\n\r\nAs you discover the lost secrets of your world and the mysteries of the legends and ruins that exist as much in reality as in rumor, you will come to see that you are not alone. Other peoples also struggle to survive, to grow, and perhaps even to conquer.\r\n\r\nYou have a city, a loyal populace, and a few troops; your power and magic should be sufficient to keep them alive. But beyond that, nothing is certain&#x2026; Where will you go, what will you find, and how will you react? Will your trail be one of roses, or of blood?\r\n\r\nExplore fantastic lands.\r\nLead one of eight civilizations each with a unique gameplay style and storyline.\r\nSurvive through cold dark seasons that drive Auriga to its end. Will it also be yours?\r\nExperience an endless replayability with randomly generated worlds and quests.\r\nSet the size, shape, topography and more... to create your own world to discover.\r\n\r\nExpand beyond the unknown.\r\nConquer, build and develop villages into feared fortresses or wonderful cities.\r\nAssimilate powerful minor factions and use their special traits and units wisely.\r\nHire, equip and train your heroes to become army leaders or city governors.\r\nRaise your civilization by finding mysterious artefacts and forgotten technologies.\r\n\r\nExploit every opportunity.\r\nEvolve your civilization through the discovery of new advanced technologies.\r\nCollect Dust, luxuries and strategic resources tradable on the marketplace.\r\nKeep one step ahead of other civilizations through trade and subtle diplomacy.\r\nChoose from different victory conditions and adapt your strategy on the fly.\r\n\r\nExterminate fools who defy you.\r\nExperience an innovative dynamic simultaneous turn-based battle system.\r\nUse unit equipment, abilities and the terrain to overcome your opponents.\r\nZoom out of a battle and rule the other aspects of your empire seamlessly.\r\nDefine your custom civilizations and confront those created by your friends","last_updated":"2018-10-02T12:17:37.511Z","parsed":{"xt":"urn:btih:06f376bc59771fd906bac113a7e040e2122b9e24","dn":"Endless Legend","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"06f376bc59771fd906bac113a7e040e2122b9e24","infoHashBuffer":{"type":"Buffer","data":[6,243,118,188,89,119,31,217,6,186,193,19,167,224,64,226,18,43,158,36]},"name":"Endless Legend","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}