{"title":"FantasyMassage - Gina Valentina (Private Massage) NEW 28 March 2","magnet":"magnet:?xt=urn:btih:0717c1c9d16643459927b244fa3a156c099eb586&dn=FantasyMassage+-+Gina+Valentina+%28Private+Massage%29+NEW+28+March+2&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"401864560","seeders":"25","leechers":"18","description":"Gina Valentina&apos;s back is killing her. When she calls her favorite massage parlor to see if she can get an in-house visit that day, she&apos;s relieved to find out that they can send someone over within the hour. She answers the door to find Romeo Price eager to service her. As she sets up his massage table in the living room, Gina retreats to the bathroom to change. She lies down on the table as Romeo lifts the towel to check out her ass. When he notices that she&apos;s wearing underwear, he asks her if she&apos;s gonna keep that on, Gina laughs awkwardly and says that she is. Romeo shrugs his shoulders and tells her he&apos;ll work around it as he begins oiling up his hands. He works on her back and moves down to her legs. When she notices that he&apos;s getting pretty close to her ass he tells her he needs to work on some nerve endings and doesn&apos;t really have a choice in the matter. If he&apos;s gonna fix her back he&apos;s gonna have to get in all those uncomfortable places. Since he&apos;s the masseuse she doesn&apos;t question him. When he asks her to turn over to massage her upper thighs, she tells him she never got massaged in that area before. He tells her that&apos;s probably due to the fact that she never got a proper massage before. Before she has time to respond he starts taking off her panties. When he reminds her of those hard to reach areas, Gina can&apos;t seem to find a reason to stop him. When he finally puts his dick inside her, he provides the relief she&apos;s been seeking this whole time.\r\nCategories Oil, Tattoo, Blowjob, Deepthroat, Hardcore, Fingering, Natural Tits, Latina, Massage\r\n <a href=\"\nhttp://imgdone.com/image/O7LC\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/O7LC</a>\r\n <a href=\"\nhttp://imgdone.com/image/OuKH\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/OuKH</a>","last_updated":"2018-03-28T12:18:32.011Z","parsed":{"xt":"urn:btih:0717c1c9d16643459927b244fa3a156c099eb586","dn":"FantasyMassage - Gina Valentina (Private Massage) NEW 28 March 2","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0717c1c9d16643459927b244fa3a156c099eb586","infoHashBuffer":{"type":"Buffer","data":[7,23,193,201,209,102,67,69,153,39,178,68,250,58,21,108,9,158,181,134]},"name":"FantasyMassage - Gina Valentina (Private Massage) NEW 28 March 2","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}