{"title":"The Field of Blood by Joanne B. Freeman EPUB","magnet":"magnet:?xt=urn:btih:078e976cdc998b174d06633d47080f87e5129cd5&dn=The+Field+of+Blood+by+Joanne+B.+Freeman+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"49864643","seeders":"1","leechers":"49","description":"xx\r\n\r\nThe Field of Blood: Violence in Congress and the Road to Civil War by Joanne B. Freeman EPUB\r\n\r\nThe previously untold story of the violence in Congress that helped spark the Civil War \r\n\r\nIn The Field of Blood, Joanne B. Freeman recovers the long-lost story of physical violence on the floor of the US Congress. Drawing on an extraordinary range of sources, she shows that the Capitol was rife with conflict in the decades before the Civil War. Legislative sessions were often punctuated by mortal threats, canings, flipped desks, and all-out slugfests. When debate broke down, congressmen drew pistols and waved Bowie knives. One representative even killed another in a duel. Many were beaten and bullied in an attempt to intimidate them into compliance, particularly on the issue of slavery. \r\n\r\nThese fights didn&#x2019;t happen in a vacuum. Freeman&#x2019;s dramatic accounts of brawls and thrashings tell a larger story of how fisticuffs and journalism, and the powerful emotions they elicited, raised tensions between North and South and led toward war. In the process, she brings the antebellum Congress to life, revealing its rough realities - the feel, sense, and sound of it - as well as its nation-shaping import. \r\n\r\nFunny, tragic, and rivetingly told, The Field of Blood offers a front-row view of congressional mayhem and sheds new light on the careers of John Quincy Adams, Henry Clay, and other luminaries, as well as introducing a host of lesser-known but no less fascinating men. The result is a fresh understanding of the workings of American democracy and the bonds of Union on the eve of their greatest peril. \r\n\r\nxx","last_updated":"2018-10-13T12:26:23.268Z","parsed":{"xt":"urn:btih:078e976cdc998b174d06633d47080f87e5129cd5","dn":"The Field of Blood by Joanne B. Freeman EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"078e976cdc998b174d06633d47080f87e5129cd5","infoHashBuffer":{"type":"Buffer","data":[7,142,151,108,220,153,139,23,77,6,99,61,71,8,15,135,229,18,156,213]},"name":"The Field of Blood by Joanne B. Freeman EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}