{"title":"JetBrains DataGrip [2018.1.2]","magnet":"magnet:?xt=urn:btih:07e6be5a27897d91304568eaf69020932fa0e479&dn=JetBrains+DataGrip+%5B2018.1.2%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"nikita200","categoryP":"applications","categoryS":"windows","size":"147920897","seeders":"6","leechers":"4","description":"JetBrains DataGrip [2018.1.2]\r\n\r\n\r\n\r\nDataGrip is the multi-engine database environment. We support MySQL, PostgreSQL, Microsoft SQL Server, Oracle, Sybase, DB2, SQLite, HyperSQL, Apache Derby and H2. If the DBMS has a JDBC driver you can connect to it via DataGrip. For any of supported engines it provides database introspection and various instruments for creating and modifying objects.\r\nFeatures:\r\nDatabase objects\r\nDataGrip introspects all objects in your databases and displays them grouped in folders by schemas. It also provides UI for adding and editing tables, columns, indexes, constraints etc.\r\n\r\nNavigation\r\nQuick navigation brings you to any object no matter if it has just been created in your code, or has already been read from a database. Navigate to symbol action lets you find objects by their name.\r\n\r\nTable editor\r\nPowerful table editor lets you add, remove, edit, and clone data rows. Navigate through the data by foreign keys and use the text search to find anything in the data displayed in the table editor.\r\n\r\nCode completion\r\nDataGrip provides context-sensitive, schema-aware code completion, helping you to write code faster. Completion is aware of the tables structure, foreign keys, and even database objects created in code you&apos;re editing.\r\n\r\nCode generation\r\nForget about writing typical code manually: DataGrip will do that for you. It generates code for changing objects like tables, columns, etc., based on UI. Moreover, it helps you to get DDL for tables and provides DML queries from result-sets.\r\n\r\nRenaming and finding usages\r\nDataGrip correctly resolves all table and column references in your SQL files. If you rename any variable or alias, they are renamed throughout the entire code. When you&apos;re renaming database objects from SQL, they will also be renamed in the actual database","last_updated":"2018-04-29T12:11:24.212Z","parsed":{"xt":"urn:btih:07e6be5a27897d91304568eaf69020932fa0e479","dn":"JetBrains DataGrip [2018.1.2]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"07e6be5a27897d91304568eaf69020932fa0e479","infoHashBuffer":{"type":"Buffer","data":[7,230,190,90,39,137,125,145,48,69,104,234,246,144,32,147,47,160,228,121]},"name":"JetBrains DataGrip [2018.1.2]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}