{"title":"The Model Teacher Parts 1 and 2","magnet":"magnet:?xt=urn:btih:07fd9190ed355b6bcc42d6f3fc7abbef565ad463&dn=The+Model+Teacher+Parts+1+and+2&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"torilicious","categoryP":"porn","categoryS":"hd___movies","size":"4077960860","seeders":"0","leechers":"4","description":"The Model Teacher Part 1 (1080p) \r\nLily Labeau tries to get out of photography class to attend the party of the year. When she calls her photography teacher Celeste Star with a made up excuse, Celeste invites her to come over the following morning to give her a private lesson. Lily takes the offer, even though she will probably be really hung over. At 7 o&apos;clock the next morning, Lily rings her teacher&apos;s doorbell. Ms. Star opens the door in a slinky black robe that&apos;s barely closed. She hands Lily the camera. Lily asks who will be the model since the usual ones aren&apos;t there. Celeste takes off her robe and announces that she is going to model. \r\n\r\nLily giggles nervously as her teacher stands before her in the nude. She takes a few head shots then Celeste checks her progress and gives her some pointers. Celeste gets Lily to take a close up of her breasts. She pinches her nipples to harden them. Lily takes more photos. Celeste reviews her work and praises her. She gives her a more challenging assignment to take a photo of her pussy. Then another with her legs slightly spread. Lily takes a few shots then stops. She was raised to be conservative and doesn&apos;t like shooting nudity. Celeste tells her to just shoot her boobs in that case. She thinks Lily is too nervous. To help her loosen up, she comes up close and takes off Lily&apos;s shirt. She tickles her soft skin and massages her shoulders. She kisses her back. Eventually, Lily lets her kiss her with tongue. \r\n\r\nCeleste removes the rest of Lily&apos;s clothes then she places her fingers along the opening of Lily&apos;s pussy. She caresses it gently and takes it in her mouth. Lily reciprocates on her teacher&apos;s wet slit. Then Celeste demonstrates how to scissor fuck. She tribs her till they cum simultaneously. Lily leans over Celeste&apos;s pussy while she grinds against the teacher&apos;s tongue, both of them cumming hard in 69!\r\n\r\nThe Model Teacher Part 2 (1080p) \r\nAfter student Lily Labeau&apos;s private lesson with photography teacher Celeste Star, the ladies get together for a second session. This time Celeste is shooting the camera and Lily is modelling for her. Lily has really come out of her shell since their first one-on-one. She sits half naked on the bed in sexy poses and teases the teacher by slowly removing her bra. She starts to play with her panties and show off her bush, then she turns around and flaunts her tight ass. Lily takes off her panties and spreads her legs tempting Celeste to bring the camera close. \r\n\r\nWhen Celeste shows her the photos, Lily praises her work and admits she&apos;s been trying to seduce her this whole time. Celeste demonstrates with kisses and caresses that she had her at hello. Once Celeste is naked, Lily goes down on her pussy and brings her to orgasm. Then she sits on the teacher&apos;s face and writhes against her tongue until she cums. Celeste eats her asshole and Lily returns the favor. Afterward the lesbians trib, then Celeste fingers Lily&apos;s pussy till she&apos;s spent!","last_updated":"2018-03-12T12:37:49.797Z","parsed":{"xt":"urn:btih:07fd9190ed355b6bcc42d6f3fc7abbef565ad463","dn":"The Model Teacher Parts 1 and 2","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"07fd9190ed355b6bcc42d6f3fc7abbef565ad463","infoHashBuffer":{"type":"Buffer","data":[7,253,145,144,237,53,91,107,204,66,214,243,252,122,187,239,86,90,212,99]},"name":"The Model Teacher Parts 1 and 2","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}