{"title":"The Child Thief by Bella Forrest EPUB","magnet":"magnet:?xt=urn:btih:080387d6eb4d51f6b35a4725a5870f90624b37e7&dn=The+Child+Thief+by+Bella+Forrest+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"943219","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Child Thief (The Child Thief Series, Book 1) by Bella Forrest EPUB\r\n\r\nThey call her Robin Hood....\r\n\r\nIn a world where we have government of the rich, by the rich, for the rich, one girl decides to fight back.\r\n\r\nAmerica in 2105 is beset with mass inequality, poverty, and increasingly large numbers of the poor. This, combined with the breakdown of families and marriages, has led to huge economic and societal burdens. A fractured and divided America ushers in an authoritarian government that promises to solve all these problems in one stroke with a radical solution.\r\n\r\nWelcome to the CRAS: the Child Redistribution Adoption System. Also known as the cure for America&apos;s failing economy, it is the bane of 19-year-old Robin Sylvone&apos;s existence.\r\n\r\nUnder the system, millions of poor families have their children taken and given to the rich. As a single teen mother, Robin fell within the scope of the scheme and lost her baby two years ago. After being forced to drop out of school and become a factory worker in order to support herself, she doesn&apos;t see much light in her future - or hold any hope of seeing her child again.\r\n\r\nUntil she stumbles upon a group of misfits who share her frustrations and desire for change. They are an underground movement of thieves, stealing children back from the rich and returning them to the poor.\r\n\r\nRobin will do anything to find her daughter, even if it means tangling with a government that has zero tolerance for rebellion. Even when the penalty is death.\r\n\r\nWill Robin find her baby girl? Or is she destined to the same fate all other rebels have met at the hands of the United Nation of America?\r\n\r\nBuy now to find out....\r\n\r\nFans of The Gender Game, The Handmaid&apos;s Tale, or The Hunger Games will be gripped by this thrill ride through a chillingly warped America. \r\n\r\nxx","last_updated":"2018-09-18T12:03:06.194Z","parsed":{"xt":"urn:btih:080387d6eb4d51f6b35a4725a5870f90624b37e7","dn":"The Child Thief by Bella Forrest EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"080387d6eb4d51f6b35a4725a5870f90624b37e7","infoHashBuffer":{"type":"Buffer","data":[8,3,135,214,235,77,81,246,179,90,71,37,165,135,15,144,98,75,55,231]},"name":"The Child Thief by Bella Forrest EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}