{"title":"The Theory of Everything: The Origin and Fate of the Universe","magnet":"magnet:?xt=urn:btih:086e895a6e1c4665966f8db2fb42864115150f2c&dn=The+Theory+of+Everything%3A+The+Origin+and+Fate+of+the+Universe&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"CopperSun","categoryP":"audio","categoryS":"audio_books","size":"101163909","seeders":"0","leechers":"0","description":"The Theory of Everything: The Origin and Fate of the Universe \r\n\r\n\r\nBy Stephen Hawking \r\n\r\nNarrated by Michael York \r\n\r\nPublished by Phoenix Books in 2005 \r\n\r\nEnglish, 3 hours 30 minutes, Unabridged \r\n\r\nMP3 64 kbps, 96.48 MB, 3 file(s) \r\n\r\n\r\n\r\nStephen Hawking is widely believed to be one of the world&#x2019;s greatest minds: a brilliant theoretical physicist whose work helped to reconfigure models of the universe and to redefine what&#x2019;s in it. Imagine sitting in a room listening to Hawking discuss these achievements and place them in historical context. It would be like hearing Christopher Columbus on the New World.\r\n\r\nHawking presents a series of seven lectures&#x2014;covering everything from big bang to black holes to string theory&#x2014;that capture not only the brilliance of Hawking&#x2019;s mind but his characteristic wit as well. Of his research on black holes, which absorbed him for more than a decade, he says, &#x201C;It might seem a bit like looking for a black cat in a coal cellar.&#x201D;\r\n\r\nHawking begins with a history of ideas about the universe, from Aristotle&#x2019;s determination that the Earth is round to Hubble&#x2019;s discovery, over 2000 years later, that the universe is expanding. Using that as a launching pad, he explores the reaches of modern physics, including theories on the origin of the universe (e.g., the big bang), the nature of black holes, and space-time. Finally, he poses the questions left unanswered by modern physics, especially how to combine all the partial theories into a &#x201C;unified theory of everything.&#x201D; &#x201C;If we find the answer to that,&#x201D; he claims, &#x201C;it would be the ultimate triumph of human reason.&#x201D;\r\n\r\nA great popularizer of science as well as a brilliant scientist, Hawking believes that advances in theoretical science should be &#x201C;understandable in broad principle by everyone, not just a few scientists.&#x201D; In this book, he offers a fascinating voyage of discovery about the cosmos and our place in it. It is a book for anyone who has ever gazed at the night sky and wondered what was up there and how it came to be","last_updated":"2018-08-25T12:04:08.933Z","parsed":{"xt":"urn:btih:086e895a6e1c4665966f8db2fb42864115150f2c","dn":"The Theory of Everything: The Origin and Fate of the Universe","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"086e895a6e1c4665966f8db2fb42864115150f2c","infoHashBuffer":{"type":"Buffer","data":[8,110,137,90,110,28,70,101,150,111,141,178,251,66,134,65,21,21,15,44]},"name":"The Theory of Everything: The Origin and Fate of the Universe","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}