{"title":"FantasyMassage - Kendra Spade (Asian Bath Fantasy) NEW 23 May 20","magnet":"magnet:?xt=urn:btih:089dda5634300e7d98e9a6116023d6358a300bd1&dn=FantasyMassage+-+Kendra+Spade+%28Asian+Bath+Fantasy%29+NEW+23+May+20&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"331055249","seeders":"25","leechers":"19","description":"When Jake Adams walks into the massage parlor, he can&apos;t seem to find anyone to greet him. When Kendra Spade pops out from the back, she looks so hot in her silk robe. When she greets him she asks how she can be of service. Jake is at a loss for words, he&apos;s not sure what he wants but he certainly wants a massage. Perhaps something out of the ordinary? Kendra smiles as she informs him that she has something that she&apos;s pretty sure he&apos;s gonna love. When she asks him to follow her, he does as he&apos;s told. She fills up the bath and starts massaging his shoulders. You can tell he&apos;s enjoying himself as he closes his eyes and relaxes into it. She soaps up her hands and massages his chest asking him if he&apos;s satisfied. He nods as she continues to work on him. When she starts stroking his dick, he can&apos;t believe his luck...this is the best day of his life! When she gets in the tub with him, he can&apos;t imagine this massage getting any better, that is until she starts sucking his dick. She deepthroat&apos;s it, chocking on it as she slams the back of her throat. When she knows it&apos;s not going to get any harder she asks him to fuck her which he does willingly and with the utmost enthusiasm. He pulls it out and eats her pussy as he teases her before putting it back in. She then gets on top of him and rids his dick making sure it&apos;s hitting her g-spot in all the right places. When he&apos;s about to cum she makes sure he blows his load right in her mouth, after all, a good customer is a happy one!\r\nCategories Kissing, Asian, Blowjob, Cum in Mouth, Deepthroat, Hardcore, Fingering, Natural Tits, Massage, Bath\r\n <a href=\"\nhttp://imgdone.com/image/X0I4P\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/X0I4P</a>\r\n <a href=\"\nhttp://imgdone.com/image/X0Pah\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/X0Pah</a>","last_updated":"2018-05-23T12:08:45.149Z","parsed":{"xt":"urn:btih:089dda5634300e7d98e9a6116023d6358a300bd1","dn":"FantasyMassage - Kendra Spade (Asian Bath Fantasy) NEW 23 May 20","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"089dda5634300e7d98e9a6116023d6358a300bd1","infoHashBuffer":{"type":"Buffer","data":[8,157,218,86,52,48,14,125,152,233,166,17,96,35,214,53,138,48,11,209]},"name":"FantasyMassage - Kendra Spade (Asian Bath Fantasy) NEW 23 May 20","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}