{"title":"Tiger Woods by Jeff Benedict, Armen Keteyian EPUB","magnet":"magnet:?xt=urn:btih:08e516422379ee00ad583e4d989c4e6af361faa1&dn=Tiger+Woods+by+Jeff+Benedict%2C+Armen+Keteyian+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"34287454","seeders":"0","leechers":"0","description":"xx\r\n\r\nTiger Woods by Jeff Benedict, Armen Keteyian EPUB\r\n\r\nBased on three years of extensive research and reporting, two of today&apos;s most acclaimed investigative journalists, Jeff Benedict of Sports Illustrated and 11-time Emmy Award winner Armen Keteyian, deliver the first major biography of Tiger Woods - sweeping in scope and packed with groundbreaking, behind-the-scenes details of the Shakespearean rise and epic fall of an American icon.\r\n\r\nIn 2009, Tiger Woods was the most famous athlete on the planet, a transcendent star of almost unfathomable fame and fortune living what appeared to be the perfect life - married to a Swedish beauty and the father of two young children. Winner of 14 major golf championships and 79 PGA Tour events, Woods was the first billion-dollar athlete, earning more than $100 million a year in endorsements from the likes of Nike, Gillette, AT&amp;T, and Gatorade.\r\n\r\nBut it was all a carefully crafted illusion. As it turned out, Woods had been living a double life for years - one that exploded in the aftermath of a Thanksgiving night crash that exposed his serial infidelity and sent his personal and professional life off a cliff. In Tiger Woods, Jeff Benedict and Armen Keteyian, the team behind the recent New York Times best seller The System, dig deep behind the headlines to produce a richly reported answer to the question that has mystified millions of sports fans for nearly a decade: Who is Tiger Woods?\r\n\r\nDrawing on more than 400 interviews with people from every corner of Woods&apos; life - friends, family members, teachers, romantic partners, swing coaches, business associates, Tour pros, and members of Woods&apos; inner circle - Benedict and Keteyian construct a captivating psychological profile of an African American child programmed by an attention-grabbing father and the original Tiger Mom to be the &quot;chosen one&quot;, to change not just the game of golf but the world as well. But at what cost? Benedict and Keteyian provide the starling answers in a biography destined to make headlines and linger in the minds of readers for years to come.\r\n\r\nxx","last_updated":"2018-03-29T12:09:05.966Z","parsed":{"xt":"urn:btih:08e516422379ee00ad583e4d989c4e6af361faa1","dn":"Tiger Woods by Jeff Benedict, Armen Keteyian EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"08e516422379ee00ad583e4d989c4e6af361faa1","infoHashBuffer":{"type":"Buffer","data":[8,229,22,66,35,121,238,0,173,88,62,77,152,156,78,106,243,97,250,161]},"name":"Tiger Woods by Jeff Benedict, Armen Keteyian EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}