{"title":"NATO Crimes in Aggression on Serbia in 1999 Part II","magnet":"magnet:?xt=urn:btih:08f8a238507508d1d59eab7d8119aea9a4003f49&dn=NATO+Crimes+in+Aggression+on+Serbia+in+1999+Part+II&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"PraetorianM","categoryP":"other","categoryS":"e_books","size":"49936251","seeders":"0","leechers":"0","description":"Part II of the Documents on NATO Aggression on Serbia\r\n\r\nNineteen (19) wealthiest countries in the world, with their formidable military might, illegally and savagely attacked one small country, drained of resources and prevented to re-arm due to decade-long international sanctions and blockades.\r\n\r\nEven in those conditions, the Serbs stood their ground and fought back the barbaric attacks for 78 days. How many days, if the same conditions would apply, would sustain - say, Italy? Or Austria? etc.\r\n\r\nSerbia was attacked because they Government was fighting an armed separatist rebellion by Albanian ethnic minority, supported in arms, logistics, politically and with relentless media propaganda (fake news - now we all know what that means)by the West, primarily by the Americans and the British.\r\n\r\nWhen a decade before that the West, this time mostly Germans and Austrians (both fighting against the Serbs in two world Wars) to destroy Yugoslavia (with abundant help from the various idiots from the within, no doubt about that), the famous International Law and Order, established after the WWI, was in effect - destroyed. The German Foreign Minister was in Slovenia to confirm they are recognizing their &quot;independence&quot; (the very first in the whole history of &quot;Slovenia&quot;), before the ink was dried on the Slovenian letter asking this...\r\n\r\nThe final nail in the coffin of the International Law was the illegal, barbaric attack of NATO, without UN SC decision, on a sovereign European country, a founder of the UN (as legal successor of Yugoslavia) and of OSCE Agreement that was guaranteeing the internationally recognized borders in post-WWII Europe.\r\n\r\nBut Americans said that &quot;Kosovo is a special case&quot;. Now we see how many other &quot;special cases&quot; are appearing because they disregarded the International Law and Order when attacking Serbia.\r\n\r\nEverything later was much easier for the new masters of the World: Afghanistan, Iraq, Libya, Syria, &quot;the Arab Spring&quot; etc.\r\n\r\nIn the aggression on Serbia, NATO killed approx 3,500 men, women and children, and around 1,000 soldiers and policemen. They were bombing schools, railways, hospitals, TV broadcasters - regardless of the fact they were not of any military function. They even destroyed - get this - the Chinese Emabssy in Belgrade.\r\n\r\nYesterday, 24 of March was nineteen years to the date when the barbarians attacked, only because - they could.\r\n\r\nNever forgive. Never forget","last_updated":"2018-03-25T12:05:58.481Z","parsed":{"xt":"urn:btih:08f8a238507508d1d59eab7d8119aea9a4003f49","dn":"NATO Crimes in Aggression on Serbia in 1999 Part II","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"08f8a238507508d1d59eab7d8119aea9a4003f49","infoHashBuffer":{"type":"Buffer","data":[8,248,162,56,80,117,8,209,213,158,171,125,129,25,174,169,164,0,63,73]},"name":"NATO Crimes in Aggression on Serbia in 1999 Part II","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}