{"title":"The Glass Cage: Automation and Us by Nicholas Carr EPUB","magnet":"magnet:?xt=urn:btih:09b39954899ba89d1b71c2fa572c60088daf1f36&dn=The+Glass+Cage%3A+Automation+and+Us+by+Nicholas+Carr+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"347670","seeders":"45","leechers":"8","description":"xx \r\n\r\nThe Glass Cage: Automation and Us by Nicholas Carr EPUB \r\n\r\nAt once a celebration of technology and a warning about its misuse, The Glass Cage will change the way you think about the tools you use every day. \r\n\r\nIn The Glass Cage, bestselling author Nicholas Carr digs behind the headlines about factory robots and self-driving cars, wearable computers and digitized medicine, as he explores the hidden costs of granting software dominion over our work and our leisure. Even as they bring ease to our lives, these programs are stealing something essential from us. \r\n\r\nDrawing on psychological and neurological studies that underscore how tightly people&#x2019;s happiness and satisfaction are tied to performing hard work in the real world, Carr reveals something we already suspect: shifting our attention to computer screens can leave us disengaged and discontented. \r\n\r\nFrom nineteenth-century textile mills to the cockpits of modern jets, from the frozen hunting grounds of Inuit tribes to the sterile landscapes of GPS maps, The Glass Cage explores the impact of automation from a deeply human perspective, examining the personal as well as the economic consequences of our growing dependence on computers. \r\n\r\nWith a characteristic blend of history and philosophy, poetry and science, Carr takes us on a journey from the work and early theory of Adam Smith and Alfred North Whitehead to the latest research into human attention, memory, and happiness, culminating in a moving meditation on how we can use technology to expand the human experience. \r\n\r\nxx","last_updated":"2018-09-11T12:16:06.268Z","parsed":{"xt":"urn:btih:09b39954899ba89d1b71c2fa572c60088daf1f36","dn":"The Glass Cage: Automation and Us by Nicholas Carr EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"09b39954899ba89d1b71c2fa572c60088daf1f36","infoHashBuffer":{"type":"Buffer","data":[9,179,153,84,137,155,168,157,27,113,194,250,87,44,96,8,141,175,31,54]},"name":"The Glass Cage: Automation and Us by Nicholas Carr EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}