{"title":"The Gospel As Revealed To Me, Maria Valtorta (Vol. 1-10) [EPUB]","magnet":"magnet:?xt=urn:btih:09deb4239497588aae511c7ea5113c71180b2a43&dn=The+Gospel+As+Revealed+To+Me%2C+Maria+Valtorta+%28Vol.+1-10%29+%5BEPUB%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"odikia","categoryP":"other","categoryS":"e_books","size":"6937914","seeders":"1","leechers":"19","description":"The major work by Maria Valtorta, published in ten volumes, is The Gospel as revealed to me.\r\n\r\nRemaining seated in bed, Maria Valtorta wrote in ordinary notebooks in her own hand, uninterruptedly, without preparing outlines or making corrections. She often alternated the drafting of the episodes in her major work with texts on other topics which would eventually constitute her so-called &#x201C;minor&#x201D; works, which have been published in five volumes, in addition to the Autobiography. These include the following titles.\r\n\r\n&#x2013; Three volumes of The Notebooks, dealing with varied themes, and corresponding to 1943, 1944, and 1945-1950, respectively. They contain ascetical, biblical, doctrinal, and autobiographical commentaries, in addition to descriptions of Gospel scenes and of the martyrdom of the early Christians.\r\n\r\n&#x2013; The Book of Azariah contains commentaries on Scripture passages (apart from the Gospel) used in the Catholic Mass.\r\n\r\n&#x2013; Lessons on the Epistle of St. Paul to the Romans.\r\n\r\nThe Gospel as revealed to me\r\n\r\nIt narrates the birth and childhood of the Virgin Mary and her Son Jesus; the three years of Jesus&#x2019; public life (forming the largest section); his passion, death, resurrection, and ascension; the beginnings of the Church; and the assumption of Mary. In lofty literary style, the work describes landscapes, environments, people, and events with the vividness of graphic depiction. It presents characters and situations with introspective insight and sets forth moments of joy or drama with the feeling of someone really taking part in them. It provides information on the characteristics of settings, customs, rites, and cultures with convincing detail. By way of a gripping account of the Redeemer&#x2019;s earthly life, especially through discourse and dialogue, the work sheds light upon the whole doctrine of Christianity in keeping with Catholic orthodoxy.\r\n\r\nThe greatly-revered Gabriele M. Allegra, who highly esteemed Valtorta&#x2019;s work, wrote, &#x201C;Gifts of nature and mystical gifts harmoniously joined together account for this masterpiece of Italian religious literature and&#x2014;perhaps I should say&#x2014;of Christian literature on a world level.&#x201D;\r\n\r\nThe Gospel as revealed to me, a worldwide success of spiritual literature, is now available in English. It is an inspired work or, as some say, a &#x201C;gospel&#x201D; which neither replaces nor changes the Gospel, but rather narrates it, integrating and illuminating it, for the purpose of reviving in men&#x2019;s hearts love for Christ and his Mother. The Gospel as revealed to me is a series consisting of ten volumes","last_updated":"2018-09-10T12:23:10.355Z","parsed":{"xt":"urn:btih:09deb4239497588aae511c7ea5113c71180b2a43","dn":"The Gospel As Revealed To Me, Maria Valtorta (Vol. 1-10) [EPUB]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"09deb4239497588aae511c7ea5113c71180b2a43","infoHashBuffer":{"type":"Buffer","data":[9,222,180,35,148,151,88,138,174,81,28,126,165,17,60,113,24,11,42,67]},"name":"The Gospel As Revealed To Me, Maria Valtorta (Vol. 1-10) [EPUB]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}