{"title":"Elroy Dimson - Triumph of the Optimists (on investment returns)","magnet":"magnet:?xt=urn:btih:0ad1f4506a4fdde494f81fa34ee0fcca222e02d6&dn=Elroy+Dimson+-+Triumph+of+the+Optimists+%28on+investment+returns%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"suprbayrequest","categoryP":"other","categoryS":"e_books","size":"2799543","seeders":"1","leechers":"0","description":"\r\nTriumph of the Optimists: 101 Years of Global Investment Returns\r\nBy Elroy Dimson, Paul Marsh, and Mike Staunton \r\n\r\n320 pages\r\nPublisher: Princeton University Press (February 22, 2013)-\r\n\r\nRetail PDF\r\n\r\n\r\nInvestors have too often extrapolated from recent experience. In the 1950s, who but the most rampant optimist would have dreamt that over the next fifty years the real return on equities would be 9% per year? Yet this is what happened in the U.S. stock market. The optimists triumphed. However, as Don Marquis observed, an optimist is someone who never had much experience. The authors of this book extend our experience across regions and across time. They present a comprehensive and consistent analysis of investment returns for equities, bonds, bills, currencies and inflation, spanning sixteen countries, from the end of the nineteenth century to the beginning of the twenty-first. This is achieved in a clear and simple way, with over 130 color diagrams that make comparison easy.\r\n\r\nCrucially, the authors analyze total returns, including reinvested income. They show that some historical indexes overstate long-term performance because they are contaminated by survivorship bias and that long-term stock returns are in most countries seriously overestimated, due to a focus on periods that with hindsight are known to have been successful.\r\n\r\nThe book also provides the first comprehensive evidence on the long-term equity risk premium--the reward for bearing the risk of common stocks. The authors reveal whether the United States and United Kingdom have had unusually high stock market returns compared to other countries. The book covers the U.S., the U.K., Japan, France, Germany, Canada, Italy, Spain, Switzerland, Australia, the Netherlands, Sweden, Belgium, Ireland, Denmark, and South Africa.\r\n\r\nTriumph of the Optimists is required reading for investment professionals, financial economists, and investors. It will be the definitive reference in the field and consulted for years to come.\r\n\r\n\r\n <a href=\"\nhttps://pirates-forum.org/Forum-Requests\" rel=\"nofollow\" target=\"_NEW\">\nhttps://pirates-forum.org/Forum-Requests</a>","last_updated":"2018-08-30T12:04:23.523Z","parsed":{"xt":"urn:btih:0ad1f4506a4fdde494f81fa34ee0fcca222e02d6","dn":"Elroy Dimson - Triumph of the Optimists (on investment returns)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0ad1f4506a4fdde494f81fa34ee0fcca222e02d6","infoHashBuffer":{"type":"Buffer","data":[10,209,244,80,106,79,221,228,148,248,31,163,78,224,252,202,34,46,2,214]},"name":"Elroy Dimson - Triumph of the Optimists (on investment returns)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}