{"title":"The Bonanza King by Gregory Crouch EPUB","magnet":"magnet:?xt=urn:btih:0be907eceb43f48fb2022521ac7d3f33ff36a06b&dn=The+Bonanza+King+by+Gregory+Crouch+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"82560702","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Bonanza King by Gregory Crouch EPUB\r\n\r\nThe rags-to-riches American frontier tale of an Irish immigrant who outwits, outworks, and outmaneuvers thousands of rivals to take control of Nevada&#x2019;s Comstock Lode - the rich body of gold and silver so immensely valuable that it changed the destiny of the United States.\r\n\r\nBorn in 1831, John W. Mackay was a penniless Irish immigrant who came of age in New York City, went to California during the Gold Rush, and mined without much luck for eight years. When he heard of riches found on the other side of the Sierra Nevada Mountains in 1859, Mackay abandoned his claim and walked a hundred miles to the Comstock Lode in Nevada.\r\n\r\nOver the course of the next dozen years, Mackay worked his way up from nothing, thwarting the pernicious &#x201C;Bank Ring&#x201D; monopoly to seize control of the most concentrated cache of precious metals ever found on earth, the legendary &#x201C;Big Bonanza&#x201D;, a stupendously rich body of gold and silver ore discovered 1,500 feet beneath the streets of Virginia City, the ultimate Old West boomtown. But for the ore to be worth anything it had to be found, claimed, and successfully extracted, each step requiring enormous risk and the creation of an entirely new industry.\r\n\r\nNow Gregory Crouch tells Mackay&#x2019;s amazing story - how he extracted the ore from deep underground and used his vast mining fortune to crush the transatlantic telegraph monopoly of the notorious Jay Gould. When Mackay died in 1902, front-page obituaries in Europe and the United States hailed him as one of the most admired Americans of the age. The Bonanza King is a dazzling tour de force, a riveting history of Virginia City, Nevada, the Comstock Lode, and America itself.\r\n\r\nxx","last_updated":"2018-10-17T12:00:13.228Z","parsed":{"xt":"urn:btih:0be907eceb43f48fb2022521ac7d3f33ff36a06b","dn":"The Bonanza King by Gregory Crouch EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0be907eceb43f48fb2022521ac7d3f33ff36a06b","infoHashBuffer":{"type":"Buffer","data":[11,233,7,236,235,67,244,143,178,2,37,33,172,125,63,51,255,54,160,107]},"name":"The Bonanza King by Gregory Crouch EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}