{"title":"Our First Revolution by Michael Barone EPUB","magnet":"magnet:?xt=urn:btih:0dc08a26f7bd3fbf7c1e8b7bc1bdd6c107858589&dn=Our+First+Revolution+by+Michael+Barone+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"875306","seeders":"0","leechers":"0","description":"xx\r\n\r\nOur First Revolution by Michael Barone EPUB\r\n\r\nThe ideals of freedom and individual rights that inspired America&apos;s Founding Fathers did not spring from a vacuum. Along with many other defining principles of our national character, they can be traced directly back to one of the most pivotal events in British history: the late-17th-century uprising known as the Glorious Revolution.\r\n\r\nIn a work of popular history that stands with recent favorites such as David McCullough&apos;s 1776 and Joseph J. Ellis&apos; Founding Brothers, Michael Barone brings the story of this unlikely and largely bloodless revolt to American readers and reveals that, without the Glorious Revolution, the American Revolution may never have happened.\r\n\r\nUnfolding in 1688-89, Britain&apos;s Glorious Revolution resulted in the hallmarks of representative government, guaranteed liberties, the foundations of global capitalism, and a foreign policy of opposing aggressive foreign powers. But as Barone shows, there was nothing inevitable about the Glorious Revolution. It sprang from the character of the English people and depended on the talents, audacity, and good luck of two men: William of Orange (later William III of England), who launched history&apos;s last successful cross-channel invasion, and John Churchill, an ancestor of Winston, who commanded the forces of the deposed James II but crossed over to support William one fateful November night.\r\n\r\nThe story of the Glorious Revolution is a rich and riveting saga of palace intrigue, loyalty, and shocking betrayal, and bold political and military strategizing. With narrative drive, a sure command of historical events, and unforgettable portraits of kings, queens, soldiers, parliamentarians, and a large cast of full-blooded characters, Barone takes an episode that has fallen into unjustified obscurity and restores it to the prominence it deserves.\r\n\r\nxx","last_updated":"2018-05-17T12:00:53.304Z","parsed":{"xt":"urn:btih:0dc08a26f7bd3fbf7c1e8b7bc1bdd6c107858589","dn":"Our First Revolution by Michael Barone EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0dc08a26f7bd3fbf7c1e8b7bc1bdd6c107858589","infoHashBuffer":{"type":"Buffer","data":[13,192,138,38,247,189,63,191,124,30,139,123,193,189,214,193,7,133,133,137]},"name":"Our First Revolution by Michael Barone EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}