{"title":"Franklin and Winston by Jon Meacham EPUB","magnet":"magnet:?xt=urn:btih:0dc94de8012767de3d7d04a5b40ecfe448dfbbcd&dn=Franklin+and+Winston+by+Jon+Meacham+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1497610","seeders":"63","leechers":"1","description":"xx\r\n\r\nFranklin and Winston: An Intimate Portrait of an Epic Friendship by Jon Meacham EPUB\r\n\r\nFranklin Roosevelt and Winston Churchill were the greatest leaders of &quot;the Greatest Generation&quot;. In Franklin and Winston, Jon Meacham explores the fascinating relationship between the two men who piloted the free world to victory in World War II. It was a crucial friendship and a unique one: a president and a prime minister spending enormous amounts of time together and exchanging nearly 2,000 messages. Amid cocktails, cigarettes, and cigars, they met, often secretly, in places as far-flung as Washington, Hyde Park, Casablanca, and Teheran, talking to each other of war, politics, the burden of command, their health, their wives, and their children.\r\n\r\nBorn in the 19th century and molders of the 20th and 21st, Roosevelt and Churchill had much in common. Sons of the elite, students of history, politicians of the first rank, they savored power. In their own time both men were underestimated, dismissed as arrogant, and faced skeptics and haters in their own nations, yet both magnificently rose to the central challenges of the 20th century.\r\n\r\nMeacham&apos;s new sources, including unpublished letters of FDR&apos;s great secret love, Lucy Mercer Rutherfurd; the papers of Pamela Churchill Harriman; and interviews with the few surviving people who were in FDR and Churchill&apos;s joint company, shed fresh light on the characters of both men as he engagingly chronicles the hours in which they decided the course of the struggle. Charting the personal drama behind the discussions of strategy and statecraft, Meacham has written the definitive account of the most remarkable friendship of the modern age.\r\n\r\nxx","last_updated":"2018-09-22T12:35:02.082Z","parsed":{"xt":"urn:btih:0dc94de8012767de3d7d04a5b40ecfe448dfbbcd","dn":"Franklin and Winston by Jon Meacham EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0dc94de8012767de3d7d04a5b40ecfe448dfbbcd","infoHashBuffer":{"type":"Buffer","data":[13,201,77,232,1,39,103,222,61,125,4,165,180,14,207,228,72,223,187,205]},"name":"Franklin and Winston by Jon Meacham EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}