{"title":"[indie-rock, post-rock] (2018) Collections of Colonies of Bees -","magnet":"magnet:?xt=urn:btih:0e1089c5689dac95b32a6263bb3340ec07184eab&dn=%5Bindie-rock%2C+post-rock%5D+%282018%29+Collections+of+Colonies+of+Bees+-&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"100.XY","categoryP":"audio","categoryS":"flac","size":"216916206","seeders":"4","leechers":"7","description":"(2018) Collections of Colonies of Bees - HAWAII\r\n\r\nReview: \r\nHAWAII marks &#x2018; return to Polyvinyl, 14 years after the under-appreciated Customer, but it might as well be in name only, as nearly everything about the group has changed since then. The unit originally began as a more abstract side venture for guitarist Chris Rosenau and percussionist Jon Mueller, then of post-rock group Pele, back in the late &#x2019;90s, and they explored a captivating middle ground between glitchy electronics, rambling acoustic folk, and jazz improvisation. Through the gradual addition (and replacement) of other musicians, they became more of a rock band, with a greater emphasis on melody and post-minimalist rhythms. Flash forward to 2018, and Rosenau has remained the group&#x2019;s only constant member, with guitarist Daniel Spack the only other member present on the group&#x2019;s previous album, 2014&#x2019;s Japan-only release Set. HAWAII is a major shift for the group, as it&#x2019;s their first effort to include lyrics, which are mostly sung by new recruit Marielle Allschwang, sometimes as a duet with Spack. The lyrics are poetic, impressionist, and generally quite optimistic and encouraging, but not delivered in a richly expressive tone. While these aren&#x2019;t pop tunes, the vocals do help frame the songs, making them accessible while still maintaining a steady flow, and the average track time is down a few minutes compared to the group&#x2019;s previous few records. The group haven&#x2019;t abandoned the glitchy effects of their earlier recordings, and here they help add a bit of an otherworldly touch to the vocals and guitars. The song&#x2019;s rhythms are somewhere between a gentle pulse and a strong drive, and there&#x2019;s plenty of space left for breathing room. \r\nOverall, HAWAII feels like the next step for Collections rather than their magnum opus, but their integration of vocals feels natural, and doesn&#x2019;t sacrifice the free spirit of their music. \r\n\r\nTracklist: \r\n01 - Killerers.flac \r\n02 - Giiibs.flac \r\n03 - HAWAII.flac \r\n04 - For Ghost.flac \r\n05 - Harms.flac \r\n06 - Ruins.flac \r\n07 - Murderers.flac \r\n\r\nSummary: \r\nCountry: USA \r\nGenre: indie-rock, post-rock","last_updated":"2018-07-19T12:05:01.515Z","parsed":{"xt":"urn:btih:0e1089c5689dac95b32a6263bb3340ec07184eab","dn":"[indie-rock, post-rock] (2018) Collections of Colonies of Bees -","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0e1089c5689dac95b32a6263bb3340ec07184eab","infoHashBuffer":{"type":"Buffer","data":[14,16,137,197,104,157,172,149,179,42,98,99,187,51,64,236,7,24,78,171]},"name":"[indie-rock, post-rock] (2018) Collections of Colonies of Bees -","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}