{"title":"Feel Free: Essays by Zadie Smith EPUB","magnet":"magnet:?xt=urn:btih:0e722391b4a42b3ea3d6f0fc58882e59daa4ee14&dn=Feel+Free%3A+Essays+by+Zadie+Smith+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"10129811","seeders":"0","leechers":"0","description":"xx\r\n\r\nFeel Free: Essays by Zadie Smith EPUB\r\n\r\nFrom Zadie Smith, one of the most beloved authors of her generation, a new collection of essays\r\n\r\nSince she burst spectacularly into view with her debut novel almost two decades ago, Zadie Smith has established herself not just as one of the world&apos;s preeminent fiction writers but also a brilliant and singular essayist. She contributes regularly to The New Yorker and the New York Review of Books on a range of subjects, and each piece of hers is a literary event in its own right.\r\n\r\nArranged into four sections - In the World, In the Audience, On the Bookshelf, and Feel Free - this new collection poses questions we immediately recognize. What is The Social Network - anditself - really about? &quot;It&apos;s a cruel portrait of us: 500 million sentient people entrapped in the recent careless thoughts of a Harvard sophomore.&quot; Why do we love libraries? &quot;Well-run libraries are filled with people because what a good library offers cannot be easily found elsewhere: an indoor public space in which you do not have to buy anything in order to stay.&quot; What will we tell our granddaughters about our collective failure to address global warming? &quot;So I might say to her, look: the thing you have to appreciate is that we&apos;d just been through a century of relativism and deconstruction, in which we were informed that most of our fondest-held principles were either uncertain or simple wishful thinking, and in many areas of our lives we had already been asked to accept that nothing is essential and everything changes - and this had taken the fight out of us somewhat.&quot;\r\n\r\nGathering in one place for the first time previously unpublished work, as well as already classic essays, such as, &quot;Joy,&quot; and, &quot;Find Your Beach,&quot; Feel Free offers a survey of important recent events in culture and politics as well as Smith&apos;s own life. Equally at home in the world of good books and bad politics, Brooklyn-born rappers and the work of Swiss novelists, she is by turns wry, heartfelt, indignant, and incisive - and never any less than perfect company. This is literary journalism at its zenith.\r\n\r\nxx","last_updated":"2018-02-08T12:00:33.034Z","parsed":{"xt":"urn:btih:0e722391b4a42b3ea3d6f0fc58882e59daa4ee14","dn":"Feel Free: Essays by Zadie Smith EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0e722391b4a42b3ea3d6f0fc58882e59daa4ee14","infoHashBuffer":{"type":"Buffer","data":[14,114,35,145,180,164,43,62,163,214,240,252,88,136,46,89,218,164,238,20]},"name":"Feel Free: Essays by Zadie Smith EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}