{"title":"John Berryman - Collected Poems and other works (14 books)","magnet":"magnet:?xt=urn:btih:0ee6402676f623f5f80fde801f3d0830c0b27a36&dn=John+Berryman+-+Collected+Poems+and+other+works+%2814+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"17008498","seeders":"31","leechers":"9","description":"\nJOHN BERRYMAN (1914-1972) was a major American poet and scholar.  His father&apos;s suicide when Berryman was 11 years old haunted him for the rest of his life and he wrote about his struggle to come to terms with it in much of his poetry.  His work, which often revolved around the details of his turbulent personal life, is closely associated with the &quot;Confessional&quot; poetry movement and in this sense has much in common with the poetry of his friend, Robert Lowell.\n\nHis first major work, in which he began to develop his own unique style of writing, was &quot;Homage to Mistriss Bradstreet&quot; (1956), a monologue that pays tribute to the 17th century poet Anne Bradstreet.  It was Berryman&apos;s first poem to receive national attention and a positive response from critics.  His great poetic breakthrough occurred after he published 77 DREAM SONGS (1964), which won the 1965 Pulitzer Prize and solidified his standing as one of the most important poets of the post-World War II generation.  Berryman continued to work on the &quot;dream song&quot; poems at a feverish pace and published a second, significantly longer, volume entitled HIS TOY, HIS DREAM, HIS REST (1968), which won the National Book Award for Poetry and the Bollingen Prize.  A richly erotic autobiographical sequence about a love affair, BERRYMAN&#x2019;S SONNETS, appeared in 1967.    \n\nBerryman&apos;s last two volumes of poetry, LOVE &amp; FAME (1970) and DELUSIONS, ETC. (1972), featured free-verse poems that were much more straightforward and less idiosyncratic than The Dream Songs.  Both were more openly &quot;confessional&quot; than Berryman&apos;s earlier verse and focus on his religious concerns and spiritual rebirth.  RECOVERY (1973) is an account of his struggle against alcoholism.  THE FREEDOM OF THE POET (1976) is a collection of Berryman&apos;s published and unpublished prose pieces, selected by the poet shortly before his death.\n\nHis COLLECTED POEMS, 1937-1971, edited by Charles Thornbury, appeared in 1989.  The collection features a thorough nine-part introduction and a chronology as well as helpful appendixes that include Berryman&apos;s published prefaces, notes and dedications; a section of editor&apos;s notes, guidelines and procedures; and an account of the poems in their final stages of composition and publication.\n\n\nThe following books are in ePUB format unless otherwise indicated:\n\n* 77 Dream Songs (FSG, 2014)\n* Berryman&apos;s Shakespeare (FSG, 2012).  John Haffenden, ed.\n* Berryman&apos;s Sonnets (FSG, 2014)\n* Collected Poems, 1937-1971 (FSG, 2014).  Charles Thornbury, ed.\n* Delusions, Etc. (FSG, 2014)\n* Dream Songs, The (FSG, 1986) -- PDF (by @pharmakate)\n* Dream Songs, The (FSG, 2014).  Michael Hofmann, intro.\n* Freedom of the Poet (FSG, 2012)\n* Heart Is Strange, The (FSG, 2014).  Daniel Swift, ed.\n* His Toy, His Dream, His Rest (FSG, 2014)\n* Homage to Mistress Bradstreet &amp; Other Poems (FSG, 2014)\n* Love &amp; Fame (FSG, 1970) -- PDF\n* Recovery (FSG, 2012)\n* Stephen Crane: A Biography (Meridian, 1962) -- PDF\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-09-11T12:15:58.062Z","parsed":{"xt":"urn:btih:0ee6402676f623f5f80fde801f3d0830c0b27a36","dn":"John Berryman - Collected Poems and other works (14 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0ee6402676f623f5f80fde801f3d0830c0b27a36","infoHashBuffer":{"type":"Buffer","data":[14,230,64,38,118,246,35,245,248,15,222,128,31,61,8,48,192,178,122,54]},"name":"John Berryman - Collected Poems and other works (14 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}