{"title":"Hidden History by Donald Jeffries AZW","magnet":"magnet:?xt=urn:btih:0f3b1bd719dec4952203f31f7dcae8d2f3f6613b&dn=Hidden+History+by+Donald+Jeffries+AZW&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1255571","seeders":"0","leechers":"0","description":"xx\r\n\r\nHidden History by Donald Jeffries AZW\r\n\r\nLearn about all the secrets our government has kept for the past fifty years.\r\n\r\nThe US government has spent half the time covering up conspiracies as it has spent helping the American people. In Hidden History, you will see the amount of effort over the past fifty years that our government has dedicated to lying and covering up the truth to the world.\r\n\r\nStarting with the assassination of President John F. Kennedy, Don Jeffries chronicles a wide variety of issues that have plagued our country&apos;s history. Whether it&apos;s the assassinations of MLK and RFK, Iran-Contra, the Oklahoma City bombing, TWA Flight 800, voting fraud, or 9/11, every major disaster or war that we&apos;ve witnessed has somehow been distorted by those who are supposed to be protecting us.\r\n\r\nJeffries also delves into extensive research on the death of John F. Kennedy Jr., and you&apos;ll be shocked by what he finds out.\r\n\r\nSo whether you&apos;ve only heard bits and pieces of these stories or have read several books on the topics, Hidden History is the book that belongs in every conspiracy theorist&apos;s library, as the information included in this encyclopedia has never been collected together in any other published work available. So sit down, strap in, and get ready to be shocked and awed by how much has been hidden from you by our government over the past fifty years.\r\n\r\nSkyhorse Publishing, as well as our Arcade imprint, are proud to publish a broad range of books for readers interested in history - books about World War II, the Third Reich, Hitler and his henchmen, the JFK assassination, conspiracies, the American Civil War, the American Revolution, gladiators, Vikings, ancient Rome, medieval times, the old West, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.\r\n\r\nxx","last_updated":"2018-03-19T12:00:36.862Z","parsed":{"xt":"urn:btih:0f3b1bd719dec4952203f31f7dcae8d2f3f6613b","dn":"Hidden History by Donald Jeffries AZW","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0f3b1bd719dec4952203f31f7dcae8d2f3f6613b","infoHashBuffer":{"type":"Buffer","data":[15,59,27,215,25,222,196,149,34,3,243,31,125,202,232,210,243,246,97,59]},"name":"Hidden History by Donald Jeffries AZW","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}