{"title":"East West Street.On the Origins of Genocide","magnet":"magnet:?xt=urn:btih:0f963fc2b83d82f5cded22247deb4f4a58693faa&dn=East+West+Street.On+the+Origins+of+Genocide&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Xiadxico","categoryP":"other","categoryS":"e_books","size":"12227577","seeders":"1","leechers":"0","description":"A monumental achievement: profoundly personal, told with love, anger and great precision&apos; - John le Carr&#xE9;\r\n\r\n&apos;A triumph of astonishing research ... No novel could possibly match such an important work of truth&apos; - Antony Beevor\r\n\r\n\r\nWhen human rights lawyer Philippe Sands received an invitation to deliver a lecture in the western Ukrainian city of Lviv, he began to uncover a series of extraordinary historical coincidences. It set him on a quest that would take him halfway around the world in an exploration of the origins of international law and the pursuit of his own secret family history, beginning and ending with the last day of the Nuremberg trial.\r\n\r\nPart historical detective story, part family history, part legal thriller, Philippe Sands guides us between past and present as several interconnected stories unfold in parallel. The first is the hidden story of two Nuremberg prosecutors who discover, only at the end of the trial, that the man they are prosecuting may be responsible for the murder of their entire families in Nazi-occupied Poland, in and around Lviv. The two prosecutors, Hersch Lauterpacht and Rafael Lemkin, were remarkable men, whose efforts led to the inclusion of the terms &apos;crimes against humanity&apos; and &apos;genocide&apos; in the judgement at Nuremberg. The defendant, Hans Frank, Hitler&apos;s personal lawyer and Governor-General of Nazi-occupied Poland, turns out to be an equally compelling character.\r\n\r\nThe lives of these three men lead Sands to a more personal story, as he traces the events that overwhelmed his mother&apos;s family in Lviv and Vienna during the Second World War. At the heart of this book is an equally personal quest to understand the roots of international law and the concepts that have dominated Sands&apos; work as a lawyer. Eventually, he finds unexpected answers to his questions about his family, in this powerful meditation on the way memory, crime and guilt leave scars across generations, and the haunting gaps left by the secrets of others","last_updated":"2018-03-20T12:01:42.723Z","parsed":{"xt":"urn:btih:0f963fc2b83d82f5cded22247deb4f4a58693faa","dn":"East West Street.On the Origins of Genocide","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0f963fc2b83d82f5cded22247deb4f4a58693faa","infoHashBuffer":{"type":"Buffer","data":[15,150,63,194,184,61,130,245,205,237,34,36,125,235,79,74,88,105,63,170]},"name":"East West Street.On the Origins of Genocide","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}