{"title":"Christopher Bollyn - Solving 9-11: The Deception That Changed th","magnet":"magnet:?xt=urn:btih:10ac6659106d8fe6b7ea8fcb1502a502dd86549a&dn=Christopher+Bollyn+-+Solving+9-11%3A+The+Deception+That+Changed+th&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"roflcopter2110","categoryP":"audio","categoryS":"audio_books","size":"534540631","seeders":"18","leechers":"8","description":"Christopher Bollyn - Solving 9-11 - The Deception That Changed the World (2012) MP3 Audiobook.mp3 - 4h 38min 24s 256 kb/s\r\n <a href=\"\nhttps://extraimage.net/images/2018/11/15/a9b166308d245d2556355d18eda7d95f.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://extraimage.net/images/2018/11/15/a9b166308d245d2556355d18eda7d95f.jpg</a> <a href=\"\nhttps://extraimage.net/images/2018/11/15/41ab92147d15e3a707e8003ef461a140.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://extraimage.net/images/2018/11/15/41ab92147d15e3a707e8003ef461a140.jpg</a>\r\n\r\nThis is a MUST LISTEN and MUST SHARE audiobook, (I also uploaded the PDF at the beginning of the year, you can download that as well and read along as you listen) please share it with everyone you know and tell them to do the same, listen to the audiobook with your friends and loved ones. Also download all of Christopher Bollyn&apos;s EXCELLENT lectures, just search his name you will find plenty of content to keep you busy and EDUCATE YOURSELF with KNOWLEDGE that has been SUPPRESSED/HIDDEN! We are ENSLAVED through LACK OF KNOWLEDGE, EMPOWER YOURSELF AND YOUR FAMILY AND OTHERS WITH KNOWLEDGE, TAKE THE RED PILL AND WAKE UP OUT OF YOUR SLUMBER!\r\n\r\nThis book proves beyond the shadow of a doubt that ISRAEL DID 9/11! NOT MUSLIMS/ARABS but Israelis&apos;/Jews! Research &quot;The 5 Dancing Israelis&apos; on 9/11&quot; they were seen dancing, celebrating the towers being hit and were even seen flicking lighters with the burning towers in the background, smiling, not shocked THEY SAID ON ISRAELI TV THAT THEY WERE SENT TO DOCUMENT THE EVENT, THEY HAD PRIOR KNOWLEDGE! ISRAEL IS NOT AMERICA&apos;S FRIEND/ALLY WAKE UP AMERICA ALSO RESEARCH THE USS LIBERTY WHERE ISRAEL KNOWINGLY KILLED 34 AMERICANS AND WOUNDED 171 OTHERS THE BIGGEST COVER-UP IN WORLD HISTORY! THE TRUTH MUST GO VIRAL THE SLEEPING MASSES MUST AWAKEN, WE NEED A GOYIM REVOLUTION NOW!\r\n\r\nAn independent analysis of the events of September 11, 2001. Includes historical and geo-political background and examines the motivation of the people who played key roles in the destruction of the evidence and the obstruction of justice for the families of the victims.\r\n\r\nMake signs that say ISRAEL DID 9/11 and EXPEL THE JEWS and hit the streets with the message, NAME THE JEW!\r\n\r\nEXPEL THE JEWS! Vote Patrick Little 2020, he will expel the Jews by 2022, his campaign slogan is: Liberate the US from the Jewish Oligarchy! He will serve America NOT Israel, NO MORE WARS FOR ISRAEL under Patrick Little! SPREAD THE WORD, TELL EVERYONE YOU KNOW AND TELL THEM TO DO THE SAME!\r\n\r\nWake up Goyim, Israel OWNS America, Rise up and FIGHT White Race! White Genocide is REAL and IN EFFECT! Research the Kalergi Plan, demand an end to all illegal immigration.\r\n\r\nMAKE THE TRUTH GO VIRAL, the sleeping masses MUST AWAKEN! Wake up Goyim, turn off your teLIEvision, turn off that TALMUDvision!\r\n\r\nCall your congress and DEMAND that the United States IMMEDIATELY STOP FUNDING ISRAEL!\r\n\r\nIsrael is a terrorist state, Free Palestine! The Goyim Defense League supports Palestinian rights!\r\n\r\nPlease support the Goyim Defense League, the GDL. Support Handsome Truth 13 and Adam Green from Know More News! Subscribe to both of them on YouTube, they are exposing Jewish crimes against humanity and exposing who REALLY did 9/11!\r\n\r\nGeneral           : Christopher Bollyn - Solving 9-11 - The Deception That Changed the World (2012) MP3 Audiobook.mp3\r\nFormat            : MPEG Audio at 256 kb/s\r\nLength            : 510 MiB for 4 h 38 min 24 s 261 ms\r\n\r\nAudio #0          : MPEG Audio at 256 kb/s\r\nInfos             : 2 channels, 44.1 kHz","last_updated":"2018-11-15T13:12:57.368Z","parsed":{"xt":"urn:btih:10ac6659106d8fe6b7ea8fcb1502a502dd86549a","dn":"Christopher Bollyn - Solving 9-11: The Deception That Changed th","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"10ac6659106d8fe6b7ea8fcb1502a502dd86549a","infoHashBuffer":{"type":"Buffer","data":[16,172,102,89,16,109,143,230,183,234,143,203,21,2,165,2,221,134,84,154]},"name":"Christopher Bollyn - Solving 9-11: The Deception That Changed th","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}