{"title":"The Great Alone by Kristin Hannah EPUB","magnet":"magnet:?xt=urn:btih:12c2020c851acb09adff703a20db4094475363a4&dn=The+Great+Alone+by+Kristin+Hannah+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"637265","seeders":"20","leechers":"6","description":"xx\r\n\r\nThe Great Alone by Kristin Hannah EPUB\r\n\r\nAlaska, 1974.\r\n\r\nUnpredictable. Unforgiving. Untamed.\r\n\r\nFor a family in crisis, the ultimate test of survival. \r\n\r\nErnt Allbright, a former POW, comes home from the Vietnam war a changed and volatile man. When he loses yet another job, he makes an impulsive decision: He will move his family north, to Alaska, where they will live off the grid in America&apos;s last true frontier. \r\n\r\nThirteen-year-old Leni, a girl coming of age in a tumultuous time, caught in the riptide of her parents&apos; passionate, stormy relationship, dares to hope that a new land will lead to a better future for her family. She is desperate for a place to belong. Her mother, Cora, will do anything and go anywhere for the man she loves, even if means following him into the unknown. \r\n\r\nAt first, Alaska seems to be the answer to their prayers. In a wild, remote corner of the state, they find a fiercely independent community of strong men and even stronger women. The long, sunlit days and the generosity of the locals make up for the Allbrights&apos; lack of preparation and dwindling resources. \r\n\r\nBut as winter approaches and darkness descends on Alaska, Ernt&apos;s fragile mental state deteriorates and the family begins to fracture. Soon the perils outside pale in comparison to threats from within. In their small cabin, covered in snow, blanketed in 18 hours of night, Leni and her mother learn the terrible truth: They are on their own. In the wild, there is no one to save them but themselves. \r\n\r\nIn this unforgettable portrait of human frailty and resilience, Kristin Hannah reveals the indomitable character of the modern American pioneer and the spirit of a vanishing Alaska - a place of incomparable beauty and danger. The Great Alone is a daring, beautiful, stay-up-all-night book about love and loss, the fight for survival, and the wildness that lives in both man and nature. \r\n\r\nxx","last_updated":"2018-02-07T12:05:01.442Z","parsed":{"xt":"urn:btih:12c2020c851acb09adff703a20db4094475363a4","dn":"The Great Alone by Kristin Hannah EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"12c2020c851acb09adff703a20db4094475363a4","infoHashBuffer":{"type":"Buffer","data":[18,194,2,12,133,26,203,9,173,255,112,58,32,219,64,148,71,83,99,164]},"name":"The Great Alone by Kristin Hannah EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}