{"title":"Secret Channel to Berlin: The Masson-Schellenberg Connection","magnet":"magnet:?xt=urn:btih:13bf17fb57d8e304c1e149cb29bb91e409e7f69a&dn=Secret+Channel+to+Berlin%3A+The+Masson-Schellenberg+Connection&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"10700463","seeders":"2","leechers":"8","description":"Secret Channel to Berlin: The Masson-Schellenberg Connection and Swiss Intelligence in World War II - Pierre Braunschweig [epub]\r\n\r\nThis book focuses on the delicate connection between the head of Swiss Intelligence, Colonel Roger Masson, and the German Chief of Espionage, SS General Walter Schellenberg. The author had access to hitherto inaccessible documents, including newly discovered material in American archives, to fully illuminate this secret connection for the first time. The book also includes surprising new details about the alarming military threats Switzerland faced in March 1943. Masson&apos;s extraordinary secret channel to Berlin was not, of course, the only Swiss intelligence operation during the war.\r\n\r\nBraunschweig outlines in detail the gradual buildup, tasks and functions of Swiss Intelligence during World War II. He furthermore describes conflicts between Swiss Intelligence and the Federal government in Bern and within the Intelligence service itself. During World War II, Switzerland was famous as a center of spies and espionage fielded by Allies and Axis alike. Less has been known, however, about Switzerland&apos;s own Intelligence activities, including its secret sources in Hitler&apos;s councils and its counterespionage program at home. With this intensely researched, scholarly, yet exciting book, that gap in the history of wartime Intelligence operations has been filled.\r\n\r\nPierre Braunschweig earned a Ph.D. in history from the University of Bern and later served as an assistant to Hans Senn, the Chief of Staff of the Swiss Army. He is a member of the United States Strategic Institute in Washinton DC, the International Institute for Strategic Studies in London, and the National Intelligence Study Center in Washington.\r\n\r\nHardcover: 528 pages\r\nPublisher: Casemate (September 19, 2004)","last_updated":"2018-09-24T12:24:44.977Z","parsed":{"xt":"urn:btih:13bf17fb57d8e304c1e149cb29bb91e409e7f69a","dn":"Secret Channel to Berlin: The Masson-Schellenberg Connection","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"13bf17fb57d8e304c1e149cb29bb91e409e7f69a","infoHashBuffer":{"type":"Buffer","data":[19,191,23,251,87,216,227,4,193,225,73,203,41,187,145,228,9,231,246,154]},"name":"Secret Channel to Berlin: The Masson-Schellenberg Connection","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}