{"title":"Stop Saying You're Fine by Mel Robbins MOBI","magnet":"magnet:?xt=urn:btih:13ee68344e9b2809b0333335a45e802bbe366a15&dn=Stop+Saying+You%27re+Fine+by+Mel+Robbins+MOBI&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"614665","seeders":"1","leechers":"0","description":"xx\r\n\r\nStop Saying You&apos;re Fine by Mel Robbins MOBI\r\n\r\nRight now, over 100 million Americans secretly feel frustrated and bored with their lives. If you&apos;ve come to regard yourself as your own worst enemy; if you constantly daydream and wonder, &quot;Is this all there is?&quot;; if you have a tendency, when asked how you&apos;re doing, to just say &quot;Fine,&quot; you may be one of them. If this sounds familiar, there&apos;s clearly something missing from your life. This book will help you discover what it is, and how to win it back.\r\n\r\nWritten by Mel Robbins, one of America&apos;s top relationship experts, this hands-on guide not only shows you how to put your finger on the problem, it reveals what to do about it. Mel Robbins has spent her career teaching people how to push past their self-imposed limits to get what they truly desire. She has an in-depth understanding of the psychological and social factors that repeatedly hold you back, and more importantly, a unique set of tools for getting you where you want to be. In Stop Saying You&apos;re Fine, she draws on the latest neuroscientific research, interviews with countless everyday people, and ideas she&apos;s tested in her own life to show what works and what doesn&apos;t. The key, she explains, is understanding how your own brain works against you. Because evolution has biased your mental gears against taking action, what you need are techniques to outsmart yourself. That may sound impossible, but Mel has created a remarkably effective method to help you do just that---and some of her discoveries will astonish you. By ignoring how you feel and seizing small amounts of rich possibility---a process she calls &quot;leaning in&quot;---you can make tiny course corrections add up to huge change. Among this book&apos;s other topics: how everything can depend on not hitting the snooze button; the science of connecting with other people; what children can teach us about getting things done; and why five seconds is the maximum time you should wait before acting on a great idea.\r\n\r\nxx","last_updated":"2018-01-27T12:03:36.982Z","parsed":{"xt":"urn:btih:13ee68344e9b2809b0333335a45e802bbe366a15","dn":"Stop Saying You're Fine by Mel Robbins MOBI","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"13ee68344e9b2809b0333335a45e802bbe366a15","infoHashBuffer":{"type":"Buffer","data":[19,238,104,52,78,155,40,9,176,51,51,53,164,94,128,43,190,54,106,21]},"name":"Stop Saying You're Fine by Mel Robbins MOBI","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}