{"title":"Santa Cruz Noir by Susie Bright EPUB","magnet":"magnet:?xt=urn:btih:147d4c37eae22f5710ef1661ef7729650268f013&dn=Santa+Cruz+Noir+by+Susie+Bright+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4733832","seeders":"37","leechers":"8","description":"xx\r\n\r\nSanta Cruz Noir by Susie Bright EPUB\r\n\r\nAkashic Books continues its award-winning series of original noir anthologies, launched in 2004 with Brooklyn Noir. Each book comprises all new stories, each one set in a distinct neighborhood or location within the respective city. Following in the footsteps of Los Angeles Noir, San Francisco Noir, San Diego Noir, Orange County Noir, and Oakland Noir, this new volume further reveals the seedy underbelly of the Left Coast. \r\n\r\nBrand-new stories by: Tommy Moore, Jessica Breheny, Naomi Hirahara, Calvin McMillin, Liza Monroy, Elizabeth McKenzie, Jill Wolfson, Ariel Gore, Jon Bailiff, Maceo Montoya, Micah Perks, Seana Graham, Vinnie Hansen, Peggy Townsend, Margaret Elysia Garcia, Lou Mathews, Lee Quarnstrom, Dillon Kaiser, Beth Lisick, and Wallace Baine. \r\n\r\nFrom the introduction by Susie Bright: \r\n\r\nEvery town has its noir-ville. It&apos;s easy to find in Santa Cruz. We live in what&#x2019;s called &quot;paradise&quot;, where you can wake up in a pool of blood with the first pink rays of the sunrise peeking out over our mountain range. The dewy mist lifts from the bay. Don&apos;t hate us because we&apos;re beautiful - we were made that way, like Venus rising off the foam with a brick in her hand. We can&apos;t help it if you fall for it every time.... \r\n\r\n&quot;If I lived in a place like this,&quot; visitors often say, &quot;I&apos;d wake up with a smile every day.&quot; \r\n\r\nOh, we do, thank you for that. There&apos;s no beauty like a merciless beauty - and like every crepuscular predator, she thrives at dawn and dusk. You&apos;re just the innocent we&apos;ve been waiting for, with your big paper cone of sugar-shark cotton, whipped out of pure nothing. We have just the ride for you, the longest tunnel ever. Santa Cruz is everything you ever dreamed, and everything you ever screamed, in one long drop you&apos;ll never forget.\r\n\r\nxx","last_updated":"2018-07-01T12:12:42.910Z","parsed":{"xt":"urn:btih:147d4c37eae22f5710ef1661ef7729650268f013","dn":"Santa Cruz Noir by Susie Bright EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"147d4c37eae22f5710ef1661ef7729650268f013","infoHashBuffer":{"type":"Buffer","data":[20,125,76,55,234,226,47,87,16,239,22,97,239,119,41,101,2,104,240,19]},"name":"Santa Cruz Noir by Susie Bright EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}