{"title":"Hitler's Preemptive War by Henrik Lunde EPUB","magnet":"magnet:?xt=urn:btih:14b1404e82f072a103df1003e1f518dfa797f997&dn=Hitler%27s+Preemptive+War+by+Henrik+Lunde+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2486042","seeders":"0","leechers":"0","description":"xx\r\n\r\nHitler&apos;s Preemptive War by Henrik Lunde EPUB\r\n\r\nThis book describes the often overlooked World War II campaign for Norway - a complex series of battles in which Hitler out-gambled Churchill in order to secure a vital resource lifeline for the Third Reich.\r\n\r\nAfter Hitler conquered Poland and was still fine-tuning his plans against France, the British began to exert control of the coastline of neutral Norway, an action that threatened to cut off Germany&#x2019;s iron-ore conduit to Sweden and outflank from the start its hegemony on the Continent. The Germans responded with a dizzying series of assaults, using every tool of modern warfare developed in the previous generation. Airlifted infantry, mountain troops and paratroopers were dispatched to the north, seizing Norwegian strongpoints while forestalling larger but more cumbersome Allied units.\r\n\r\nThe German navy also set sail, taking a brutal beating at the hands of Britannia, while ensuring with its sacrifice that key harbors could be held open for resupply. As dive-bombers soared overhead, small but elite German units traversed forbidding terrain to ambush Allied units trying to forge inland. At Narvik, some 6,000 German troops battled 20,000 French and British, until the Allies were finally forced to withdraw by the great disaster in France, which had then gotten underway.\r\n\r\nHenrik Lunde, a native Norwegian and former U.S. Special Operations colonel, has written the most objective account to date of a campaign in which 20th-century military innovation found its first fertile playing field.\r\n\r\nxx","last_updated":"2018-03-18T12:00:37.330Z","parsed":{"xt":"urn:btih:14b1404e82f072a103df1003e1f518dfa797f997","dn":"Hitler's Preemptive War by Henrik Lunde EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"14b1404e82f072a103df1003e1f518dfa797f997","infoHashBuffer":{"type":"Buffer","data":[20,177,64,78,130,240,114,161,3,223,16,3,225,245,24,223,167,151,249,151]},"name":"Hitler's Preemptive War by Henrik Lunde EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}