{"title":"The Intention Economy by Doc Searls MOBI","magnet":"magnet:?xt=urn:btih:14dcc0e21014dce009f626c1d1679635aaec1b77&dn=The+Intention+Economy+by+Doc+Searls+MOBI&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2053553","seeders":"38","leechers":"9","description":"xx\r\n\r\nThe Intention Economy by Doc Searls MOBI\r\n\r\nCaveat venditor - let the seller beware...\r\n\r\nWhile marketers look for more ways to get personal with customers, including new tricks with &quot;big data&quot;, customers are about to get personal in their own ways, with their own tools. Soon consumers will be able to:\r\n\r\nControl the flow and use of personal data\r\nBuild their own loyalty programs\r\nDictate their own terms of service\r\nTell whole markets what they want, how they want it, where and when they should be able to get it, and how much it should cost.\r\n\r\nAnd they will do all of this outside of any one vendor&#x2019;s silo. This new landscape we&#x2019;re entering is what Doc Searls calls The Intention Economy - one in which demand will drive supply far more directly, efficiently, and compellingly than ever before. In this book he describes an economy driven by consumer intent, where vendors must respond to the actual intentions of customers instead of vying for the attention of many.\r\n\r\nNew customer tools will provide the engine, with VRM (Vendor Relationship Management) providing the consumer counterpart to vendors&#x2019; CRM (Customer Relationship Management) systems. For example, imagine being able to change your address once for every company you deal with, or combining services from multiple companies in real time, in your own ways - all while keeping an auditable accounting of every one of your interactions in the marketplace. These tantalizing possibilities and many others are introduced in this book.\r\n\r\nAs customers become more independent and powerful, and the Intention Economy emerges, only vendors and organizations that are ready for the change will survive, and thrive. Where do you stand?\r\n\r\nxx","last_updated":"2018-04-13T16:05:50.961Z","parsed":{"xt":"urn:btih:14dcc0e21014dce009f626c1d1679635aaec1b77","dn":"The Intention Economy by Doc Searls MOBI","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"14dcc0e21014dce009f626c1d1679635aaec1b77","infoHashBuffer":{"type":"Buffer","data":[20,220,192,226,16,20,220,224,9,246,38,193,209,103,150,53,170,236,27,119]},"name":"The Intention Economy by Doc Searls MOBI","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}