{"title":"NuruMassage - Eliza Ibarra, Daisy Stone (A Slippery Anniversary)","magnet":"magnet:?xt=urn:btih:151c1ea5bb127e15dd03d1adaa854ba30b58c17b&dn=NuruMassage+-+Eliza+Ibarra%2C+Daisy+Stone+%28A+Slippery+Anniversary%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"320837048","seeders":"0","leechers":"0","description":"Daisy Stone is playing the piano in the living room. She&apos;s playing her husband&apos;s (Jay Smooth) favorite song and is hoping he&apos;ll hear it from the other side of the house. When he walks into the living room, he&apos;s got a big smile on his face and a bouquet of flowers that he&apos;s hiding behind his back. It&apos;s their anniversary today and he&apos;s got a special surprise for her. He hands her the flowers and tells her he booked a Nuru massage for her. Daisy has never had that type of massage before. When he explains how it works, she tells him that he should come in and watch. Jay is thrilled, as they head to the spa together hand in hand. When they arrive at the salon, Eliza Ibarra, is there to greet them. When she finds out it&apos;s their anniversary, she offers them a couple massage on the house. She escorts them to the massage room and Daisy asks where the massage table is. Eliza explains that they don&apos;t use a table but a mat, leaving Daisy a little confused. Eliza smiles adding that they&apos;ll start the massage with a shower and asks them to undress. Daisy is a little reluctant, but Jay assures her it&apos;s fine. It doesn&apos;t take long for Daisy to ease into it as Eliza and Jay start massaging her body. When they start playing with her pussy, Daisy&apos;s anxiety seems to have dissipated completely. They move to the mat and both girls take turns riding Jay dick and when they finish each other off, it looks like the couple won&apos;t be waiting till their next anniversary to book another appointment!\r\nCategories Oil, Kissing, Pussy Licking, Big Tits, FaceSitting, Brunette, Ass Rubbing, Skinny, Shower, Body Massage\r\n <a href=\"\nhttp://imgdone.com/image/k27OR\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/k27OR</a>\r\n <a href=\"\nhttp://imgdone.com/image/k2gu6\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/k2gu6</a>","last_updated":"2018-07-11T12:00:43.398Z","parsed":{"xt":"urn:btih:151c1ea5bb127e15dd03d1adaa854ba30b58c17b","dn":"NuruMassage - Eliza Ibarra, Daisy Stone (A Slippery Anniversary)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"151c1ea5bb127e15dd03d1adaa854ba30b58c17b","infoHashBuffer":{"type":"Buffer","data":[21,28,30,165,187,18,126,21,221,3,209,173,170,133,75,163,11,88,193,123]},"name":"NuruMassage - Eliza Ibarra, Daisy Stone (A Slippery Anniversary)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}