{"title":"Out of Captivity by M. Gonsalves, K. Stansell, T. Howes EPUB","magnet":"magnet:?xt=urn:btih:17014dc81a616de80f3bf300a05f9af03141b00b&dn=Out+of+Captivity+by+M.+Gonsalves%2C+K.+Stansell%2C+T.+Howes+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1776637","seeders":"0","leechers":"0","description":"xx\r\n\r\nOut of Captivity by M. Gonsalves, K. Stansell, T. Howes EPUB\r\n\r\nOn February 13, 2003, a plane carrying three American civilian contractors - Marc Gonsalves, Keith Stansell, and Tom Howes - crash-landed in the mountainous jungle of Colombia. Dazed and shaken, they emerged from the plane bloodied and injured as gunfire rained down around them.\r\nAs of that moment they were prisoners of the FARC, a Colombian terrorist and Marxist rebel organization. In an instant they had become American captives in Colombia&apos;s volatile and ongoing conflict, which has lasted for almost 50 years.\r\n\r\nIn Out of Captivity, Gonsalves, Stansell, and Howes recount for the first time their amazing tale of survival, friendship, and, ultimately, rescue, tracing their five and a half years as hostages of the FARC. Their story takes you inside one of the world&apos;s most notorious terrorist organizations, going behind enemy lines with vivid and haunting imagery. Their words conjure a reality that few people have ever encountered, from sleeping on beds literally carved out of the jungle to escaping Colombian military air strikes under the cover of darkness, to being bound with steel chains by their captors.\r\n\r\nThough the physical punishments their bodies endured were unrelenting, the psychological battles they waged were the ultimate test of their resolve. Exposing the transformative power of captivity, they show how they turned their fears into strengths, using their memories and their families, their pasts and their futures, to motivate them in their quest for survival.\r\n\r\n..\r\n\r\nxx","last_updated":"2018-06-17T12:10:49.615Z","parsed":{"xt":"urn:btih:17014dc81a616de80f3bf300a05f9af03141b00b","dn":"Out of Captivity by M. Gonsalves, K. Stansell, T. Howes EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"17014dc81a616de80f3bf300a05f9af03141b00b","infoHashBuffer":{"type":"Buffer","data":[23,1,77,200,26,97,109,232,15,59,243,0,160,95,154,240,49,65,176,11]},"name":"Out of Captivity by M. Gonsalves, K. Stansell, T. Howes EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}