{"title":"The Libertarian Reader by David Boaz (.epub)","magnet":"magnet:?xt=urn:btih:177f07908985cbdc2c0002549f21ac746821504e&dn=The+Libertarian+Reader+by+David+Boaz+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"3382464","seeders":"0","leechers":"0","description":"The Libertarian Reader: Classic &amp; Contemporary Writings from Lao-Tzu to Milton Friedman by David Boaz \r\n\r\nRequirements: .ePUB reader\r\n\r\nOverview: The first collection of seminal writings on a movement that is rapidly changing the face of American politics, The Libertarian Reader links some of the most fertile minds of our time to a centuries-old commitment to freedom, self-determination, and opposition to intrusive government. A movement that today counts among its supporters Steve Forbes, Nat Hentoff, and P.J. O&apos;Rourke, libertarianism joins a continuous thread of political reason running throughout history. \r\n\r\nWriting in 1995 about the large numbers of Americans who say they&apos;d welcome a third party, David Broder of The Washington Post commented, &quot;The distinguishing characteristic of these potential independent voters&#x2014;aside from their disillusionment with Washington politicians of both parties&#x2014;is their libertarian streak. They are skeptical of the Democrats because they identify them with big government. They are wary of the Republicans because of the growing influence within the GOP of the religious right.&quot; \r\n\r\nIn The Libertarian Reader, David Boaz has gathered the writers and works that represent the building blocks of libertarianism. These individuals have spoken out for the basic freedoms that have made possible the flowering of spiritual, moral, and economic life. For all independent thinkers, this unique sourcebook will stand as a classic reference for years to come, and a reminder that libertarianism is one of our oldest and most venerable American traditions.\r\n\r\nGenre: Non-Fiction &gt; General","last_updated":"2018-09-29T13:15:08.225Z","parsed":{"xt":"urn:btih:177f07908985cbdc2c0002549f21ac746821504e","dn":"The Libertarian Reader by David Boaz (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"177f07908985cbdc2c0002549f21ac746821504e","infoHashBuffer":{"type":"Buffer","data":[23,127,7,144,137,133,203,220,44,0,2,84,159,33,172,116,104,33,80,78]},"name":"The Libertarian Reader by David Boaz (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}