{"title":"AI Superpowers by Kai-Fu Lee EPUB","magnet":"magnet:?xt=urn:btih:179747a00330a4616adf109eb3ee63f27f23db62&dn=AI+Superpowers+by+Kai-Fu+Lee+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1914045","seeders":"58","leechers":"7","description":"xx\r\n\r\nAI Superpowers: China, Silicon Valley, and the New World Order by Kai-Fu Lee EPUB\r\n\r\nHere are two well-known facts:\r\n\r\nArtificial Intelligence is reshaping the world as we know it.\r\n\r\nThe United States has long been, and remains, the global leader in AI.\r\n\r\nThat first fact is correct. But in his provocative new book, Dr. Kai-Fu Lee - one of the world&#x2019;s most respected experts on AI - reveals that China has suddenly caught up to the US at an astonishingly rapid pace. As the US-Sino competition begins to heat up, Lee envisions China and the US forming a powerful duopoly in AI, but one that is based on each nation&#x2019;s unique and traditional cultural inclinations. \r\n\r\nBuilding upon his longstanding US-Sino technology career (working at Apple, Microsoft, and Google) and his much-heralded New York Times Op-Ed from June 2017, Dr. Lee predicts that Chinese and American AI will have a stunning impact on not just traditional blue-collar industries but will also have a devastating effect on white-collar professions. Is the concept of universal basic income the solution? In Dr. Lee&#x2019;s opinion, probably not. \r\n\r\nIn AI Superpowers, he outlines how millions of suddenly displaced workers must find new ways to make their lives meaningful, and how government policies will have to deal with the unprecedented inequality between the &quot;haves&quot; and the &quot;have-nots.&quot; Even worse, Lee says the transformation to AI is already happening all around us, whether we are aware of it or not.\r\n\r\nDr. Lee - a native of China but educated in America - argues powerfully that these unprecedented developments will happen much sooner than we think. He cautions us about the truly dramatic upheaval that AI will unleash and how we need to start thinking now on how to address these profound changes that are coming to our world.\r\n\r\nxx","last_updated":"2018-09-27T12:24:42.787Z","parsed":{"xt":"urn:btih:179747a00330a4616adf109eb3ee63f27f23db62","dn":"AI Superpowers by Kai-Fu Lee EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"179747a00330a4616adf109eb3ee63f27f23db62","infoHashBuffer":{"type":"Buffer","data":[23,151,71,160,3,48,164,97,106,223,16,158,179,238,99,242,127,35,219,98]},"name":"AI Superpowers by Kai-Fu Lee EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}