{"title":"Foxit PhantomPDF Business 9.3.0.10826 Multilingual Full With Med","magnet":"magnet:?xt=urn:btih:17f667471592eed96166a5b6451013f6a65de742&dn=Foxit+PhantomPDF+Business+9.3.0.10826+Multilingual+Full+With+Med&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BabuPC","categoryP":"applications","categoryS":"windows","size":"556311805","seeders":"2","leechers":"6","description":"Foxit PhantomPDF Business 9\r\n\r\nRobust for the needs of enterprises, Foxit PhantomPDF Business delivers a feature rich solution with the quality, security, deployability, and support essential for enterprise requirements.\r\n\r\nOnce documents have been converted to PDF, it is easier to perform edits and modifications in PDF instead of converting them back and forth between different file formats. Foxit PhantomPDF Business is the industry&#x2019;s premiere PDF editor; making editing PDF files easier than ever before to deliver professional looking PDF documents in no time at all. It&#x2019;s PDF editing capabilities provide capabilities similar to that of word processing software. The PDF editor automatically identifies text boxes and allows users to paragraph edit within that text box. PDF editor capabilities include:\r\n\r\n&#x2013; Automatically reflows and reformats text in the text box as you edit it &#x2013; just like a word processor. Just add or delete content without worrying about the layout.\r\n&#x2013; Link, join or split text blocks to connect text for more powerful PDF editing. Move and resize text blocks for more compelling layout.\r\n&#x2013; Edit the font of PDF text by changing type, style, size, color, and effect. Align text left, center, or right, while choosing from multiple line spacing options.\r\n&#x2013; Replicate the text&#x2019;s style (font, bold, color, etc.) when copying and pasting text.\r\n&#x2013; Edit object, object shading, change text to shape, and merge/split text.\r\n&#x2013; Automatically changes the color of edited text, making it easy for others to review and approve changes. This option can be turned on and off by the user.\r\n&#x2013; Spell checks the selected text block or the complete PDF document.\r\n&#x2013; Increase and decrease the indent of paragraphs","last_updated":"2018-10-01T12:07:08.359Z","parsed":{"xt":"urn:btih:17f667471592eed96166a5b6451013f6a65de742","dn":"Foxit PhantomPDF Business 9.3.0.10826 Multilingual Full With Med","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"17f667471592eed96166a5b6451013f6a65de742","infoHashBuffer":{"type":"Buffer","data":[23,246,103,71,21,146,238,217,97,102,165,182,69,16,19,246,166,93,231,66]},"name":"Foxit PhantomPDF Business 9.3.0.10826 Multilingual Full With Med","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}