{"title":"Oliver Loving by Stefan Merrill Block EPUB","magnet":"magnet:?xt=urn:btih:18fcef062592b34babc841a907fc80cfb2248b52&dn=Oliver+Loving+by+Stefan+Merrill+Block+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4779590","seeders":"0","leechers":"0","description":"xx\r\n\r\nOliver Loving by Stefan Merrill Block EPUB\r\n\r\nFrom Stefan Merrill Block, celebrated literary talent and author of The Story of Forgetting, comes a brilliant, propulsive book about family, the traumas and secrets that test our deepest bonds, and the stories that hold us together.\r\n\r\nOne warm, West Texas November night, a shy boy named Oliver Loving joins his classmates at Bliss County Day School&apos;s annual dance, hoping for a glimpse of the object of his unrequited affections, an enigmatic junior named Rebekkah Sterling. But as the music plays, a troubled young man sneaks in through the school&apos;s back door. The dire choices this man makes that evening - and the unspoken story he carries - will tear the town of Bliss, Texas, apart.\r\n\r\nNearly 10 years later, Oliver Loving still lies wordless and paralyzed at Crockett State Assisted Care Facility, the fate of his mind unclear. Orbiting the still point of Oliver&apos;s hospital bed is a family transformed: Oliver&apos;s mother, Eve, who keeps desperate vigil; Oliver&apos;s brother, Charlie, who has fled for New York City only to discover he cannot escape the gravity of his shattered family; Oliver&apos;s father, Jed, who tries to erase his memories with bourbon. And then there is Rebekkah Sterling, Oliver&apos;s teenage love, who left Texas long ago and still refuses to speak about her own part in that tragic night. When a new medical test promises a key to unlock Oliver&apos;s trapped mind, the town&apos;s unanswered questions resurface with new urgency, as Oliver&apos;s doctors and his family fight for a way for Oliver to finally communicate - and so also to tell the truth of what really happened that fateful night.\r\n\r\nA moving meditation on the transformative power of grief and love, a slyly affectionate look at the idiosyncrasies of family, and an emotionally charged pause resister, Oliver Loving is an extraordinarily original book that ventures into the unknowable and returns with the most fundamental truths.\r\n\r\nxx","last_updated":"2018-01-18T18:58:06.315Z","parsed":{"xt":"urn:btih:18fcef062592b34babc841a907fc80cfb2248b52","dn":"Oliver Loving by Stefan Merrill Block EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"18fcef062592b34babc841a907fc80cfb2248b52","infoHashBuffer":{"type":"Buffer","data":[24,252,239,6,37,146,179,75,171,200,65,169,7,252,128,207,178,36,139,82]},"name":"Oliver Loving by Stefan Merrill Block EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}