{"title":"Hostage Nation by Victoria Bruce, Karin Hayes EPUB","magnet":"magnet:?xt=urn:btih:1a65e5abedaedd5a20e70735e8b9c74b25d117a1&dn=Hostage+Nation+by+Victoria+Bruce%2C+Karin+Hayes+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2519746","seeders":"1","leechers":"0","description":"xx\r\n\r\nHostage Nation by Victoria Bruce, Karin Hayes EPUB\r\n\r\nThe crash of a U.S. reconnaissance plane into the Colombian jungle on February 13, 2003, set off a series of events that, five years later, would bring three South American countries on a collision course toward war, pit a giant government contractor against its employer - the U.S. government - and catapult a 40-year-old guerrilla army to the international stage as one of the most active and successful terrorist organizations in the world.\r\n\r\nHostage Nation follows the players in this international drama in which lives interweave across a chaotic and deadly chessboard. While at first the case appeared to be a one-dimensional kidnapping of three American contractors that would play out in backdoor negotiations, as many had before, the paradigm shift that took over Washington after 9/11 made impossible any such path to win the freedom of the hostages.\r\n\r\nThis is the story of Thomas Howes, Keith Stansell, and Marc Gonsalves, three Americans who went to work for the U.S. government&apos;s ill-fought &quot;War on Drugs&quot; and crash-landed into their worst nightmare, five years in captivity of the FARC rebel Army. It is the story of Colombian presidential candidate Ingrid Betancourt, poster child for all the prisoners in Colombia. It is the story of corporate malfeasance by Northrop Grumman, one of the largest defense contractors in America. It is the story of a paradigm shift that turned poor Colombian guerrillas into the biggest drug mafia in the world and earned them a prominent position on the U.S. list of terrorist organizations.\r\n\r\nThis is also a fascinating expose about the way that civilian soldiers have become the main players in covert wars that fly under the radar of the American people. It is the story of the U.S. government&apos;s ambivalence concerning victims who don&apos;t have to be tallied on the nightly news. It is the story of fragmented government factions that refuse to work together, and of foreign-policy blunders that put government contracts above American lives. It is the story of lives unraveling, of abandoned women and children, and of feuding families. And it is a revealing truth about the disastrous failure of the war on drugs that began back in 1970.\r\n\r\nxx","last_updated":"2018-05-07T12:05:05.091Z","parsed":{"xt":"urn:btih:1a65e5abedaedd5a20e70735e8b9c74b25d117a1","dn":"Hostage Nation by Victoria Bruce, Karin Hayes EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1a65e5abedaedd5a20e70735e8b9c74b25d117a1","infoHashBuffer":{"type":"Buffer","data":[26,101,229,171,237,174,221,90,32,231,7,53,232,185,199,75,37,209,23,161]},"name":"Hostage Nation by Victoria Bruce, Karin Hayes EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}