{"title":"Talk to Yourself Like a Buddhist by Cynthia Kane EPUB","magnet":"magnet:?xt=urn:btih:1a70511be24913ca27a0a06dec13cc22f6148ec0&dn=Talk+to+Yourself+Like+a+Buddhist+by+Cynthia+Kane+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"917274","seeders":"0","leechers":"0","description":"xx\r\n\r\nTalk to Yourself Like a Buddhist by Cynthia Kane EPUB\r\n\r\nChange Your Words, Change Your World\r\n\r\nThere are hundreds of books, workshops, and classes that teach us how to communicate effectively with others, but very few of us pay attention to how we speak to ourselves.\r\n\r\nBest-selling author and communication expert Cynthia Kane believes this is a travesty, and she is sounding the alarm! Kane writes that there in is an unreported epidemic of negative self-talk in our culture today.\r\n\r\nMany of us speak to ourselves in demeaning and hurtful ways, using language we would never use with anyone else. To make matters worse, we often don&apos;t even realize when we are doing this, as these old mental tapes play in repeating loops without our awareness.\r\n\r\nIn Talk to Yourself Like a Buddhist, certified mindfulness and meditation instructor Cynthia Kane introduces the Middle Path of Self-Communication, which consists of five mindful tools - Listen, Explore, Question, Release, and Balance - all of which are grounded in Buddhist principles.\r\n\r\nThis book will show you how to:\r\n\r\nIdentify your negative self-talk and explore the underlying self-judgments that produce it\r\n\r\nRelease the judgments that are poisoning your self-communication\r\n\r\nPractice a system of balanced internal communication based on truth and compassion\r\n\r\nWhen we speak to ourselves negatively, we set a tone for our day and our interactions with others in the world. Talk to Yourself Like a Buddhist can teach you how to turn off the enemy in your mind - and create a new relationship with yourself and the world around you - simply by noticing, investigating, and changing the words you use to speak to yourself.\r\n\r\nxx","last_updated":"2018-05-29T12:00:49.168Z","parsed":{"xt":"urn:btih:1a70511be24913ca27a0a06dec13cc22f6148ec0","dn":"Talk to Yourself Like a Buddhist by Cynthia Kane EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1a70511be24913ca27a0a06dec13cc22f6148ec0","infoHashBuffer":{"type":"Buffer","data":[26,112,81,27,226,73,19,202,39,160,160,109,236,19,204,34,246,20,142,192]},"name":"Talk to Yourself Like a Buddhist by Cynthia Kane EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}