{"title":"Spiritual Science by Steve Taylor","magnet":"magnet:?xt=urn:btih:1b5aeeac4816cea0366edddbfb2fdf7faf4de023&dn=Spiritual+Science+by+Steve+Taylor&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"689245","seeders":"20","leechers":"3","description":"Is it possible that the biggest mysteries in the world can be solved not through science or spirituality alone, but through an approach that combines them both?\r\n\r\nIn this groundbreaking book, Steve Taylor offers a new vision of the world that is compatible with both modern science and ancient spiritual teachings. Spiritual Science reveals Taylor&#x2019;s &#x201D;panspiritist&#x201D; view of reality, one that transcends both conventional science and religion, and answers many of the riddles that neither can fully explain.\r\n\r\nThe standard model of science has had limited success in explaining many phenomena, including human consciousness, the connection between the mind and the body, altruism and &#x201D;anomalous&#x201D; phenomena such as near-death experiences, psi phenomena and spiritual experiences, to name just a few. But from a &#x201D;panspiritist&#x201D; perspective &#x2013; which sees spirit or consciousness as a fundamental essence of reality &#x2013; it is possible to make sense of all these things.\r\n\r\nDrawing on the insights of philosophers, physicists, mystics, as well as spiritual traditions and indigenous cultures, Steve Taylor makes a compelling case for a spiritual vision of reality. He presents a worldview that is compatible with both modern science and ancient spiritual teachings &#x2013; a vision of a sacred and interconnected world, and of a meaningful and purposeful human life.\r\nReviews:\r\n\r\n&#x201C;At long last, here we have a thoughtful and accessible treatment of the deep and false divide between science and spirit that has been created by materialism.&#x201D; &#x2015; Dr Julia Mossbridge, author of Transcendent Mind and The Premonition Code\r\n\r\n&#x201C;In this important book, Steve Taylor convincingly argues that the materialist paradigm has run its course&#x2026; it is time we all sat up and took note.&#x201D; &#x2015; Dr. Penny Sartori, author of The Wisdom of Near-Death Experiences","last_updated":"2018-09-30T12:15:17.490Z","parsed":{"xt":"urn:btih:1b5aeeac4816cea0366edddbfb2fdf7faf4de023","dn":"Spiritual Science by Steve Taylor","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1b5aeeac4816cea0366edddbfb2fdf7faf4de023","infoHashBuffer":{"type":"Buffer","data":[27,90,238,172,72,22,206,160,54,110,221,219,251,47,223,127,175,77,224,35]},"name":"Spiritual Science by Steve Taylor","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}