{"title":"[post-rock] (2017) Brokeback - Illinois River Valley Blues [FLAC","magnet":"magnet:?xt=urn:btih:1baaf8fcebfb7a2606279e5372f1ffea8825136d&dn=%5Bpost-rock%5D+%282017%29+Brokeback+-+Illinois+River+Valley+Blues+%5BFLAC&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"100.XY","categoryP":"audio","categoryS":"flac","size":"279317772","seeders":"0","leechers":"0","description":"(2017) Brokeback - Illinois River Valley Blues\r\n\r\nReview: \r\nTortoise co-founder Douglas McCombs resumed his Brokeback project after a decade-long absence with 2013&#x2019;s Brokeback and the Black Rock. Follow-up Illinois River Valley Blues slightly restructures the band&#x2019;s lineup from that album, with James Elkington moving from drums to second guitar (and also playing pedal steel, organ, and harmonica) and Areif Sless-Kitain (the Eternals) joining as Brokeback&#x2019;s drummer. Pete Croke remains as bassist and McCombs continues with his distinctive guitar style, which is clean, resonant, and somewhat twangy. While earlier Brokeback albums were somewhat cold and abstract, this iteration of the group has a much warmer, earthier sound. The album is primarily instrumental, but Amalea Tshilds sings from time to time. Her wordless vocals are light and shimmering, and don&#x2019;t always grab the listener&#x2019;s attention, at least not the way the late Mary Hansen of Stereolab did when she sang on earlier Brokeback records. Instead, the dusty, spaghetti Western-inspired guitar melodies seem to be the focal point of most of the songs. The group sounds locked in, and the compositions are thoughtfully arranged and sophisticated while maintaining an easygoing flow. The guitars sparkle, but there&#x2019;s a hint of roughness to them, and while the tempos often seem to drift, they&#x2019;re still carefully considered and precise. A few songs are more upbeat, such as the spicy &#x201C;Cairo Levee&#x201D; and the &#x2019;50s rock flashback &#x201C;Andalusia, IL.&#x201D; &#x201C;Spanish Venus&#x201D; is a classy little cocktail ballad with a bumping bassline, and it was written by the brilliant Rob Mazurek, who has contributed to past Brokeback releases. During the second half of the album, the group gets slightly looser, with spacier, jazzier arrangements flavored with country steel guitar. They also play with dynamics a bit more, starting out softer and getting heavier and sludgier on &#x201C;Ursula,&#x201D; and arriving at an uptempo roots rock groove after a few minutes of fragmentary floating during &#x201C;On the Move and Vanishing.&#x201D; \r\nThe album is mostly soothing and sometimes invigorating, and always seems in tune with nature. It seems like music made for cruising across the country alone, and it generally feels bright and optimistic but with wistful undertones. It also sounds undeniably like Brokeback. \r\n\r\nTracklist: \r\n01 Ride Ahead and Light the Way for Me.flac \r\n02 Cairo Levee.flac \r\n03 The Canyons of Illinois.flac \r\n04 Andalusia, IL.flac \r\n05 Spanish Venus.flac \r\n06 On the Move and Vanishing.flac \r\n07 Rise, Fernanda, Rise!.flac \r\n08 Ursula.flac \r\n09 The Strollers&apos; Memorial.flac \r\n10 Night Falls on Chillicothe.flac \r\n\r\nSummary: \r\nCountry: USA \r\nGenre: post-rock","last_updated":"2018-06-28T12:01:41.017Z","parsed":{"xt":"urn:btih:1baaf8fcebfb7a2606279e5372f1ffea8825136d","dn":"[post-rock] (2017) Brokeback - Illinois River Valley Blues [FLAC","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1baaf8fcebfb7a2606279e5372f1ffea8825136d","infoHashBuffer":{"type":"Buffer","data":[27,170,248,252,235,251,122,38,6,39,158,83,114,241,255,234,136,37,19,109]},"name":"[post-rock] (2017) Brokeback - Illinois River Valley Blues [FLAC","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}