{"title":"Pretend I'm Dead by Jen Beagin EPUB","magnet":"magnet:?xt=urn:btih:1d7d4134d764c3b44a65a835277403e82533f309&dn=Pretend+I%27m+Dead+by+Jen+Beagin+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2687597","seeders":"0","leechers":"2","description":"xx\r\n\r\nPretend I&apos;m Dead by Jen Beagin EPUB\r\n\r\nMiranda July meets Mary Karr in this brilliant debut novel from Jen Beagin, Whiting Award winner and &quot;one of the freshest voices [&#x2026;] in years - funny, wise, whip-smart, and compassionate&quot; (Jami Attenberg, author of The Middlesteins), about a cleaning lady on a quest for self-acceptance after her relationship with a loveable junkie goes awry.\r\n\r\nJen Beagin&apos;s quirky, moving, &quot;frank and unflinching&quot; (Josh Ferris) debut novel introduces an unforgettable character, Mona - almost 24, emotionally adrift, and cleaning houses to get by. Handing out clean needles to drug addicts, she falls for a recipient she calls Mr. Disgusting, who proceeds to break her heart in unimaginable ways.\r\n\r\nIn search of healing, Mona decamps to Taos, New Mexico, for a fresh start, where she finds a community of seekers and cast-offs, all of whom have one or two things to teach her - the pajama-wearing, blissed-out New Agers, the slightly creepy client with peculiar tastes in controlled substances, the psychic who might really be psychic. But always lurking just beneath the surface are her memories of growing up in a chaotic, destructive family from which she&apos;s trying to disentangle herself, and the larger legacy of the past she left behind.\r\n\r\nThe story of Mona&apos;s journey to find her place in this working-class American world is at once hilarious and wonderfully strange, true to life and boldly human, and introduces a stunningly one-of-a-kind new voice in American fiction.\r\n\r\nxx","last_updated":"2018-05-18T12:04:02.389Z","parsed":{"xt":"urn:btih:1d7d4134d764c3b44a65a835277403e82533f309","dn":"Pretend I'm Dead by Jen Beagin EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1d7d4134d764c3b44a65a835277403e82533f309","infoHashBuffer":{"type":"Buffer","data":[29,125,65,52,215,100,195,180,74,101,168,53,39,116,3,232,37,51,243,9]},"name":"Pretend I'm Dead by Jen Beagin EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}