{"title":"The Book of Joy: Lasting Happiness in a Changing World.epub","magnet":"magnet:?xt=urn:btih:1e42d0b52fe6a1c03afd9449e06163464ac32dee&dn=The+Book+of+Joy%3A+Lasting+Happiness+in+a+Changing+World.epub&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"CopperSun","categoryP":"other","categoryS":"e_books","size":"8533036","seeders":"34","leechers":"6","description":"The Book of Joy: Lasting Happiness in a Changing World \r\n\r\nBy Dalai Lama, Desmond Tutu, Douglas Carlton Abrams \r\n\r\n\r\n\r\nTwo great spiritual masters share their own hard-won wisdom about living with joy even in the face of adversity.\r\n\r\nThe occasion was a big birthday. And it inspired two close friends to get together in Dharamsala for a talk about something very important to them. The friends were His Holiness the Dalai Lama and Archbishop Desmond Tutu. The subject was joy. Both winners of the Nobel Prize, both great spiritual masters and moral leaders of our time, they are also known for being among the most infectiously happy people on the planet.\r\n\r\nFrom the beginning the book was envisioned as a three-layer birthday cake: their own stories and teachings about joy, the most recent findings in the science of deep happiness, and the daily practices that anchor their own emotional and spiritual lives. Both the Dalai Lama and Archbishop Tutu have been tested by great personal and national adversity, and here they share their personal stories of struggle and renewal. Now that they are both in their eighties, they especially want to spread the core message that to have joy yourself, you must bring joy to others.\r\n\r\nMost of all, during that landmark week in Dharamsala, they demonstrated by their own exuberance, compassion, and humor how joy can be transformed from a fleeting emotion into an enduring way of life","last_updated":"2018-09-08T12:29:16.249Z","parsed":{"xt":"urn:btih:1e42d0b52fe6a1c03afd9449e06163464ac32dee","dn":"The Book of Joy: Lasting Happiness in a Changing World.epub","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1e42d0b52fe6a1c03afd9449e06163464ac32dee","infoHashBuffer":{"type":"Buffer","data":[30,66,208,181,47,230,161,192,58,253,148,73,224,97,99,70,74,195,45,238]},"name":"The Book of Joy: Lasting Happiness in a Changing World.epub","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}