{"title":"This is Spinal Tap (Collection)","magnet":"magnet:?xt=urn:btih:1f1c11f194154da8805768256508242e8584bc30&dn=This+is+Spinal+Tap+%28Collection%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Trumad","categoryP":"video","categoryS":"movies","size":"11980437097","seeders":"0","leechers":"12","description":"Probably the most complete Spinal Tap collection ever created. This edition comprises:\r\n\r\nThe movie, in 1080p with all subtitles and commentaries from various blu-ray and DVD releases \r\nAll &quot;Up to 11 Edition&quot; extras\r\nAll Criterion Edition extras\r\nExtras found online (4 hour workprint, Live Earth performance, Return of Spinal Tap, and other items of assorted interest)\r\n\r\nThis collection includes both the in-character and out of character commentaries by the actors, as well as other commentaries with Rob Reiner &amp; the film&apos;s editors. These have never all been packaged together before, and the Criterion commentaries only exist on DVD, so it&apos;s nice to be able to enjoy those with the movie in 1080p. I spent quite some time syncing up some of the PAL DVD commentaries with the NTSC blu-ray video, and some of the commentaries may be slightly out of sync as a result. Not by much - it doesn&apos;t affect my enjoyment - but you may be more of a perfectionist than I. The commentaries I synced are AAC &amp; FLAC files stored in the MKV, so you should be able to fix it if so inclined. The Criterion commentaries are also included as separate MP3s.\r\n\r\nThe Workprint is supplied as a full DVD in a .iso file, which is how its been distributed online thus far. I didn&apos;t think it appropriate to convert it to x264. The quality is quite low and another conversion would not do it any good, or reduce the file-size by much (given the amount of noise x264 would have to deal with). The full Live Earth performance is taken from Youtube, but I believe a better quality version may be out there somewhere.\r\n\r\nThe Return of Spinal Tap &quot;sequel&quot; of sorts is included as a DVD extra in the up to 11 edition, but I have also included a VHSrip I found online. That version has an extra hour of footage, and I am unsure why the two are so different.\r\n\r\nI hope you enjoy this. My goal is that this becomes the definitive This Is Spinal Tap release, and it lives for years in torrents. Please seed, share, archive and preserve!","last_updated":"2018-06-04T12:07:50.901Z","parsed":{"xt":"urn:btih:1f1c11f194154da8805768256508242e8584bc30","dn":"This is Spinal Tap (Collection)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1f1c11f194154da8805768256508242e8584bc30","infoHashBuffer":{"type":"Buffer","data":[31,28,17,241,148,21,77,168,128,87,104,37,101,8,36,46,133,132,188,48]},"name":"This is Spinal Tap (Collection)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}