{"title":"An Easy Death by Charlaine Harris EPUB","magnet":"magnet:?xt=urn:btih:1f2ad8cd3a48cc82ab2c749ba3ff31db9d14477b&dn=An+Easy+Death+by+Charlaine+Harris+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"833977","seeders":"0","leechers":"1","description":"xx\r\n\r\nAn Easy Death by Charlaine Harris EPUB\r\n\r\nNumber-one New York Times best-seller Charlaine Harris (Sookie Stackhouse mysteries, True Blood, Midnight Crossroad) delivers the first thriller in a new trilogy that presents a chilling alternate history of the US where everyone believes in magic - but no one is sure whether they can trust it. \r\n\r\nAfter the assassination of FDR in the 1930s, the US collapses and is picked off by the UK, Canada, Mexico, and Russia. We find ourselves in the Southwestern states, now known as Texoma. It is here that the gunnie Lizbeth Rose tries to piece out a life, running security on runs from Texoma across the border to Mexico, where work and prospects are stronger. \r\n\r\nWhen two Russian magicians come looking for a man named Alex Karkarov, they hire Lizbeth to find him or his family, but there are problems: The man they&apos;re looking for is dead, but he has a daughter they now need to find, as an ever-growing set of sorcerers and gunnies do not want them to succeed. It&apos;s a good thing Lizbeth is a deadly gunfighter; too bad she hates sorcerers, even the ones on whom she has to learn to rely. \r\n\r\nNumber-one New York Times best-seller Charlaine Harris (Sookie Stackhouse mysteries, True Blood, Midnight Crossroad) returns to fantasy in a taut thriller set in a US where magic is an acknowledged truth, but disreputable.\r\n\r\nxx","last_updated":"2018-10-02T12:26:57.590Z","parsed":{"xt":"urn:btih:1f2ad8cd3a48cc82ab2c749ba3ff31db9d14477b","dn":"An Easy Death by Charlaine Harris EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1f2ad8cd3a48cc82ab2c749ba3ff31db9d14477b","infoHashBuffer":{"type":"Buffer","data":[31,42,216,205,58,72,204,130,171,44,116,155,163,255,49,219,157,20,71,123]},"name":"An Easy Death by Charlaine Harris EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}