{"title":"Cry Of Love Brother - Brother 1993 FLAC","magnet":"magnet:?xt=urn:btih:1f592bdde8faac2eb8228507898c174cffe54826&dn=Cry+Of+Love+Brother+-+Brother+1993+FLAC&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Stangman1234","categoryP":"audio","categoryS":"flac","size":"285475472","seeders":"2","leechers":"5","description":"Cry Of Love was an American rock band, formed in 1989 in Raleigh, North Carolina. The group released their debut album in 1993 (Brother), produced by John Custer before hitting the road for the next 17 months. After completing their &apos;93-&apos;94 touring cycle frontman Kelly Holland quit the band, saying he could no longer handle the rigors of the road. They scored a number-one hit on Billboard&apos;s Mainstream Rock chart with &quot;Peace Pipe&quot; in 1993. \r\nEx-Lynch Mob and current Warrant singer Robert Mason was recruited as Holland&apos;s replacement in 1996. Together they released a new album in 1997 (Diamonds &amp; Debris), but the band split shortly afterwards. \r\nFormer band member Audley Freed was recruited to the Black Crowes in 1998, and he played with the band until October 2001. He also played on Crowes&apos; lead singer Chris Robinson&apos;s second solo album in 2004, and on the subsequent tour. \r\nBassist Robert Kearns later played with Lynyrd Skynyrd, after the death of Ean Evans, until early 2012. Freed and Kearns formed a band named Big Hat that also includes Keith Gattis - vocals/guitar; Peter Stroud - guitars; Fred Eltringham - drums; Ike Stubblefield - keyboards. These days, Freed and Kearns (along with Freed&apos;s multi-talented wife, Jen, and Stroud, are part of Sheryl Crow&apos;s touring band). \r\nFormer singer Kelly Holland died on February 24, 2014 of health complications in Raleigh, NC. He was 52.[1] \r\nThe band&apos;s debut, Brother, was re-issued by French indie label Bad Reputation in 2016 and includes an additional 5 songs, previously released on various singles, as bonus tracks","last_updated":"2018-08-25T12:10:20.400Z","parsed":{"xt":"urn:btih:1f592bdde8faac2eb8228507898c174cffe54826","dn":"Cry Of Love Brother - Brother 1993 FLAC","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1f592bdde8faac2eb8228507898c174cffe54826","infoHashBuffer":{"type":"Buffer","data":[31,89,43,221,232,250,172,46,184,34,133,7,137,140,23,76,255,229,72,38]},"name":"Cry Of Love Brother - Brother 1993 FLAC","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}