{"title":"The Cubs Way by Tom Verducci EPUB","magnet":"magnet:?xt=urn:btih:204e48169060c4ec44120768604815dabd13f930&dn=The+Cubs+Way+by+Tom+Verducci+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"17389747","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Cubs Way by Tom Verducci EPUB\r\n\r\nWith inside access and reporting, Sports Illustrated senior baseball writer and FOX Sports analyst Tom Verducci reveals how Theo Epstein and Joe Maddon built, led, and inspired the Chicago Cubs team that broke the longest championship drought in sports, chronicling their epic journey to become World Series champions.\r\n\r\nIt took 108 years, but it really happened. The Chicago Cubs are once again World Series champions.\r\n\r\nHow did a team composed of unknown young players and supposedly washed-up veterans come together to break the Curse of the Billy Goat? Tom Verducci, twice named National Sportswriter of the Year and cowriter of The Yankee Years with Joe Torre, will have full access to team president Theo Epstein, manager Joe Maddon, and the players to tell the story of the Cubs&apos; transformation from perennial underachievers to the best team in baseball.\r\n\r\nBeginning with Epstein&apos;s first year with the team in 2011, Verducci will show how Epstein went beyond &quot;Moneyball&quot; thinking to turn around the franchise. Leading the organization with a manual called &quot;The Cubs Way&quot;, he focused on the mental side of the game as much as the physical, emphasizing chemistry as well as statistics.\r\n\r\nTo accomplish his goal, Epstein needed manager Joe Maddon, an eccentric innovator, as his counterweight on the Cubs&apos; bench. A man who encourages themed road trips and late-arrival game days to loosen up his team, Maddon mixed New Age thinking with Old School leadership to help his players find their edge.\r\n\r\nThe Cubs Way takes readers behind the scenes, chronicling how key players like Rizzo, Russell, Lester, and Arrieta were deftly brought into the organization by Epstein and coached by Maddon to outperform expectations. Together, Epstein and Maddon proved that clubhouse culture is as important as on-base percentage and that intangible components like personality, vibe, and positive energy are necessary for a team to perform to their fullest potential.\r\n\r\nVerducci chronicles the playoff run that culminated in an instant classic Game Seven. He takes a broader look at the history of baseball in Chicago and the almost supernatural element to the team&apos;s repeated loses that kept fans suffering but also served to strengthen their loyalty.\r\n\r\nxx","last_updated":"2018-03-23T12:02:48.142Z","parsed":{"xt":"urn:btih:204e48169060c4ec44120768604815dabd13f930","dn":"The Cubs Way by Tom Verducci EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"204e48169060c4ec44120768604815dabd13f930","infoHashBuffer":{"type":"Buffer","data":[32,78,72,22,144,96,196,236,68,18,7,104,96,72,21,218,189,19,249,48]},"name":"The Cubs Way by Tom Verducci EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}