{"title":"Give People Money by Annie Lowrey EPUB","magnet":"magnet:?xt=urn:btih:209a47dba8deb85b0f618938d1ce26b1f0cb6f60&dn=Give+People+Money+by+Annie+Lowrey+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1969329","seeders":"0","leechers":"0","description":"xx\r\n\r\nGive People Money: How a Universal Basic Income Would End Poverty, Revolutionize Work, and Remake the World by Annie Lowrey EPUB\r\n\r\nA brilliantly reported, global look at universal basic income - a stipend given to every citizen - and why it might be necessary in an age of rising inequality, persistent poverty, and dazzling technology.\r\n\r\nImagine if every month the government deposited $1,000 into your bank account, with nothing expected in return. It sounds crazy. But it has become one of the most influential and hotly debated policy ideas of our time. Futurists, radicals, libertarians, socialists, union representatives, feminists, conservatives, Bernie supporters, development economists, childcare workers, welfare recipients, and politicians from India to Finland to Canada to Mexico - all are talking about UBI.\r\n\r\nIn this sparkling and provocative book, economics writer Annie Lowrey examines the UBI movement from many angles. She travels to Kenya to see how a UBI is lifting the poorest people on earth out of destitution, India to see how inefficient government programs are failing the poor, South Korea to interrogate UBI&#x2019;s intellectual pedigree, and Silicon Valley to meet the tech titans financing UBI pilots in expectation of a world with advanced artificial intelligence and little need for human labor.\r\n\r\nLowrey explores the potential of such a sweeping policy and the challenges the movement faces, among them contradictory aims, uncomfortable costs, and, most powerfully, the entrenched belief that no one should get something for nothing. In the end, she shows how this arcane policy has the potential to solve some of our most intractable economic problems while offering a new vision of citizenship and a firmer foundation for our society in this age of turbulence and marvels.\r\n\r\nxx","last_updated":"2018-07-13T12:00:53.596Z","parsed":{"xt":"urn:btih:209a47dba8deb85b0f618938d1ce26b1f0cb6f60","dn":"Give People Money by Annie Lowrey EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"209a47dba8deb85b0f618938d1ce26b1f0cb6f60","infoHashBuffer":{"type":"Buffer","data":[32,154,71,219,168,222,184,91,15,97,137,56,209,206,38,177,240,203,111,96]},"name":"Give People Money by Annie Lowrey EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}