{"title":"SexArt - Lee Anne (Spanish Romance) NEW 10 October 2018","magnet":"magnet:?xt=urn:btih:20e9668f8db0cbebd4918bd3b8bf0059db65f44e&dn=SexArt+-+Lee+Anne+%28Spanish+Romance%29+NEW+10+October+2018&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"319860816","seeders":"0","leechers":"0","description":"Beautiful Lee Anne and Kristof Cale kiss on a terrace overlooking the scenic hills of Sitges at the beginning of Andrej Lupin&#x2019;s erotic movie &#x201C;Spanish Romance.&#x201D; They dance and flirt across the cobblestone floor as the sexual tension between them grows. The stunning brunette removes her dress seductively in the sunlit doorway of their dreamy bedroom, revealing a gorgeous body kissed by the summer sun. She crawls toward her man and they kiss heatedly on the edge of the bed. He removes her hat, his hands entwined in her hair as she unbuttons his shirt. Rolling her onto her back, he kisses down her toned stomach to remove her silky white panties, revealing her hot pussy, with shaved lips and a neatly trimmed bush. He teases her clit, licking and sucking until her body is shaking in orgasm. Passionately, Kristof kisses her, removing his pants and entering her from behind in spoons. He lifts her leg and thrusts his thick dick into her vigorously as she strums her clit, moaning with arousal. Lee Anne sucks her sweetness from Kristof&#x2019;s stiff cock as he bucks his hips, then mounts him, taking his rigid erection back inside her soaked slit. Her hunger is relentless as she rides him until her orgasm overwhelms her, her body shaking. They switch to missionary, her leg over his shoulder to bring him deeper into her dripping pussy. The lovers gaze into each other&#x2019;s eyes as they fuck, Kristof pulling out for Lee Anne to jerk his load over her quivering body. They embrace and share a shower, sunlight and water streaming over their naked bodies as he teases her with his still-hard shaft, unable to resist her for a single moment. \r\n <a href=\"\nhttp://imgdone.com/image/zqYCn\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/zqYCn</a>\r\n <a href=\"\nhttp://imgdone.com/image/zqLtM\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/zqLtM</a>","last_updated":"2018-10-11T12:46:33.964Z","parsed":{"xt":"urn:btih:20e9668f8db0cbebd4918bd3b8bf0059db65f44e","dn":"SexArt - Lee Anne (Spanish Romance) NEW 10 October 2018","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"20e9668f8db0cbebd4918bd3b8bf0059db65f44e","infoHashBuffer":{"type":"Buffer","data":[32,233,102,143,141,176,203,235,212,145,139,211,184,191,0,89,219,101,244,78]},"name":"SexArt - Lee Anne (Spanish Romance) NEW 10 October 2018","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}