{"title":"Killers of the Flower Moon","magnet":"magnet:?xt=urn:btih:213eff17a65f3627a9aa3d04b8fe54ba36cc71c2&dn=Killers+of+the+Flower+Moon&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"CopperSun","categoryP":"audio","categoryS":"audio_books","size":"261720379","seeders":"26","leechers":"7","description":"Killers of the Flower Moon: The Osage Murders and the Birth of the FBI \r\n\r\n\r\nBy David Grann \r\n\r\nNarrated by Danny Campbell, Will Patton, Ann Marie Lee \r\n\r\nPublished by Random House Audio in 2017 \r\n\r\nEnglish, 8 hours 53 minutes, Unabridged \r\n\r\nMP3 64 kbps, 249.60 MB, 7 file(s) \r\n\r\n\r\n\r\n\r\nFrom New Yorker staff writer David Grann, New York Times best-selling author of The Lost City of Z, a twisting, haunting true-life murder mystery about one of the most monstrous crimes in American history.\r\nIn the 1920s the richest people per capita in the world were members of the Osage Indian nation in Oklahoma. After oil was discovered beneath their land, they rode in chauffeured automobiles, built mansions, and sent their children to study in Europe.\r\nThen, one by one, the Osage began to be killed off. The family of an Osage woman, Mollie Burkhart, became a prime target. Her relatives were shot and poisoned. And it was just the beginning, as more and more members of the tribe began to die under mysterious circumstances.\r\nIn this last remnant of the Wild West - where oilmen like J. P. Getty made their fortunes and where desperadoes like Al Spencer, the &quot;Phantom Terror&quot;, roamed - many of those who dared to investigate the killings were themselves murdered. As the death toll climbed to more than 24, the FBI took up the case. It was one of the organization&apos;s first major homicide investigations, and the bureau badly bungled the case. In desperation the young director, J. Edgar Hoover, turned to a former Texas Ranger named Tom White to unravel the mystery. White put together an undercover team, including one of the only American Indian agents in the bureau. The agents infiltrated the region, struggling to adopt the latest techniques of detection. Together with the Osage they began to expose one of the most chilling conspiracies in American history.\r\nIn Killers of the Flower Moon, David Grann revisits a shocking series of crimes in which dozens of people were murdered in cold blood. Based on years of research and startling new evidence, the book is a masterpiece of narrative nonfiction, as each step in the investigation reveals a series of sinister secrets and reversals. But more than that, it is a searing indictment of the callousness and prejudice toward American Indians that allowed the murderers to operate with impunity for so long. Killers of the Flower Moon is utterly compelling but also emotionally devastating","last_updated":"2018-08-25T12:12:57.462Z","parsed":{"xt":"urn:btih:213eff17a65f3627a9aa3d04b8fe54ba36cc71c2","dn":"Killers of the Flower Moon","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"213eff17a65f3627a9aa3d04b8fe54ba36cc71c2","infoHashBuffer":{"type":"Buffer","data":[33,62,255,23,166,95,54,39,169,170,61,4,184,254,84,186,54,204,113,194]},"name":"Killers of the Flower Moon","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}