{"title":"Scribe: A Novel by Alyson Hagy EPUB","magnet":"magnet:?xt=urn:btih:21b579d23c639f988df7971ced5d4709b4cf7d7b&dn=Scribe%3A+A+Novel+by+Alyson+Hagy+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1994087","seeders":"0","leechers":"0","description":"xx\r\n\r\nScribe: A Novel by Alyson Hagy EPUB\r\n\r\nA haunting, evocative tale about the power of storytelling\r\n\r\nA brutal civil war has ravaged the country, and contagious fevers have decimated the population. Abandoned farmhouses litter the isolated mountain valleys and shady hollows. The economy has been reduced to barter and trade.\r\n\r\nIn this craggy, unwelcoming world, the central character of Scribe ekes out a lonely living on the family farmstead where she was raised and where her sister met an untimely end. She lets a migrant group known as the Uninvited set up temporary camps on her land, and maintains an uneasy peace with her cagey neighbors and the local enforcer. She has learned how to make paper and ink, and she has become known for her letter-writing skills, which she exchanges for tobacco, firewood, and other scarce resources. An unusual request for a letter from a man with hidden motivations unleashes the ghosts of her troubled past and sets off a series of increasingly calamitous events that culminate in a harrowing journey to a crossroads.\r\n\r\nDrawing on traditional folktales and the history and culture of Appalachia, Alyson Hagy has crafted a gripping, swiftly plotted novel that touches on pressing issues of our time - migration, pandemic disease, the rise of authoritarianism - and makes a compelling case for the power of stories to both show us the world and transform it.\r\n\r\nxx","last_updated":"2018-10-22T12:03:53.062Z","parsed":{"xt":"urn:btih:21b579d23c639f988df7971ced5d4709b4cf7d7b","dn":"Scribe: A Novel by Alyson Hagy EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"21b579d23c639f988df7971ced5d4709b4cf7d7b","infoHashBuffer":{"type":"Buffer","data":[33,181,121,210,60,99,159,152,141,247,151,28,237,93,71,9,180,207,125,123]},"name":"Scribe: A Novel by Alyson Hagy EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}