{"title":"Learn How to Make Trading Card Game Menus With Unity 3D","magnet":"magnet:?xt=urn:btih:22543253a68032eb7e5478b766d290822294e3ae&dn=Learn+How+to+Make+Trading+Card+Game+Menus+With+Unity+3D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"tuts756","categoryP":"other","categoryS":"other","size":"1561783205","seeders":"4","leechers":"22","description":"Description\r\nThis course provides a full guide on trading card game menus. In the video Lectures we cover only the process of making menus, collection browsing, deck building, pack opening, etc&#x2026; But the battle mechanics part is also included into the Unity project that is provided with the course. So, you`ll have an opportunity to play the game with the cards that you create yourself or even use this application as a foundation for your own trading card game.\r\nThe material in this course is divided into 5 Sections. Section 1 features a short introduction to the course.\r\nSince the Unity project that we are developing in this course can be treated as an extension of the course that we have made earlier about card game battle mechanics, in Section 2 we will make a recap of the techniques that we use in both courses to store cards in the project. You will learn about ScriptableObjects and ScriptableObject assets and how you can use them to store cards in your project. \r\nWho is the target audience?\r\n    This course is for trading card game enthusiasts and for people who are interested in making card games like Hearthstone and Magic the Gathering. It will help you both build your own trading card game and explore what happens behind the scenes in your favorite trading card games.\r\nRequirements\r\n    First couple of Sections in this course are very beginner friendly. In these Sections we spend most of the time working in Unity Editor. So anyone can learn how to make and rotate cards, create other visual elements that are used in this game.\r\n    In Sections 4-6 we use some advanced scripting techniques to establish all the processes that happen in our game Logic, write AI scripts and so on. So for the final lectures of this course it is best if you have some previous experience with C#. I try to explain everything that I am doing as much as I can.\r\n    You should install the latest version of Unity3D to work on this course and open example projects that are provided with this course (to develop this game I used Unity 5.4 beta, so any version of Unity after 5.4 will do)","last_updated":"2018-07-08T12:13:39.739Z","parsed":{"xt":"urn:btih:22543253a68032eb7e5478b766d290822294e3ae","dn":"Learn How to Make Trading Card Game Menus With Unity 3D","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"22543253a68032eb7e5478b766d290822294e3ae","infoHashBuffer":{"type":"Buffer","data":[34,84,50,83,166,128,50,235,126,84,120,183,102,210,144,130,34,148,227,174]},"name":"Learn How to Make Trading Card Game Menus With Unity 3D","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}