{"title":"Mirzapur.2018.Season 01 .Episode 01 [MovieOW]","magnet":"magnet:?xt=urn:btih:226b827363ae6c19bcb9902b69f2238d9236c210&dn=Mirzapur.2018.Season+01+.Episode+01+%5BMovieOW%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"TiaeoChoaXXX","categoryP":"video","categoryS":"movies","size":"1016858668","seeders":"8","leechers":"8","description":"The iron-fisted Akhandanand Tripathi is a millionaire carpet exporter and the mafia don of Mirzapur. His son, Munna, is an unworthy, power-hungry heir who will stop at nothing to inherit his father&apos;s legacy. An incident at a wedding procession forces him to cross paths with Ramakant Pandit, an upstanding lawyer, and his sons, Guddu and Bablu. It snowballs into a game of ambition, power and greed that threatens the fabric of this lawless city.\r\n\r\nMirzapur is a tale of trigger-happy gangsters with sharp minds and dry humour, where loyalties change in a flash and cold cash rules. Violence is an everyday occurrence where complete and utter dominance is the goal. Politicians, cops, lawyers, and mafia lords are involved in a complex web of relationships and rivalries.\r\n\r\nAkhandanand Tripathi, also known as &apos;Kaleen Bhaiya&apos;, is a millionaire carpet exporter and the don of the city of Mirzapur, which lies in the hinterland, a lawless belt of Purvanchal in eastern India. Mirzapur is the most coveted seat of power in the region. The ruthless Tripathis have been the unchallenged rulers of Mirzapur since Satyananda Tripathi, Akhandanand&apos;s father, took the reins of the city twenty years ago in a bloody uprising.\r\n\r\nMunna Tripathi, Akhandanand&apos;s son, is power hungry and will not stop at anything to inherit his father&apos;s legacy, an empire built on illegal gun trade and opium smuggling. But his own father believes him unready for seat.\r\n\r\nGuddu and Bablu Pandit are the sons of the city&apos;s only righteous and upstanding lawyer and activist, Ramakant Pandit. Guddu and Bablu aspire for a better life, that breaks the drudgery of middle-class living, while Ramakant crusades to take on the mighty Tripathis.\r\n\r\nAn unrelated incident, involving Munna at a wedding procession, ignites a series of events entangling the lives of the Tripathis and the Pandits. This sets off a game of ambition, power, loyalty and greed, eventually threatening the control of the Tripathis&apos;s on Mirzapur. <a href=\"\nhttps://1337x.to/torrent/3403446/Mirzapur-2018-Season-01-Episode-01-MovieOW/\" rel=\"nofollow\" target=\"_NEW\">\nhttps://1337x.to/torrent/3403446/Mirzapur-2018-Season-01-Episode-01-MovieOW/</a>","last_updated":"2018-11-22T12:13:38.258Z","parsed":{"xt":"urn:btih:226b827363ae6c19bcb9902b69f2238d9236c210","dn":"Mirzapur.2018.Season 01 .Episode 01 [MovieOW]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"226b827363ae6c19bcb9902b69f2238d9236c210","infoHashBuffer":{"type":"Buffer","data":[34,107,130,115,99,174,108,25,188,185,144,43,105,242,35,141,146,54,194,16]},"name":"Mirzapur.2018.Season 01 .Episode 01 [MovieOW]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}