{"title":"Poorly Made in China by Paul Midler EPUB","magnet":"magnet:?xt=urn:btih:22786433b36ee101af05964d703f041fcb9ba0de&dn=Poorly+Made+in+China+by+Paul+Midler+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"371853","seeders":"0","leechers":"0","description":"xx\r\n\r\nPoorly Made in China by Paul Midler EPUB\r\n\r\nIt was a world gone wrong, one in which manufacturers thought little of manipulating product quality levels in order to save the smallest amounts, where savvy foreign business leaders were made to feel in control while they were taken for a ride by their partners, where entire manufacturing facilities sometimes vanished right into thin air... Welcome to Poorly Made in China!\r\n\r\nAt the height of the boom export manufacturing, Paul Midler returned to East Asia, a recently graduated Wharton MBA. In the right place at the right time, he was sought out by a number of foreign companies who wanted help in navigating the new economy. The adventures came fast, as did the business and cultural lessons.\r\n\r\nPoorly Made in China is a dramatic romp through China&apos;s export manufacturing sector, one that reveals what really goes on behind the scenes. The story follows the author from one project to the next, taking the reader through a diverse set of industries and revealing a number of challenges. An engaging business narrative told with doses of humor and insight, this true story pulls back the curtain on the rising Chinese economy, providing a closer look at the rough-and-tumble environment in which so many of our consumer products are being made. For those trying to make sense of why so many quality failures could come out of China at once, this book is an especially interesting read.\r\n\r\nPoorly Made in China is the tale of a modern-day gold rush and its consequences, the chronicling of a rising economic power and its path along a steep growth curve. Entertaining and eye-opening, the book highlights the extent to which culture affects business dealings, and the ultimate suggestion is that we may have more to be concerned about than product failures alone.\r\n\r\nxx","last_updated":"2018-05-07T12:05:02.757Z","parsed":{"xt":"urn:btih:22786433b36ee101af05964d703f041fcb9ba0de","dn":"Poorly Made in China by Paul Midler EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"22786433b36ee101af05964d703f041fcb9ba0de","infoHashBuffer":{"type":"Buffer","data":[34,120,100,51,179,110,225,1,175,5,150,77,112,63,4,31,203,155,160,222]},"name":"Poorly Made in China by Paul Midler EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}