{"title":"Shop Class as Soulcraft by Matthew B. Crawford EPUB","magnet":"magnet:?xt=urn:btih:23adcbc90e36bd69ed50ad420256cde0dbefaba3&dn=Shop+Class+as+Soulcraft+by+Matthew+B.+Crawford+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"766201","seeders":"29","leechers":"2","description":"xx\r\n\r\nShop Class as Soulcraft: An Inquiry into the Value of Work by Matthew B. Crawford EPUB\r\n\r\nShop Class as Soulcraft brings alive an experience that was once quite common but now seems to be receding from society - the experience of making and fixing things with our hands. Those of us who sit in an office often feel a lack of connection to the material world, a sense of loss, and find it difficult to say exactly what we do all day. For those who felt hustled off to college, then to the cubicle, against their own inclinations and natural bents, Shop Class as Soulcraft seeks to restore the honor of the manual trades as a life worth choosing.\r\n\r\nOn both economic and psychological grounds, Crawford questions the educational imperative of turning everyone into a &quot;knowledge worker&quot;, based on a misguided separation of thinking from doing, the work of the hand from that of the mind. Crawford shows us how such a partition, which began a century ago with the assembly line, degrades work for those on both sides of the divide.\r\n\r\nBut Crawford offers good news as well: The manual trades are very different from the assembly line and from dumbed-down white collar work as well. They require careful thinking and are punctuated by moments of genuine pleasure. Based on his own experience as an electrician and mechanic, Crawford makes a case for the intrinsic satisfactions and cognitive challenges of manual work. The work of builders and mechanics is secure; it cannot be outsourced, and it cannot be made obsolete. Such work ties us to the local communities in which we live and instills the pride that comes from doing work that is genuinely useful.\r\n\r\nA wholly original debut, Shop Class as Soulcraft offers a passionate call for self-reliance and a moving reflection on how we can live concretely in an ever more abstract world.\r\n\r\nxx","last_updated":"2018-09-19T12:53:25.879Z","parsed":{"xt":"urn:btih:23adcbc90e36bd69ed50ad420256cde0dbefaba3","dn":"Shop Class as Soulcraft by Matthew B. Crawford EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"23adcbc90e36bd69ed50ad420256cde0dbefaba3","infoHashBuffer":{"type":"Buffer","data":[35,173,203,201,14,54,189,105,237,80,173,66,2,86,205,224,219,239,171,163]},"name":"Shop Class as Soulcraft by Matthew B. Crawford EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}