{"title":"Commander X - The Final Nail In Your Coffin! - A Pox To All Of M","magnet":"magnet:?xt=urn:btih:23fc6fc6efca9e7c3bcbd5c65890fb3133dac725&dn=Commander+X+-+The+Final+Nail+In+Your+Coffin%21+-+A+Pox+To+All+Of+M&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"roflcopter2110","categoryP":"other","categoryS":"e_books","size":"7036122","seeders":"16","leechers":"7","description":"Commander X - The Final Nail In Your Coffin! - A Pox To All Of Mankind - Morgellons And Red Mercury Plagues Created In NWO Labs Of Mad Scientists (2015) pdf\r\n <a href=\"\nhttps://extraimage.net/images/2018/08/18/4d35f118a4648f240dbbe88973be21f1.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://extraimage.net/images/2018/08/18/4d35f118a4648f240dbbe88973be21f1.jpg</a>\r\n\r\nGenre: Politics &amp; Social Sciences, Communication &amp; Media Studies, Diseases\r\nPublisher: Inner Light - Global Communications\r\nLanguage: English\r\nISBN-10: 1606111957\r\nISBN-13: 978-1606111956\r\nFormat: PDF\r\n\r\nIS GLOBAL GENOCIDE NEAR?\r\n\r\nA MAJOR PORTION OF THE WORLD&apos;S POPULATION COULD BE RAPIDLY EXTERMINATED BY AN INTERNATIONAL CABAL DETERMINED TO PUT A NAIL IN THE COFFIN OF HUMANKIND!\r\n\r\nTHE LETHAL &#x201C;MORGELLONS DISEASE&#x201D; OR A NUCLEAR ATTACK USING THE UNSTABLE SUBSTANCE &#x201C;RED MERCURY&#x201D; COULD PLACE YOU SIX FEET UNDER!\r\n\r\nEveryday life was already fraught with danger and uncertainty, but there are several new threats to your survival that you probably know nothing about.\r\n\r\nA disease called Morgellons exists that the medical community refuses to even acknowledge is real. If you experience the terrifying symptoms &#x2013; the sensation of bugs crawling beneath your skin, painful wounds that open up for no apparent reason and start to expel strange,cotton-like fibers &#x2013; don&#x2019;t expect your family physician to help you!\r\n\r\nEven the rich and famous get turned away with a diagnosis of mental, not physical illness. When folksinger, Joni Mitchell, was hospitalized for what was, at the time, an undisclosed reason, not even Joni was spared the stigma of having complained of Morgellons symptoms for which no cure was offered By medical professionals.\r\n\r\nThe former intelligence operative known only as Commander X has studied Morgellons keeping abreast of all the latest developments. Where did the disease originate?\r\n\r\nCommander X covers every angle, including the possibility that it entered the Earth zone by piggy backing on a meteorite. He also considers the notion that it is a man made disease being spread by the New World Order or some unidentified international cabal that is aided by a conspiracy of silence among the medical community.\r\n\r\nA MYSTERIOUS SUBSTANCE COULD WASTE HUMANITY IN A SINGLE BLOW!\r\n\r\nThe CIA says it doesn&apos;t exist. Terrorists and rogue nations have offered to pay millions of dollars to procure it. Scientists fear its lethal potential. Red Mercury when exploded creates tremendous heat and pressure sufficient to trigger a fusion device such a mini-neutron bomb. Red Mercury could be concealed in something as small as a lunch box yet have unimaginable lethal force when detonated","last_updated":"2018-08-18T12:08:43.020Z","parsed":{"xt":"urn:btih:23fc6fc6efca9e7c3bcbd5c65890fb3133dac725","dn":"Commander X - The Final Nail In Your Coffin! - A Pox To All Of M","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"23fc6fc6efca9e7c3bcbd5c65890fb3133dac725","infoHashBuffer":{"type":"Buffer","data":[35,252,111,198,239,202,158,124,59,203,213,198,88,144,251,49,51,218,199,37]},"name":"Commander X - The Final Nail In Your Coffin! - A Pox To All Of M","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}