{"title":"Two Americans by William Lee Miller EPUB","magnet":"magnet:?xt=urn:btih:245edf154f6f6d3f9916434c15c7ff5f624c5d0a&dn=Two+Americans+by+William+Lee+Miller+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2341325","seeders":"15","leechers":"5","description":"xx\r\n\r\nTwo Americans by William Lee Miller EPUB\r\n\r\nHarry Truman and Dwight Eisenhower, consecutive presidents of the United States, were Midwesterners alike in many ways - except that they also sharply differed.\r\n\r\nBorn within six years of each other (Truman in 1884, Eisenhower in 1890), they came from small towns in the Missouri-Mississippi River Valley - in the midst of cows and wheat, pigs and corn, and grain elevators. Both were grandsons of farmers and sons of forceful mothers, and of fathers who knew failure; both were lower middle class, received public-school educations, and were brought up in low-church Protestant denominations.\r\n\r\nWilliam Lee Miller interweaves Truman&apos;s and Eisenhower&apos;s life stories, which then also becomes the story of their nation as it rose to great power. They had contrasting experiences in the Great War - Truman, the haberdasher to be, led men in battle; Eisenhower, the supreme commander to be, did not. Between the wars, Truman was the quintessential politician, and Eisenhower the thoroughgoing anti-politician. Truman knew both the successes and woes of the public life, while Eisenhower was sequestered in the peacetime Army.\r\n\r\nThen, in the wartime 1940s, these two men were abruptly lifted above dozens of others to become leaders of the great national efforts. Miller describes the hostile maneuvering and bickering at the moment in 1952-53 when power was to be handed from one to the other and somebody had to decide which hat to wear and who greeted whom. As president, each coped with McCarthyism, the tormenting problems of race, and the great issues of the emerging Cold War. They brought the United States into a new pattern of world responsibility while being the first Americans to hold in their hands the awesome power of weapons capable of destroying civilization. Reading their story is a reminder of the modern American story, of ordinary men dealing with extraordinary power.\r\n\r\nxx","last_updated":"2018-06-03T12:01:08.872Z","parsed":{"xt":"urn:btih:245edf154f6f6d3f9916434c15c7ff5f624c5d0a","dn":"Two Americans by William Lee Miller EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"245edf154f6f6d3f9916434c15c7ff5f624c5d0a","infoHashBuffer":{"type":"Buffer","data":[36,94,223,21,79,111,109,63,153,22,67,76,21,199,255,95,98,76,93,10]},"name":"Two Americans by William Lee Miller EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}