{"title":"American General by John S. D. Eisenhower EPUB","magnet":"magnet:?xt=urn:btih:253ae3d827fa13ce95a388625ebd48b3eac220d5&dn=American+General+by+John+S.+D.+Eisenhower+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5930740","seeders":"26","leechers":"3","description":"xx\r\n\r\nAmerican General by John S. D. Eisenhower EPUB\r\n\r\nFrom respected historian John S. D. Eisenhower comes a surprising portrait of William Tecumseh Sherman, the Civil War general whose path of destruction cut the Confederacy in two, broke the will of the Southern population, and earned him a place in history as &quot;the first modern general&quot;. Yet behind his reputation as a fierce warrior was a sympathetic man of complex character. A century and a half after the Civil War, Sherman remains one of its most controversial figures - the soldier who brought the fight not only to the Confederate Army, but to Confederate civilians as well. Yet Eisenhower, a West Point graduate and a retired brigadier general (Army Reserves), finds in Sherman a man of startling contrasts, not at all defined by the implications of &quot;total war&quot;. His scruffy, disheveled appearance belied an unconventional and unyielding intellect. Intensely loyal to superior officers, especially Ulysses S. Grant, he was also a stalwart individualist. Confident enough to make demands face-to-face with President Lincoln, he sympathetically listened to the problems of newly freed slaves on his famed march from Atlanta to Savannah. Dubbed &quot;no soldier&quot; during his years at West Point, Sherman later rose to the rank of General of the Army, and though deeply committed to the Union cause, he held the people of the South in great affection. In this remarkable reassessment of Sherman&#x2019;s life and career, Eisenhower takes readers from Sherman&#x2019;s Ohio origins and his fledgling first stint in the Army, to his years as a businessman in California and his hurried return to uniform at the outbreak of the war. From Bull Run through Sherman&#x2019;s epic March to the Sea, Eisenhower offers up a fascinating narrative of a military genius whose influence helped preserve the Union - and forever changed war.\r\n\r\nxx","last_updated":"2018-06-13T12:06:13.495Z","parsed":{"xt":"urn:btih:253ae3d827fa13ce95a388625ebd48b3eac220d5","dn":"American General by John S. D. Eisenhower EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"253ae3d827fa13ce95a388625ebd48b3eac220d5","infoHashBuffer":{"type":"Buffer","data":[37,58,227,216,39,250,19,206,149,163,136,98,94,189,72,179,234,194,32,213]},"name":"American General by John S. D. Eisenhower EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}