{"title":"Ultimate Authors Guide Srs (#1-3) by Jackson Dean Chase (.epub)+","magnet":"magnet:?xt=urn:btih:253e1c14e00a9b53a9c47fd70459fa0a4c8bd2da&dn=Ultimate+Authors+Guide+Srs+%28%231-3%29+by+Jackson+Dean+Chase+%28.epub%29%2B&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"3582265","seeders":"13","leechers":"6","description":"Ultimate Authors Guide srs by Jackson Dean Chase (#1 - #3)\r\n\r\nRequirements: ePub/Mobi Reader, 861 KB / 1.0 MB / 1.3 MB\r\n\r\nGenre: Non-Fiction &gt; Educational\r\n\r\nOverview: \r\n\r\nJackson Dean Chase is a USA TODAY bestselling author and award-winning poet. His fiction has been praised as &quot;irresistible&quot; in Buzzfeed and &quot;diligently crafted&quot; in The Huffington Post. Jackson&apos;s books on writing fiction have helped thousands of authors.\r\n\r\n#1 - Writing Dynamite Story Hooks: A Masterclass in Genre Fiction and Memoir\r\nHow you start your story is the most important part of your book. From the first sentence, you need to know how to keep readers hooked. In this fun to read, fast to learn guide, USA TODAY bestselling author Jackson Dean Chase shows YOU how to write dynamite story hooks for novels, novellas, short stories, and memoirs. Step by step, line by line.\r\n\r\n#2 - Writing Heroes and Villains: A Masterclass in Genre Fiction\r\nBestselling authors know you must create amazing characters to hook readers. You can have the greatest plot in the world, but without equally great characters, readers won&apos;t care. It&apos;s not enough to have a great hero or great villain. You need a great supporting cast. Even your minor characters must shine.\r\n\r\nThis incredible, idea-packed book teaches you how to write dynamite characters for novels, novellas, short stories, and screenplays. This Fun, Easy Advice works regardless of genre, and regardless of whether you are an aspiring writer or seasoned professional.\r\n\r\n#3 - Writing Monsters and Maniacs: A Masterclass in Genre Fiction for Fantasy, Horror, and Science Fiction\r\nBestselling authors know you must create Incredible Monsters and Maniacs to hook readers. You can have the greatest plot in the world, but without equally great monsters and maniacs, readers won&apos;t care.\r\n\r\nThis book teaches you how to write dynamite monsters ands maniacs for novels, screenplays, comics, and role-playing games. This Fun, Easy Advice works for science fiction, fantasy, and horror, and regardless of whether you are an aspiring writer or seasoned professional. It also includes over 150 Plot Ideas and lists of magic, psychic, and supernatural powers!","last_updated":"2018-08-25T12:08:11.410Z","parsed":{"xt":"urn:btih:253e1c14e00a9b53a9c47fd70459fa0a4c8bd2da","dn":"Ultimate Authors Guide Srs (#1-3) by Jackson Dean Chase (.epub) ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"253e1c14e00a9b53a9c47fd70459fa0a4c8bd2da","infoHashBuffer":{"type":"Buffer","data":[37,62,28,20,224,10,155,83,169,196,127,215,4,89,250,10,76,139,210,218]},"name":"Ultimate Authors Guide Srs (#1-3) by Jackson Dean Chase (.epub) ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}