{"title":"A Sin Such as This","magnet":"magnet:?xt=urn:btih:258654bfae6d0ff824d59aea46bc69a860239c81&dn=A+Sin+Such+as+This&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"bookflare","categoryP":"other","categoryS":"e_books","size":"3515944","seeders":"1","leechers":"0","description":"Description\r\nIn this gripping follow-up to Love Lies Beneath, #1 New York Times bestselling author Ellen Hopkins&#x2019;s &#x201C;fabulous, sex-filled masterpiece of mystery and romance&#x201D;&#x9D; (Library Journal, starred review), beautiful, wealthy Tara Lattimore&#x2019;s story continues when her sinful past threatens to derail her current marriage-and her sanity.Tara thought she was finally settling down when she married the handsome Dr. Cavin Lattimore. Just as she was willing to overlook his gambling habits, she discovers his secret meetings with Sophia, his gorgeous ex-girlfriend and his son Eli&#x2019;s occasional girlfriend. Life gets even more complicated when Tara&#x2019;s niece, Kayla, starts hooking up with Eli. In a matter of weeks, Tara has reluctantly gone from rich, single San Francisco professional to Lake Tahoe housewife managing her niece&#x2019;s whiplash moods, while resisting her stepson&#x2019;s tantalizing sexual advances.Adding to the family drama is her younger sister, Melody, who&#x2019;s having a serious marital breakdown, which means she might know something about her husband Graham and Tara&#x2019;s brief dalliance years ago. As Tara&#x2019;s fragile trust in her family teeters, timed with the arrival of certain people from her past, she also can&#x2019;t shake the feeling that someone&#x2019;s watching her. Baiting her.\r\n\r\nTara has always considered herself a tough, self-made woman after surviving a childhood defined by poverty, abuse, and neglect. For years, she suffered from the sins of others. She committed a few of her own. Now she wonders if the misdeeds of her past are about to catch up with her-and if she can ever outrun them","last_updated":"2018-07-06T12:05:44.256Z","parsed":{"xt":"urn:btih:258654bfae6d0ff824d59aea46bc69a860239c81","dn":"A Sin Such as This","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"258654bfae6d0ff824d59aea46bc69a860239c81","infoHashBuffer":{"type":"Buffer","data":[37,134,84,191,174,109,15,248,36,213,154,234,70,188,105,168,96,35,156,129]},"name":"A Sin Such as This","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}