{"title":"The Contemporaries by Roger White AZW","magnet":"magnet:?xt=urn:btih:25a5cdc47a24c6eadd28b93005e538cb78db8e6f&dn=The+Contemporaries+by+Roger+White+AZW&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"1534033","seeders":"27","leechers":"7","description":"xx\r\n\r\nThe Contemporaries: Travels in the 21st-Century Art World by Roger White AZW\r\n\r\nIt&apos;s been nearly a century since Marcel Duchamp exhibited a urinal and called it art. Since then painting has been declared dead several times over, and contemporary art has now expanded to include just about any object, action, or event: dance routines, slideshows, functional hair salons, seemingly random accretions of waste. In the meantime being an artist has gone from a join-the-circus fantasy to a plausible vocation for scores of young people in America. But why - and how and by whom - does all this art get made? How is it evaluated? And for what, if anything, will today&apos;s artists be remembered?\r\n\r\nIn The Contemporaries, Roger White, himself a young painter, serves as our spirited, skeptical guide through this diffuse, creative world. White takes us into the halls of the RISD graduate program, where students learn critical lessons that go far beyond how to apply paint to canvases. In New York we meet the neophytes who assist established artists - and who walk the fine line between &quot;assistance&quot; and &quot;making the art&quot;. In Milwaukee White trails a group of friends trying to create a viable scene where rent is cheap but where the spotlight rarely shines. And he gives us an intimate perspective on three wildly different careers: that of Dana Schutz, an emerging star who is revitalizing painting; that of Mary Walling Blackburn, whose challenging art defies market forces; and that of Stephen Kaltenbach, a &apos;70s wunderkind who is back on the critical radar, perhaps in spite of his own willful obscurity.\r\n\r\nFrom young artists trying to elbow their way in to those working hard at dropping out, White&apos;s essential book offers a once-in-a-generation glimpse of the inner workings of the American art world at a moment of unparalleled ambition, uncertainty, and creative exuberance.\r\n\r\nxx","last_updated":"2018-07-02T12:14:19.861Z","parsed":{"xt":"urn:btih:25a5cdc47a24c6eadd28b93005e538cb78db8e6f","dn":"The Contemporaries by Roger White AZW","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"25a5cdc47a24c6eadd28b93005e538cb78db8e6f","infoHashBuffer":{"type":"Buffer","data":[37,165,205,196,122,36,198,234,221,40,185,48,5,229,56,203,120,219,142,111]},"name":"The Contemporaries by Roger White AZW","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}