{"title":"Artillery of the Warsaw Pact by Russell Phillips (.epub)","magnet":"magnet:?xt=urn:btih:25fd1194e135e0cd1a9bba478ce905af882e94c2&dn=Artillery+of+the+Warsaw+Pact+by+Russell+Phillips+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"6915773","seeders":"15","leechers":"5","description":"Artillery of the Warsaw Pact (Weapons and Equipment of the Warsaw Pact Volume 3) by Russell Phillips\r\n\r\nRequirements: .ePUB reader, 6.6 MB\r\n\r\nGenre: Non-Fiction &gt; History\r\n\r\nOverview: \r\n\r\nConsidered to be &#x201C;the god of modern war&#x201D; by the Soviet army, artillery played a vital role in the Cold War period. \r\n\r\nThe armies of the Warsaw Pact made artillery a cornerstone of their military strategies. And the importance they placed on this type of weaponry saw them use their technology and expertise to develop a wide range of munitions including mortars, rocket launchers, missiles and large-calibre guns. Artillery of the Warsaw Pact provides a compelling and detailed account of the artillery used by Warsaw Pact countries and the important role it played during this period of suspicion, tension and unease. The powerful weapons created at this time had the potential to destroy significant enemy resources, posing a very real threat to NATO forces. \r\n\r\nThis book will allow you to gain an insight into the way in which artillery was used by the Soviet Union and other Warsaw Pact nations. Read about mortars ranging from light 50mm weapons to enormous 240mm breech-loaded versions capable of destroying fortified buildings from a distance. Artillery of the Warsaw Pact also looks at the widespread use of towed guns as well as the growth in popularity of self-propelled guns. The book also details how Second World War weapons like multiple rocket launchers continued to play a key part in the Cold War hostilities, alongside newly-developed artillery, including tactical ballistic missiles which Khrushchev viewed as a critical part of his response to the threat posed by the United States","last_updated":"2018-08-25T12:07:36.970Z","parsed":{"xt":"urn:btih:25fd1194e135e0cd1a9bba478ce905af882e94c2","dn":"Artillery of the Warsaw Pact by Russell Phillips (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"25fd1194e135e0cd1a9bba478ce905af882e94c2","infoHashBuffer":{"type":"Buffer","data":[37,253,17,148,225,53,224,205,26,155,186,71,140,233,5,175,136,46,148,194]},"name":"Artillery of the Warsaw Pact by Russell Phillips (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}