{"title":"Retro Gamer Collection Vol.5 (Imagine Publishing 2011)","magnet":"magnet:?xt=urn:btih:26703152651aee26f12139bc8864dbe127609cc5&dn=Retro+Gamer+Collection+Vol.5+%28Imagine+Publishing+2011%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"fabioooo","categoryP":"other","categoryS":"e_books","size":"235450454","seeders":"1","leechers":"0","description":"This is the massive bookazine overload from the No.1 retro gaming magazine. It&apos;s been an utterly fantastic year for Retro Gamer, which has seen the magazine create some truly innovative covers, win a prestigious award for having the best videogame magazine in the UK and reveal even more fascinating insights into the world of retro gaming. In short they&apos;ve come an incredibly long way in the last five years.\r\n\r\nInside this unmissable bookazine you&apos;ll discover in-depth articles on some of the greatest games and franchises that the videogames industry has ever seen. You&apos;ll discover the origins of Ultimate&apos;s Sabreman, discover how Capcom created its cult hit Strider, learn the full history of Prince Of Persia and Lara Croft and get exhaustive, in-depth interviews with David Braben, Geoff Crammond and Activision co-founder David Crane.\r\nThe features are hand-picked by the editorial team to show off what they feel are some of the finest moments from 12 issues of the magazine, so you can guarantee that this essential 258-page tome will feature only the very best of the award-winning articles. The ultimate guide to classic videogaming. *Hardware History - An in-depth look into some of the best 8- and 16-bit consoles ever made.\r\n*Fantastic articles - Exhaustive guides on the best games and franchises, including huge histories on Sabreman and Prince of Persia. *Developer insight - Massive interviews with David Crane and other industry giants. *Making-of features - Behind the scenes of arcade hits, including Strider, Asteroids and Tapper. *Also inside - Burger Time - Combat - Quackshot - Repton - Pssst! - Stampede - Prince of Persia - Lara Croft - Excitebike - Sabre Man - Axelay - Monty On The Run And much more","last_updated":"2018-10-19T13:18:07.548Z","parsed":{"xt":"urn:btih:26703152651aee26f12139bc8864dbe127609cc5","dn":"Retro Gamer Collection Vol.5 (Imagine Publishing 2011)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"26703152651aee26f12139bc8864dbe127609cc5","infoHashBuffer":{"type":"Buffer","data":[38,112,49,82,101,26,238,38,241,33,57,188,136,100,219,225,39,96,156,197]},"name":"Retro Gamer Collection Vol.5 (Imagine Publishing 2011)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}