{"title":"Udemy - Python Programming Course","magnet":"magnet:?xt=urn:btih:269d6e7446134fa67f837595bddef4baafc50e63&dn=Udemy+-+Python+Programming+Course&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"tuts756","categoryP":"other","categoryS":"other","size":"387327301","seeders":"29","leechers":"31","description":"Description\r\n\r\nPython is important for software development. While there are more powerful languages (e.g. Lisp), faster languages (e.g. C), more used languages (e.g. Java), Python gets a lot of different things right, and right in a combination that no other language has done so far.\r\nIt&#x2019;s possible to write obfuscated code in Python, but the easiest way to write the code is almost always a way that is reasonable terse, and more importantly: code that clearly signals intent. If you know Python, you can work with almost any Python with little effort. Even libraries that add &#x201C;magic&#x201D; functionality can be written in perfectly readable Python (compare this to understanding the implementation of a framework such as Spring in Java).\r\nThis course acknowledges that speed of development is important. Readable and terse code is part of this, and so is access to powerful constructs that avoid tedious repetition of code. Maintainability also ties into this.\r\nThis course considers speed of development, the ease with which a programmer of other languages can pick up basic Python skills, and the huge standard library is key to another area where Python excels &#x2013; toolmaking. Any project of size will have tasks to automate, and automating them in Python is orders of magnitude faster than using more mainstream languages. We can create tools to extract information from ticket systems and presenting them in a way useful to the team, tools to check poms in a Maven project, Trac integration, custom monitoring tools&#x2026; and a whole lot more.\r\n\r\nGet trained on Python now to improve your productivity in coding software projects.\r\nWho is the target audience?\r\n    This course is for those who want to get started on Python Programming Language\r\n    Software engineers who want to improve their programming skills can also take this course\r\n\r\nRequirements\r\n    Know basics of math and programming","last_updated":"2018-05-01T12:12:40.523Z","parsed":{"xt":"urn:btih:269d6e7446134fa67f837595bddef4baafc50e63","dn":"Udemy - Python Programming Course","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"269d6e7446134fa67f837595bddef4baafc50e63","infoHashBuffer":{"type":"Buffer","data":[38,157,110,116,70,19,79,166,127,131,117,149,189,222,244,186,175,197,14,99]},"name":"Udemy - Python Programming Course","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}