{"title":"Hunting Hitler's Nukes","magnet":"magnet:?xt=urn:btih:26becb4cc56e6a523c288bb6e36097d3b8878e8e&dn=Hunting+Hitler%27s+Nukes&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"CopperSun","categoryP":"audio","categoryS":"audio_books","size":"292433440","seeders":"21","leechers":"4","description":"Hunting Hitler&apos;s Nukes: The Secret Race to Stop the Nazi Bomb \r\n\r\nBy Damien Lewis \r\n\r\n\r\n\r\nFrom the best-selling author of true military classics Zero Six Bravo, The Nazi Hunters and Churchill&apos;s Secret Warriors.\r\n\r\nIn the Spring of 1940, as Britain reeled from defeats on all fronts and America seemed frozen in isolation, one fear united the British and American leaders like no other: the Nazis had stolen a march on the Allies towards building the atomic bomb. So began the hunt for Hitler&apos;s nuclear weapons - nothing else came close in terms of priorities. It was to be the most secret war of those wars fought amongst the shadows. The highest stakes. The greatest odds.\r\n\r\nPrior to the outbreak of the war, the massive German chemicals conglomerate I. G. Farben - the future manufacturers of Zyklon B, the gas used in the Nazi concentration camps - had started producing bulk supplies of deuterium oxide - heavy water - at the remote Norwegian plant of Vemork.\r\n\r\nThis was the central target of three separate missions over the ensuing four years: Operations Grouse, Freshman and Gunnerside. As Churchill commented, &apos;The actual facts in many cases were equal to the most fantastic inventions of romance and melodrama. Tangle with tangle, plot and counterplot, ruse and treachery, cross and double-cross, true agent, false agent, double agent, gold and steel, the bomb, the dagger and the firing party were interwoven in a texture so intricate as to be incredible yet true.&apos;\r\n\r\nDamien Lewis&apos; new best seller intercuts the hunt for the scientists, the raw materials and the plant with the cloak-and-dagger intelligence game being played in the shadows. This relied in part on Enigma intercepts to guide the SOE&apos;s hand. Lewis delves into some of the most extraordinarily inventive and Machiavellian innovations at the SOE and their related research and training schools, whereby the enemy were tricked, deceived, framed, blackmailed and double- and triple-crossed, all in the name of stopping the Reich from getting the bomb","last_updated":"2018-09-08T12:24:27.351Z","parsed":{"xt":"urn:btih:26becb4cc56e6a523c288bb6e36097d3b8878e8e","dn":"Hunting Hitler's Nukes","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"26becb4cc56e6a523c288bb6e36097d3b8878e8e","infoHashBuffer":{"type":"Buffer","data":[38,190,203,76,197,110,106,82,60,40,139,182,227,96,151,211,184,135,142,142]},"name":"Hunting Hitler's Nukes","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}