{"title":"We Were Warriors by Johnny Mercer EPUB","magnet":"magnet:?xt=urn:btih:26d89329da2cde7a917e69a2cfc99936e07dbc43&dn=We+Were+Warriors+by+Johnny+Mercer+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"22982226","seeders":"0","leechers":"0","description":"xx\r\n\r\nWe Were Warriors by Johnny Mercer EPUB\r\n\r\nThe rounds were single shot from the same two enemy positions, trying to pick me off. They were kicking up the dirt around me. Then all hell broke loose as the gunship&apos;s Gatling vomited ammo right over my head. The sound was deafening. It was now or never. I got up and ran.\r\n\r\nA captain in 29 Commando, Johnny Mercer served in the army for 12 years. On his third tour of Afghanistan, he was a joint fires controller, with the pressurized job of bringing down artillery and air strikes in close proximity to his own troops. Based in an area of Northern Helmand that was riddled with Taliban leaders, he walked into danger with every patrol, determined to protect them. Then, one morning, in brutal close-quarter combat, everything changed....\r\n\r\nIn We Were Warriors, Johnny takes us from his commando training to the heat, blood and chaos of battle. With brutal honesty he describes what it is like to risk your life every day, pushing through the fear that follows watching your friends die. He took the fight back to the enemy with a relentless efficiency that came at a high personal cost. Back in the UK, seeing the inadequate care available for veterans and their families, he was inspired to run for Parliament in the hope he could improve their plight. Unflinching, action-packed and laced with wry humour, We Were Warriors is a compelling read.\r\n\r\nxx","last_updated":"2018-03-18T12:00:48.997Z","parsed":{"xt":"urn:btih:26d89329da2cde7a917e69a2cfc99936e07dbc43","dn":"We Were Warriors by Johnny Mercer EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"26d89329da2cde7a917e69a2cfc99936e07dbc43","infoHashBuffer":{"type":"Buffer","data":[38,216,147,41,218,44,222,122,145,126,105,162,207,201,153,54,224,125,188,67]},"name":"We Were Warriors by Johnny Mercer EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}