{"title":"Reclaiming Parkland by James DiEugenio EPUB","magnet":"magnet:?xt=urn:btih:2760fb4264bcf46f031e302df0903e495449ecc8&dn=Reclaiming+Parkland+by+James+DiEugenio+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"665765","seeders":"0","leechers":"0","description":"xx\r\n\r\nReclaiming Parkland: Tom Hanks, Vincent Bugliosi, and the JFK Assassination in the New Hollywood by James DiEugenio EPUB\r\n\r\nReclaiming Parkland details the failed attempt of Tom Hanks and Gary Goetzman - cofounder of the production company Playtone - to make Vincent Bugliosi&#x2019;s mammoth book about the Kennedy assassination, Reclaiming History, into a miniseries. It exposes the questionable origins of Reclaiming History in a dubious mock trial for cable television, in which Bugliosi played the role of an attorney prosecuting Lee Harvey Oswald for murder, and how this formed the basis for the epic tome. Author James DiEugenio details the myriad problems with Bugliosi&#x2019;s book, and explores the cooperation of the mainstream press in concealing these many faults during the publicity campaign for the book and how this lack of scrutiny led Hanks and Goetzman to purchase the film rights. DiEugenio then shows how the film eventually adapted from that book, entitled Parkland, does not even resemble Reclaiming History, though the script for that film displays the same imbalance that Reclaiming History does.\r\n\r\nReclaiming Parkland also includes extended looks at the little-known aspects of the lives and careers of Bugliosi, Hanks, and Goetzman - including Bugliosi&#x2019;s three attempts at political office and a review of the Tate-LaBianca murders in the light of today&#x2019;s knowledge of that case. DiEugenio also looks at the connections between Washington and Hollywood, as well as the CIA influence in the film colony today. Reclaiming Parkland is a truly unique book that delves into the Kennedy assassination, the New Hollywood, and the political influence on how films are made today.\r\n\r\nxx","last_updated":"2018-08-25T12:00:39.667Z","parsed":{"xt":"urn:btih:2760fb4264bcf46f031e302df0903e495449ecc8","dn":"Reclaiming Parkland by James DiEugenio EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2760fb4264bcf46f031e302df0903e495449ecc8","infoHashBuffer":{"type":"Buffer","data":[39,96,251,66,100,188,244,111,3,30,48,45,240,144,62,73,84,73,236,200]},"name":"Reclaiming Parkland by James DiEugenio EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}