{"title":"Hero Found by Bruce Henderson EPUB","magnet":"magnet:?xt=urn:btih:27a995897810f440bb1f36e61f1099ff509894f4&dn=Hero+Found+by+Bruce+Henderson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1289387","seeders":"0","leechers":"0","description":"xx\r\n\r\nHero Found by Bruce Henderson EPUB\r\n\r\nIn February 1966, U.S. Navy pilot Dieter Dengler was shot down over &quot;neutral Laos&quot;. He crashed deep in territory controlled by North Vietnamese army regulars and the communist Pathet Lao, who would eventually capture him and hold him prisoner in a fortified jungle prisoner-of-war camp.\r\n\r\nBut German-born Dengler was no ordinary prisoner. Already a legend in the Navy for his escape and evasion skills - amply demonstrated during training in the California desert - he would initiate, plan, and lead an organized escape from the POW camp, becoming the longest-held American to escape captivity during the Vietnam War.\r\n\r\nCaught in a most desperate situation, imprisoned not only by the enemy but by the jungle itself, Dengler&apos;s heroic impulse was to not only get himself out but to free all the other POWs - Americans, Thai, and Chinese - some of whom had been held for years. In a surreal scene of brotherhood and celebration, Dengler returned to his aircraft carrier, the USS Ranger, six months after being shot down - emaciated and ravaged with strange tropical illnesses, but very much alive and joyous to be so - only two weeks before the ship was due to leave the Gulf of Tonkin and return home.\r\n\r\nBruce Henderson served with Dengler aboard Ranger off the coast of Vietnam and here tells Dengler&apos;s complete story for the first time, drawing on extensive interviews with the intrepid pilot, his squadron mates, friends, and family, as well as declassified military archival materials, some now available for the first time, and personal letters and journals.\r\n\r\nHenderson&apos;s riveting account amply demonstrates why Dengler&apos;s story of unending optimism, innate courage, loyalty, and survival against overwhelming odds remains for his fellow flyers and shipmates the best and brightest memory of their generation&apos;s war.\r\n\r\nxx","last_updated":"2018-05-27T12:00:36.374Z","parsed":{"xt":"urn:btih:27a995897810f440bb1f36e61f1099ff509894f4","dn":"Hero Found by Bruce Henderson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"27a995897810f440bb1f36e61f1099ff509894f4","infoHashBuffer":{"type":"Buffer","data":[39,169,149,137,120,16,244,64,187,31,54,230,31,16,153,255,80,152,148,244]},"name":"Hero Found by Bruce Henderson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}