{"title":"Dean Koontz-The Crooked Staircase -The Bone Farm[audio]","magnet":"magnet:?xt=urn:btih:2826d95001b33d28e02ccae64b37808fd2751b91&dn=Dean+Koontz-The+Crooked+Staircase+-The+Bone+Farm%5Baudio%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"twocows","categoryP":"audio","categoryS":"audio_books","size":"254359865","seeders":"29","leechers":"10","description":" Dean Koontz-The Crooked Staircase \r\n\r\n\r\nJane Hawk knows she may be living on borrowed time. But as long as she&#x2019;s breathing, she&#x2019;ll never cease her one-woman war against the terrifying conspiracy that threatens the freedom&#x2014;and free will&#x2014;of millions. Battling the strange epidemic of murder-suicides that claimed Jane&#x2019;s husband, and is escalating across the country, has made the rogue FBI agent a wanted fugitive, relentlessly hunted not only by the government but by the secret cabal behind the plot. Deploying every resource their malign nexus of power and technology commands, Jane&#x2019;s enemies are determined to see her dead . . . or make her wish she was.Jane&#x2019;s ruthless pursuers can&#x2019;t stop her from drawing a bead on her prey: a cunning man with connections in high places, a twisted soul of unspeakable depths with an army of professional killers on call. \r\n\r\nThe Bone Farm\r\nAn audio original novella featuring bestselling author Dean Koontz&#x2019;s compelling new heroine, Jane Hawk. From the case files of the former FBI agent before she became the nation&#x2019;s most wanted fugitive - The Bone Farm details a desperate man-hunt for a serial killer before he murders again. Katherine Haskell, a young college co-ed is on her way back to school, but she never makes it there. Instead, she becomes the latest prey of the rapist and murderer dubbed by the tabloids the &#x201C;Mother Hater.&#x201D; He is a twisted soul who kidnaps young girls for pleasure then discards them. Katherine is missing, but she&#x2019;s not yet dead. FBI agents Jane Hawk and her partner Gary Burkett must descend into the hell of this killer&#x2019;s mind to solve the case before it is too late. The question is - will they both get out alive?","last_updated":"2018-05-12T12:11:00.467Z","parsed":{"xt":"urn:btih:2826d95001b33d28e02ccae64b37808fd2751b91","dn":"Dean Koontz-The Crooked Staircase -The Bone Farm[audio]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2826d95001b33d28e02ccae64b37808fd2751b91","infoHashBuffer":{"type":"Buffer","data":[40,38,217,80,1,179,61,40,224,44,202,230,75,55,128,143,210,117,27,145]},"name":"Dean Koontz-The Crooked Staircase -The Bone Farm[audio]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}