{"title":"GridinSoft Anti-Malware 4.0.4 Full With Medicine[BabuPC]","magnet":"magnet:?xt=urn:btih:28e4e67d28b863162c28c3702554b6aeb2a229d1&dn=GridinSoft+Anti-Malware+4.0.4+Full+With+Medicine%5BBabuPC%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BabuPC","categoryP":"applications","categoryS":"windows","size":"69910961","seeders":"1","leechers":"3","description":"GridinSoft Anti-Malware (formerly Trojan Killer) is an intuitive application that packs comprehensive features for detecting and eliminating Trojans, spyware, adware, rogue agents and other e-threats from your computer, mainly addressing professional users.\r\n\r\nGet thorough details on scanned files\r\nAn automatic scan for signature definitions is performed at startup, immediately followed by a computer scan.\r\nStatistics reveals total memory items, registry items and scanned files, along with detected Trojan infections. Log details show the name, virus type and targeted file path for each infected item. This report is automatically saved to a plain text document.\r\n\r\nMaking sure files are not left infected\r\nSome selections detected during the scan may require an in-depth analysis, so you can submit them for a thorough inspection. As for the remaining items, you can either remove them from the machine or mark them as false positives.\r\n\r\nVarious advanced options to manage\r\nPower users may tinker with settings to enable deep scan mode (slow but effective), terminate memory threats while scanning, disable heuristics rules, as well as to ignore suspicious packers, loaders, incomplete files, and files whose size surpasses 16Mb.\r\n\r\nIt is possible to disable logging, set GridinSoft Anti-Malware to autorun at startup, choose the program startup scan mode (standard, quick, full, removable), edit proxy parameters, and disable notification sounds.\r\n\r\nBrowse the Internet the safe way\r\nAnother notable feature is represented by a real-time scanner that prevents e-threats from infiltrating into your system. Extra tools let you reset browser settings, update policies and the Hosts file, scan Windows components (ActiveX, Windows services, IE extensions, startup links), collect system information and check out all GridinSoft Anti-Malware log files, plus the quarantine list","last_updated":"2018-07-22T12:05:09.840Z","parsed":{"xt":"urn:btih:28e4e67d28b863162c28c3702554b6aeb2a229d1","dn":"GridinSoft Anti-Malware 4.0.4 Full With Medicine[BabuPC]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"28e4e67d28b863162c28c3702554b6aeb2a229d1","infoHashBuffer":{"type":"Buffer","data":[40,228,230,125,40,184,99,22,44,40,195,112,37,84,182,174,178,162,41,209]},"name":"GridinSoft Anti-Malware 4.0.4 Full With Medicine[BabuPC]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}