{"title":"Memory Match [Match 3, Eng, 2018]","magnet":"magnet:?xt=urn:btih:2912d429af6f198ebdeeef9685cb3c29e1607ab0&dn=Memory+Match+%5BMatch+3%2C+Eng%2C+2018%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"games56","categoryP":"games","categoryS":"pc","size":"24630072","seeders":"5","leechers":"0","description":"A very colorful and interesting game that will help you train mindfulness. In the game nice gameplay, which consists of elements of the puzzle and clicker. You need to click on the same cards and defend candies from monsters. With each level, the game is very smoothly gaining complexity, thereby effectively developing the player&apos;s mindfulness.\r\nWe are glad to say that the game will be to liking by children and adults who like simple games where you need to look for the same pictures. Thus, it will be possible to combine the pleasant with the useful - to entertain and train your mind and mindfulness.\r\n\r\n* Pros of the game *\r\n- Colorful and interesting game for training mind and mindfulness\r\n- Suitable for all ages\r\n- For more fun, clicker elements are introduced\r\n- Many levels with smoothly increasing difficulty of the game\r\n- The game is free\r\n\r\nFor those who like to just play games, this game will also have to taste. In it, you can find the same cards and save coins for new weapons to fight with monsters.\r\n\r\nOn the gameplay:\r\n\r\nThe logical game begins with the field of cards 3 to 3, where you need to find 2 pairs of identical pictures. With each pair of pictures found, coins are given. Gradually with each level the game becomes more complicated - the first monsters appear, which slowly move to the box of sweets and the field of cards gradually grows, starting from 4 to 4, 5 to 5 and so on. The player can spend coins on weapons (sugar bat, rolling pin, frying pan, cookbook, etc.) in order to more effectively fight with monsters, which with each level become stronger.\r\nAs a result, the game can have a good time and develop your mind and mindfulness.\r\n\r\nSystem:\r\n\r\n&#x41E;&#x421;: Windows 7 +\r\nCPU: 1 Ghz\r\nRAM: 128 &#x43C;mb\r\nVRAM: 64 mb\r\nHDD: 105 mb","last_updated":"2018-01-27T12:13:20.266Z","parsed":{"xt":"urn:btih:2912d429af6f198ebdeeef9685cb3c29e1607ab0","dn":"Memory Match [Match 3, Eng, 2018]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2912d429af6f198ebdeeef9685cb3c29e1607ab0","infoHashBuffer":{"type":"Buffer","data":[41,18,212,41,175,111,25,142,189,238,239,150,133,203,60,41,225,96,122,176]},"name":"Memory Match [Match 3, Eng, 2018]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}