{"title":"The Graves Are Walking by John Kelly EPUB","magnet":"magnet:?xt=urn:btih:299e7dedbceb7b8c8c7d92a001182a7be63961bf&dn=The+Graves+Are+Walking+by+John+Kelly+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"1370508","seeders":"37","leechers":"3","description":"xx\r\n\r\nThe Graves Are Walking: The Great Famine and the Saga of the Irish People by John Kelly EPUB\r\n\r\nIt started in 1845 and lasted six years. Before it was over, more than one million men, women, and children starved to death and another million fled the country. Measured in terms of mortality, the Great Irish Potato Famine was one of the worst disasters in the 19th century-it claimed twice as many lives as the American Civil War. A perfect storm of bacterial infection, political greed, and religious intolerance sparked this catastrophe. But even more extraordinary than its scope were its political underpinnings, and The Graves Are Walking provides fresh material and analysis on the role that nineteenth-century evangelical Protestantism played in shaping British policies and on Britain&apos;s attempt to use the famine to reshape Irish society and character.\r\n\r\nPerhaps most important, this is ultimately a story of triumph over perceived destiny: for 50 million Americans of Irish heritage, the saga of a broken people fleeing crushing starvation and remaking themselves in a new land is an inspiring story of exoneration.\r\n\r\nBased on extensive research and written with novelistic flair, The Graves Are Walking draws a portrait that is both intimate and panoramic, that captures the drama of individual lives caught up in an unimaginable tragedy, while imparting a new understanding of the famine&apos;s causes and consequences.\r\n\r\nxx","last_updated":"2018-09-22T12:27:08.031Z","parsed":{"xt":"urn:btih:299e7dedbceb7b8c8c7d92a001182a7be63961bf","dn":"The Graves Are Walking by John Kelly EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"299e7dedbceb7b8c8c7d92a001182a7be63961bf","infoHashBuffer":{"type":"Buffer","data":[41,158,125,237,188,235,123,140,140,125,146,160,1,24,42,123,230,57,97,191]},"name":"The Graves Are Walking by John Kelly EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}