{"title":"The Language Of Kindness by Christie Watson (.epub)","magnet":"magnet:?xt=urn:btih:29e4d782fdb15495e907e8cc1436c32a6dd45ca2&dn=The+Language+Of+Kindness+by+Christie+Watson+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"879643","seeders":"0","leechers":"0","description":"The Language of Kindness: A Nurse&apos;s Story by Christie Watson\r\n\r\nRequirements: .ePUB reader, 0.86 MB\r\n\r\nGenre: Non-Fiction &gt; Biographies &amp; Memoirs\r\n\r\nOverview: \r\n\r\nA moving, lyrical, beautifully-written portrait of a nurse and the lives she has touched\r\n\r\nChristie Watson spent twenty years as a nurse, and in this intimate, poignant, and remarkably powerful book, she opens the doors of the hospital and shares its secrets. She takes us by her side down hospital corridors to visit the wards and meet her unforgettable patients. \r\n\r\nIn the neonatal unit, premature babies fight for their lives, hovering at the very edge of survival, like tiny Emmanuel, wrapped up in a sandwich bag. On the cancer wards, the nurses administer chemotherapy and, long after the medicine stops working, something more important&#x2013;which Watson learns to recognize when her own father is dying of cancer. In the pediatric intensive care unit, the nurses wash the hair of a little girl to remove the smell of smoke from the house fire. The emergency room is overcrowded as ever, with waves of alcohol and drug addicted patients as well as patients like Betty, a widow suffering chest pain, frail and alone. And the stories of the geriatric ward&#x2013;Gladys and older patients like her&#x2013;show the plight of the most vulnerable members of our society. \r\n\r\nThrough the smallest of actions, nurses provide vital care and kindness. All of us will experience illness in our lifetime, and we will all depend on the support and dignity that nurses offer us; yet the women and men who form the vanguard of our health care remain unsung. In this age of fear, hate, and division, Christie Watson has written a book that reminds us of all that we share, and of the urgency of compassion","last_updated":"2018-08-22T12:01:46.863Z","parsed":{"xt":"urn:btih:29e4d782fdb15495e907e8cc1436c32a6dd45ca2","dn":"The Language Of Kindness by Christie Watson (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"29e4d782fdb15495e907e8cc1436c32a6dd45ca2","infoHashBuffer":{"type":"Buffer","data":[41,228,215,130,253,177,84,149,233,7,232,204,20,54,195,42,109,212,92,162]},"name":"The Language Of Kindness by Christie Watson (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}