{"title":"Picasso and the Painting That Shocked the World by M. Unger EPUB","magnet":"magnet:?xt=urn:btih:2ad910a496049934a45e531e1a3bf87ba082e36f&dn=Picasso+and+the+Painting+That+Shocked+the+World+by+M.+Unger+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"50557624","seeders":"89","leechers":"16","description":"xx\r\n\r\nPicasso and the Painting That Shocked the World by M. Unger EPUB\r\n\r\nWhen Picasso became Picasso: the story of how an obscure young painter from Barcelona came to Paris and made himself into the most influential artist of the 20th century\r\n\r\nIn 1900, an 18-year-old Spaniard named Pablo Picasso made his first trip to Paris. It was in this glittering capital of the international art world that, after suffering years of poverty and neglect, he emerged as the leader of a bohemian band of painters, sculptors, and poets. Fueled by opium and alcohol, inspired by raucous late-night conversations at the Lapin Agile cabaret, Picasso and his friends resolved to shake up the world.\r\n\r\nFor most of these years Picasso lived and worked in a squalid tenement known as the Bateau Lavoir, in the heart of picturesque Montmartre. Here he met his first true love, Fernande Olivier, a muse whom he would transform in his art from Symbolist goddess to Cubist monster. These were years of struggle, often of desperation, but Picasso later looked back on them as the happiest of his long life.\r\n\r\nRecognition came slowly: first in the avant-garde circles in which he traveled, and later among a small group of daring collectors, including the Americans Leo and Gertrude Stein. In 1906, Picasso began the vast, disturbing masterpiece known as Les Demoiselles d&apos;Avignon. Inspired by the groundbreaking painting of Paul Cezanne and the startling inventiveness of African and tribal sculpture, Picasso created a work that captured and defined the disorienting experience of modernity itself. The painting proved so shocking that even his friends assumed he&apos;d gone mad. Only his colleague George Braque understood what Picasso was trying to do. Over the next few years they teamed up to create Cubism, the most revolutionary and influential movement in 20th-century art.\r\n\r\nThis is the story of an artistic genius with a singular creative gift. It is filled with heartbreak and triumph, despair and delirium, all of it played out against the backdrop of the world&apos;s most captivating city.\r\n\r\nxx","last_updated":"2018-04-10T17:57:28.357Z","parsed":{"xt":"urn:btih:2ad910a496049934a45e531e1a3bf87ba082e36f","dn":"Picasso and the Painting That Shocked the World by M. Unger EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2ad910a496049934a45e531e1a3bf87ba082e36f","infoHashBuffer":{"type":"Buffer","data":[42,217,16,164,150,4,153,52,164,94,83,30,26,59,248,123,160,130,227,111]},"name":"Picasso and the Painting That Shocked the World by M. Unger EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}