{"title":"Hippie Food by Jonathan Kauffman EPUB","magnet":"magnet:?xt=urn:btih:2cd30ae18d563dee49801a7a812a0173a030d33d&dn=Hippie+Food+by+Jonathan+Kauffman+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"496732","seeders":"41","leechers":"3","description":"xx\r\n\r\nHippie Food by Jonathan Kauffman EPUB\r\n\r\nAn enlightening narrative history - an entertaining fusion of Tom Wolfe and Michael Pollan - that traces the colorful origins of once unconventional foods and the diverse fringe movements, charismatic gurus, and counterculture elements that brought them to the mainstream and created a distinctly American cuisine.\r\n\r\nFood writer Jonathan Kauffman journeys back more than half a century - to the 1960s and 1970s - to tell the story of how a coterie of unusual men and women embraced an alternative lifestyle that would ultimately change how modern Americans eat. Impeccably researched, Hippie Food chronicles how the longhairs, revolutionaries, and back-to-the-landers rejected the square establishment of President Richard Nixon&apos;s America and turned to a more idealistic and wholesome communal way of life and food.\r\n\r\nFrom the mystical rock-and-roll cult known as the Source Family and its legendary vegetarian restaurant in Hollywood to the Diggers&apos; brown bread in the Summer of Love to the rise of the co-op and the origins of the organic food craze, Kauffman reveals how today&apos;s quotidian whole-foods staples - including sprouts, tofu, yogurt, brown rice, and whole-grain bread - were introduced and eventually became part of our diets. From coast to coast, through Oregon, Texas, Tennessee, Minnesota, Michigan, Massachusetts, and Vermont, Kauffman tracks hippie food&apos;s journey from niche oddity to a cuisine that hit every corner of this country.\r\n\r\nA slick mix of gonzo playfulness, evocative detail, skillful pacing, and elegant writing, Hippie Food is a lively, engaging, and informative read that deepens our understanding of our culture and our lives today.\r\n\r\nxx","last_updated":"2018-01-25T12:09:54.648Z","parsed":{"xt":"urn:btih:2cd30ae18d563dee49801a7a812a0173a030d33d","dn":"Hippie Food by Jonathan Kauffman EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2cd30ae18d563dee49801a7a812a0173a030d33d","infoHashBuffer":{"type":"Buffer","data":[44,211,10,225,141,86,61,238,73,128,26,122,129,42,1,115,160,48,211,61]},"name":"Hippie Food by Jonathan Kauffman EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}