{"title":"First Women by Kate Andersen Brower MOBI","magnet":"magnet:?xt=urn:btih:2e594dec7affb7573263b85938845f84216dc1b5&dn=First+Women+by+Kate+Andersen+Brower+MOBI&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3170644","seeders":"10","leechers":"8","description":"xx\r\n\r\nFirst Women by Kate Andersen Brower MOBI\r\n\r\nFrom the number-one New York Times best-selling author of the groundbreaking backstairs look at the White House The Residence comes an intimate, news-making look at the true modern power brokers at 1600 Pennsylvania Avenue: the first ladies, from Jackie Kennedy to Michelle Obama.\r\n\r\nIn one of the most underestimated - and challenging - positions in the world, the first lady of the United States must be many things: an inspiring leader with a forward-thinking agenda of her own; a savvy politician, skilled at navigating the treacherous rapids of Washington; a wife and mother operating under constant scrutiny; and an able CEO responsible for the smooth operation of countless services and special events at the White House.\r\n\r\nNow, as she did in her smash number-one best seller The Residence, former White House correspondent Kate Andersen Brower draws on a wide array of untapped, candid sources - from residence staff and social secretaries to friends and political advisers - to tell the stories of the 10 remarkable women who have defined that role since 1960.\r\n\r\nBrower offers new insights into this privileged group of remarkable women, including Jacqueline Kennedy, Lady Bird Johnson, Patricia Nixon, Betty Ford, Rosalynn Carter, Nancy Reagan, Barbara Bush, Hillary Clinton, Laura Bush, and Michelle Obama. The stories she shares range from the heartwarming to the shocking and tragic, exploring everything from the first ladies&apos; political crusades to their rivalries with Washington figures; from their friendships with other first ladies to their public and private relationships with their husbands. She also offers a detailed and insightful new portrait of one of the most-watched first ladies of all time, Hillary Clinton, asking what her tumultuous years in the White House may tell us about her own historic presidential run...and what life could be like with the nation&apos;s first first husband.\r\n\r\nCandid and illuminating, this first group biography of the modern first ladies provides a revealing look at life upstairs and downstairs at the world&apos;s most powerful address.\r\n\r\nxx","last_updated":"2018-01-27T12:04:51.416Z","parsed":{"xt":"urn:btih:2e594dec7affb7573263b85938845f84216dc1b5","dn":"First Women by Kate Andersen Brower MOBI","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2e594dec7affb7573263b85938845f84216dc1b5","infoHashBuffer":{"type":"Buffer","data":[46,89,77,236,122,255,183,87,50,99,184,89,56,132,95,132,33,109,193,181]},"name":"First Women by Kate Andersen Brower MOBI","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}