{"title":"Fatal Discord by Michael Massing EPUB","magnet":"magnet:?xt=urn:btih:2fb433771ea5a342fef2554d5c41781e187751b7&dn=Fatal+Discord+by+Michael+Massing+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3915687","seeders":"0","leechers":"0","description":"xx\r\n\r\nFatal Discord by Michael Massing EPUB\r\n\r\nA deeply textured dual biography and fascinating intellectual history that examines two of the greatest minds of European history - Desiderius Erasmus and Martin Luther - whose heated rivalry gave rise to two enduring, fundamental, and often colliding traditions of philosophical and religious thought. \r\n\r\nErasmus of Rotterdam was the leading figure of the Northern Renaissance. At a time when Leonardo, Michelangelo, and Raphael were revolutionizing Western art and culture, Erasmus was helping to transform Europe&apos;s intellectual and religious life, developing a new design for living for a continent rebelling against the hierarchical constraints of the Roman Church. When in 1516 he came out with a revised edition of the New Testament based on the original Greek, he was hailed as the prophet of a new enlightened age. Today, however, Erasmus is largely forgotten, and the reason can be summed up in two words: Martin Luther. As a young friar in remote Wittenberg, Luther was initially a great admirer of Erasmus and his critique of the Catholic Church, but while Erasmus sought to reform that institution from within, Luther wanted a more radical transformation. Eventually, the differences between them flared into a bitter rivalry, with each trying to win over Europe to his vision. \r\n\r\nIn Fatal Discord, Michael Massing seeks to restore Erasmus to his proper place in the Western tradition. The conflict between him and Luther, he argues, forms a fault line in Western thinking - the moment when two enduring schools of thought, Christian humanism and evangelical Christianity, took shape. A seasoned journalist who has reported from many countries, Massing here travels back to the early 16th century to recover a long-neglected chapter of Western intellectual life, in which the introduction of new ways of reading the Bible set loose social and cultural forces that helped shatter the millennial unity of Christendom and whose echoes can still be heard today. Massing concludes that Europe has adopted a form of Erasmian humanism while America has been shaped by Luther-inspired individualism. \r\n\r\nxx","last_updated":"2018-05-10T12:02:17.856Z","parsed":{"xt":"urn:btih:2fb433771ea5a342fef2554d5c41781e187751b7","dn":"Fatal Discord by Michael Massing EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2fb433771ea5a342fef2554d5c41781e187751b7","infoHashBuffer":{"type":"Buffer","data":[47,180,51,119,30,165,163,66,254,242,85,77,92,65,120,30,24,119,81,183]},"name":"Fatal Discord by Michael Massing EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}