{"title":"The Last Thousand Days of the British Empire by Peter Clarke MOB","magnet":"magnet:?xt=urn:btih:304d17af6801ced71c7ce0c6333792f5b3ed49ae&dn=The+Last+Thousand+Days+of+the+British+Empire+by+Peter+Clarke+MOB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2331953","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Last Thousand Days of the British Empire by Peter Clarke MOBI\r\n\r\nA sweeping, brilliantly vivid history of the sudden end of the British Empire and the moment when America became a world superpower, published on the 60th anniversary of Britain&apos;s withdrawal from Palestine.\r\n\r\n&quot;I have not become the King&apos;s First Minister in order to preside over the liquidation of the British Empire.&quot; Winston Churchill&apos;s famous statement in November 1942, just as the tide of the Second World War was beginning to turn, pugnaciously affirmed his loyalty to the worldwide institution that he had served for most of his life. Britain fought and sacrificed on a global scale to defeat Hitler and his allies, and won. Yet less than five years after Churchill&apos;s defiant speech, the British Empire effectively ended with Indian independence in August 1947 and the end of the British Mandate in Palestine in May 1948. As the sun set on Britain&apos;s empire, the age of America as world superpower dawned.\r\n\r\nHow did this rapid change of fortune come about? Peter Clarke&apos;s book is the first to analyze the abrupt transition from Rule Britannia to Pax Americana. His swift-paced narrative makes superb use of letters and diaries to provide vivid portraits of the figures around whom history pivoted: Churchill, Gandhi, Roosevelt, Stalin, Truman, and a host of lesser-known figures through whom Clarke brilliantly shows the human dimension of epochal events. Clarke traces the intimate and conflicted nature of the special relationship, showing how Roosevelt and his successors were determined that Britain must be sustained both during the war and after, but that the British Empire must not; and reveals how the tension between Allied war aims, suppressed while the fighting was going on, became rapidly apparent when it ended.\r\n\r\nThe Last Thousand Days of the British Empire is a captivating work of popular history that shows how the events that followed the war reshaped the world as profoundly as the conflict itself.\r\n\r\nxx","last_updated":"2018-03-26T12:01:06.742Z","parsed":{"xt":"urn:btih:304d17af6801ced71c7ce0c6333792f5b3ed49ae","dn":"The Last Thousand Days of the British Empire by Peter Clarke MOB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"304d17af6801ced71c7ce0c6333792f5b3ed49ae","infoHashBuffer":{"type":"Buffer","data":[48,77,23,175,104,1,206,215,28,124,224,198,51,55,146,245,179,237,73,174]},"name":"The Last Thousand Days of the British Empire by Peter Clarke MOB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}