{"title":"Whatever You Say I Am by Anthony Bozza EPUB","magnet":"magnet:?xt=urn:btih:30a8971d63691411984a03d05885588652a0cd3d&dn=Whatever+You+Say+I+Am+by+Anthony+Bozza+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6094023","seeders":"23","leechers":"6","description":"xx\r\n\r\nWhatever You Say I Am by Anthony Bozza EPUB\r\n\r\nOn assignment for his first cover story for Rolling Stone, the very first national cover story on Eminem, Anthony Bozza met a young blond kid, a rapper who would soon take the country by storm. But back in 1999, Eminem was just beginning to make waves among suburban white teenagers as his first single, &quot;My Name Is,&quot; went into heavy rotation on MTV.\r\n\r\nWho could have predicted that in a mere two years, Eminem would become the most reviled and controversial hip-hop figure ever? Or that twelve months after that, Eminem would sit firmly at the pinnacle of American celebrity, a Grammy winner many times over and the recipient of an Oscar?\r\n\r\nSince their first meeting, Bozza has been given a level of access to Eminem that no other journalist has enjoyed. In Whatever You Say I Am, never-before-published excerpts from Bozza&apos;s interviews with Eminem are combined with the insight of hip-hop figures, music critics and journalists to look behind the mask of this enigmatic celebrity. With an eye toward Eminem&apos;s place in American popular culture, Bozza creates a thoughtful portrait of one of the most successful artists of our time. This is more than a biography of a thoroughly well-documented life. It is a close-up look at a conflicted figure who has somehow spoken to the heart of America.\r\n\r\nxx","last_updated":"2018-06-08T12:14:46.558Z","parsed":{"xt":"urn:btih:30a8971d63691411984a03d05885588652a0cd3d","dn":"Whatever You Say I Am by Anthony Bozza EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"30a8971d63691411984a03d05885588652a0cd3d","infoHashBuffer":{"type":"Buffer","data":[48,168,151,29,99,105,20,17,152,74,3,208,88,133,88,134,82,160,205,61]},"name":"Whatever You Say I Am by Anthony Bozza EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}