{"title":"The Book of Genesis: a Biography by Ronald Hendel (.pdf)","magnet":"magnet:?xt=urn:btih:30addd4c81315f0a50eeb0473654e39f7d7c691c&dn=The+Book+of+Genesis%3A+a+Biography+by+Ronald+Hendel+%28.pdf%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"3176780","seeders":"20","leechers":"10","description":"The Book of Genesis: A Biography by Ronald Hendel\r\n\r\nRequirements: .PDF reader, 3 Mb\r\n\r\nGenre: Non-Fiction &gt; Faith, Beliefs &amp; Philosophy\r\n\r\nOverview: \r\n\r\nDuring its 2,500-year life, the book of Genesis has been the keystone to almost every important claim about reality, humanity, and God in Judaism and Christianity. And it continues to play a central role in debates about science, politics, and human rights. With clarity and skill, acclaimed biblical scholar Ronald Hendel provides a panoramic history of this iconic book, exploring its impact on Western religion, philosophy, science, politics, literature, and more. \r\n\r\nHendel traces how Genesis has shaped views of reality, and how changing views of reality have shaped interpretations of Genesis. Literal and figurative readings have long competed with each other. Hendel tells how Luther&apos;s criticisms of traditional figurative accounts of Genesis undermined the Catholic Church; how Galileo made the radical argument that the cosmology of Genesis wasn&apos;t scientific evidence; and how Spinoza made the equally radical argument that the scientific method should be applied to Genesis itself. Indeed, Hendel shows how many high points of Western thought and art have taken the form of encounters with Genesis--from Paul and Augustine to Darwin, Emily Dickinson, and Kafka. \r\n\r\nFrom debates about slavery, gender, and sexuality to the struggles over creationism and evolution, Genesis has shaped our world and continues to do so today. This wide-ranging account tells the remarkable story of the life of Genesis like no other book","last_updated":"2018-08-25T12:07:20.620Z","parsed":{"xt":"urn:btih:30addd4c81315f0a50eeb0473654e39f7d7c691c","dn":"The Book of Genesis: a Biography by Ronald Hendel (.pdf)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"30addd4c81315f0a50eeb0473654e39f7d7c691c","infoHashBuffer":{"type":"Buffer","data":[48,173,221,76,129,49,95,10,80,238,176,71,54,84,227,159,125,124,105,28]},"name":"The Book of Genesis: a Biography by Ronald Hendel (.pdf)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}