{"title":"Target Patton by Robert K. Wilcox (.epub)+","magnet":"magnet:?xt=urn:btih:31db4b46e1873c41badcd6fc89f241557249bb39&dn=Target+Patton+by+Robert+K.+Wilcox+%28.epub%29%2B&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"1374335","seeders":"25","leechers":"7","description":"Target Patton: The Plot to Assassinate General George S. Patton by Robert K. Wilcox \r\n\r\nRequirements: .ePUB .MOBI Reader | 1.1 MB\r\n\r\nGenre:Non Fiction History \r\n\r\nOverview: \r\n\r\nIn his meticulously researched book, Wilcox offers a different perspective on the well-known events of World War II. The author walks readers through that fateful December day in 1945 and outlines the plan to murder General Patton.\r\nThe death of General George S. Patton is shrouded in mystery. While officially the result of an unfortunate car accident, the evidence points to a far more malevolent plot: murder. So says investigative and military journalist Robert K. Wilcox in his book: &quot;Target: Patton: The Plot to Assassinate General George S. Patton.&quot; Written like a WWII spy thriller and meticulously researched, &quot;Target: Patton&quot; leads you through that fateful December day in 1945, revealing a chilling plan to assassinate General Patton. Backing up this shocking story with facts, photos, and eyewitness statements, Wilcox reveals long-hidden documents and accounts that explain how secrets Patton knew--and his strong anti-Soviet views--may have cost him his life. Not only does Wilcox reveal how, why, and when, he also names names--exposing little-known stories and secrets of such key players as General &quot;Wild Bill&quot; Donovan, the storied head of the OSS (the predecessor to the CIA); an OSS assassin; an Army intelligence agent; and even Josef Stalin himself. &quot;Target: Patton&quot; challenges readers to look at the evidence and question the conventional wisdom. After reading it, few will think of General Patton--or the circumstances surrounding his death--in the same way again","last_updated":"2018-09-02T12:13:57.653Z","parsed":{"xt":"urn:btih:31db4b46e1873c41badcd6fc89f241557249bb39","dn":"Target Patton by Robert K. Wilcox (.epub) ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"31db4b46e1873c41badcd6fc89f241557249bb39","infoHashBuffer":{"type":"Buffer","data":[49,219,75,70,225,135,60,65,186,220,214,252,137,242,65,85,114,73,187,57]},"name":"Target Patton by Robert K. Wilcox (.epub) ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}