{"title":"How the Post Office Created America by Winifred Gallagher EPUB","magnet":"magnet:?xt=urn:btih:31ddc691d9d0724132f09768bfac8564613cfd8d&dn=How+the+Post+Office+Created+America+by+Winifred+Gallagher+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"13190716","seeders":"0","leechers":"0","description":"xx\r\n\r\nHow the Post Office Created America: A History by Winifred Gallagher EPUB\r\n\r\nA masterful history of a long underappreciated institution, How the Post Office Created America examines the surprising role of the postal service in our nation&apos;s political, social, economic, and physical development.\r\n\r\nThe founders established the Post Office before they had even signed the Declaration of Independence, and for a very long time it was the US government&apos;s largest and most important endeavor - indeed, it was the government for most citizens. This was no conventional mail network but the central nervous system of the new body politic, designed to bind 13 quarrelsome colonies into the United States by delivering news about public affairs to every citizen - a radical idea that appalled Europe&apos;s great powers. America&apos;s uniquely democratic post powerfully shaped its lively, argumentative culture of uncensored ideas and opinions and made it the world&apos;s information and communications superpower with astonishing speed.\r\n\r\nWinifred Gallagher presents the history of the Post Office as America&apos;s own story, told from a fresh perspective over more than two centuries. The mandate to deliver the mail - then &quot;the media&quot; - imposed the federal footprint on vast, often contested parts of the continent and transformed a wilderness into a social landscape of post roads and villages centered on post offices. The post was the catalyst of the nation&apos;s transportation grid, from the stagecoach lines to the airlines, and the lifeline of the great migration from the Atlantic to the Pacific. It enabled America to shift from an agrarian to an industrial economy and to develop the publishing industry, consumer culture, and the political party system. Still one of the country&apos;s two major civilian employers, the post was the first to hire women, African Americans, and other minorities for positions in public life.\r\n\r\nStarved by two world wars and the Great Depression, confronted with the country&apos;s increasingly anti-institutional mind-set, and struggling with its doubled mail volume, the post stumbled badly in the turbulent 1960s. Distracted by the ensuing modernization of its traditional services, however, it failed to transition from paper mail to email, which prescient observers saw as its logical next step. Now the Post Office is at a crossroads. Before deciding its future, Americans should understand what this grand yet overlooked institution has accomplished since 1775 and consider what it should and could contribute in the 21st century.\r\n\r\nGallagher argues that now, more than ever before, the imperiled Post Office deserves this effort, because just as the founders anticipated, it created forward-looking, communication-oriented, idea-driven America.\r\n\r\nxx","last_updated":"2018-09-26T12:04:11.837Z","parsed":{"xt":"urn:btih:31ddc691d9d0724132f09768bfac8564613cfd8d","dn":"How the Post Office Created America by Winifred Gallagher EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"31ddc691d9d0724132f09768bfac8564613cfd8d","infoHashBuffer":{"type":"Buffer","data":[49,221,198,145,217,208,114,65,50,240,151,104,191,172,133,100,97,60,253,141]},"name":"How the Post Office Created America by Winifred Gallagher EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}