{"title":"Eine Frau (A Woman) in Berlin (2008) 1080p H.264 (moviesbyrizzo)","magnet":"magnet:?xt=urn:btih:3243971f0a3e935349e1d3918b7f8d7c32b497bc&dn=Eine+Frau+%28A+Woman%29+in+Berlin+%282008%29+1080p+H.264+%28moviesbyrizzo%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"moviesbyrizzo","categoryP":"video","categoryS":"hd___movies","size":"4386838688","seeders":"0","leechers":"0","description":" <a href=\"https://www.imdb.com/title/tt1035730/\" rel=\"nofollow\" target=\"_NEW\">https://www.imdb.com/title/tt1035730/</a> \r\n\r\nFull 1920 X 1080 resolution H.264 video at fully 4000k video bitrate 448k Dolby AC3 6 channel audio in spoken languages including both (mainly German) along with Russian \r\n\r\n(please note we have hard coded the previous title  &quot;A Woman in Berlin - Eine Frau in Berlin&quot; at approx 23 seconds from the movie start time as the title has been changed to &quot;The downfall of Berlin&quot; in the version of the disc we got \r\nfrom the US as our German supplier didn&apos;t want to ship this title to Canada for some godforsaken reason it seems. \r\n\r\nSubtitles could not be found on the net for this title for neither Italian or Swedish (amongst others) Whats included for subs this time around are for Danish Dutch English (template ripped from the blu-ray disc) Finnish Hungarian Polish Portuguese-Brazil) Romanian and Spanish - kindly check the net for more - just about any blu-ray version should fit I should think although some will require adjustment by a second or so we found. \r\n\r\nStars the lovely German actress Ms. Nina Hoss (also stars in Jerichow - a movie about involvement with a Turkish man in Germany) \r\n\r\nThis movie is about the brutal invasion and utter destruction of the city of Berlin by allied forces (The Russians mainly) in a move to completely destroy the German spirit and wreak havoc among its population and infrastucture even after \r\nthe end of the war was already at hand and the madman from Austria (Adolph Hitler) no longer a threat.. \r\n\r\nThe movie depicts the abuse of German women (including being mistreated to the point of rape in certain instances as we see in this movie horribly played out). \r\n\r\nNever again will the spirit of the women of Germany (wherever they might be on the planet) be assailed in this manner on this planet - Never again - as no civilized man of related spirit stand for it ever again - of this you can be certain \r\nI am sure and believe with all my heart indeed - amen to that brother \r\n\r\nKindly seed \r\n\r\nMichael Rizzo Chessman \r\n(moviesbyrizzo)","last_updated":"2018-06-28T12:01:22.323Z","parsed":{"xt":"urn:btih:3243971f0a3e935349e1d3918b7f8d7c32b497bc","dn":"Eine Frau (A Woman) in Berlin (2008) 1080p H.264 (moviesbyrizzo)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3243971f0a3e935349e1d3918b7f8d7c32b497bc","infoHashBuffer":{"type":"Buffer","data":[50,67,151,31,10,62,147,83,73,225,211,145,139,127,141,124,50,180,151,188]},"name":"Eine Frau (A Woman) in Berlin (2008) 1080p H.264 (moviesbyrizzo)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}