{"title":"Gabriela (2012) 720p - Season 1 ","magnet":"magnet:?xt=urn:btih:32840ab5a48aaadc1465505c1a053f8a61eeb403&dn=Gabriela+%282012%29+720p+-+Season+1+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"sladyrko","categoryP":"video","categoryS":"hd___tv_shows","size":"12843613261","seeders":"1","leechers":"9","description":"IMPORTANT: Keep seeding after download! Don&apos;t be an assh*le!\r\n\r\nPlot:\r\n\r\nNa&#xEF;ve and provocative Gabriela is a raggedy migrant worker who arrives in town to mesmerize all with her playful and simple, yet raw sensuality. Set in 1925, the story unravels in Ilh&#xE9;us, a quiet northeastern coastal city thriving with cocoa crops and aspirations for progress, even though the traditional ways still rule. Fleeing the drought from the Brazilian backlands, gorgeous Gabriela fascinates everyone with her beauty. At first unaware of the ardent love that will grow between them, Nacib, a Turkish immigrant who owns the Vesuvio bar, hires Gabriela (played by Juliana Paes &#x2013; India, A Love Story) to cook at his establishment. She waits on the Colonels whose political powers dictate the gossip ridden town. But Gabriela&#x2019;s irresistible beauty and earthy sensuality continue to unintentionally trigger every man&#x2019;s lustful desire, driving Nacib to the brink of jealous insanity. He realizes he cannot live without her, and when he finds out his burning passion is mutual, Nacib asks Gabriela to marry him. Gabriela accepts his proposal, much to the dismay of the colonels who long for her. When they aren&#x2019;t hanging out at Nacib&#x2019;s bar drinking, the colonels are either oppressing their wives and daughters or spending money at Bataclan, the opulent local brothel. Most men in town converge there to be entertained by scantily clad, chic local prostitutes. Colonel Ramiro Bastos has the last word when it comes to keeping the town conservative. But new arrival Mundinho Falc&#xE3;o, a handsome young liberalist who challenges the colonels&#x2019; imposed control, falls madly in love with Colonel Basto&#x2019;s granddaughter, Gerusa. The young couple will have to stand up to her grandfather, the most powerful man in town, in order to stay together. Meanwhile, Gabriela and Nacib will have to face up to the conspiracy of those who wish to break them up. Zarolha, a bitter and heart-broken Bataclan prostitute, struggles to win back Nacib&#x2019;s tenderness. She counts on the help of self-seeking Tonico, Nacib&#x2019;s new so-called friend who secretly pants after Gabriela, and together they plot against the couple. He influences Nacib to bind Gabriela to the social norms that oppose her free nature, unleashing unpredictable consequences. Gabriela&#x2019;s impulsive, unbound spontaneity contrasts with the false morals defined by a society filled with various gossipy, humorous, na&#xEF;ve, seductive, amusing, and mysterious characters. Gabriela&#x2019;s torrid presence in town disturbs the traditional ways and implicit inclinations of the townspeople. In a new version of one of TV&apos;s greatest hits, based on the immortal literary work of Jorge Amado, Gabriela renders a vivid portrayal of a steamy love story that incites everyone to tune in to their own inherent desires","last_updated":"2018-05-21T12:08:15.585Z","parsed":{"xt":"urn:btih:32840ab5a48aaadc1465505c1a053f8a61eeb403","dn":"Gabriela (2012) 720p - Season 1 ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"32840ab5a48aaadc1465505c1a053f8a61eeb403","infoHashBuffer":{"type":"Buffer","data":[50,132,10,181,164,138,170,220,20,101,80,92,26,5,63,138,97,238,180,3]},"name":"Gabriela (2012) 720p - Season 1 ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}