{"title":"Yanni.The Dream Concert.Live from the Great Pyramids of Egypt","magnet":"magnet:?xt=urn:btih:32bff3b2c1cd0366f5f669c85c273f5dc89b5751&dn=Yanni.The+Dream+Concert.Live+from+the+Great+Pyramids+of+Egypt&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"metheguy","categoryP":"video","categoryS":"hd___movies","size":"1833553513","seeders":"9","leechers":"19","description":"Yanni: The Dream Concert Live from the Great Pyramids of Egypt features a career spanning selection of fan favorites, along with never before performed songs and new arrangements of his classic compositions, available as a CD/DVD combo and as a stand-alone Blu-ray release. The No. 1 selling composer, producer, multi-instrumentalist and global superstar, Yanni has performed his distinctive music in exotic and historic locations all across the world. From his groundbreaking concert at the Acropolis to his most recent televised performance at El Morro, Puerto Rico, Yanni has pushed the boundaries of the way audiences experience live music. With The Dream Concert, Yanni has realized his life-long dream to perform at the foot of the Sphinx and the Great Pyramids of Egypt, the last of the Seven Wonders of the Ancient World that remains today. For their pledge period in March, PBS will air The Dream Concert Live from the Great Pyramids of Egypt nationwide.\r\n\r\nYanni holds the record for most No. 1 s in Billboard s New Age category, racking up 40+ platinum and gold albums with sales in excess of 25 million. Truly a global artist, he has performed on every continent (aside from Antarctica, but he s working on that) and in front of millions of people. His primarily instrumental works cross all barriers and his music is accessible to all listeners regardless of age, race, language or culture. \r\n\r\nYanni - arranger, composer, orchestration, keyboards; Charles Adams - drums; Benedikt Brydern - violin; Jason Carder - trumpet and flugelhorn; Yoel Del Sol - percussion; V&#xED;ctor Esp&#xED;nola - harp; Ming Freeman - keyboards; James Mattos - French horn; Sarah O&#xE2;?&#x2122;Brien - cello; Mary Simpson - violin; Dana Teboe - trombone; Gabriel Vivas - bass; Samvel Yervinyan - violin; Alexander Zhiroff - cello; Lauren Jelencovich, Lisa Lavie - vocals","last_updated":"2018-05-24T12:11:35.182Z","parsed":{"xt":"urn:btih:32bff3b2c1cd0366f5f669c85c273f5dc89b5751","dn":"Yanni.The Dream Concert.Live from the Great Pyramids of Egypt","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"32bff3b2c1cd0366f5f669c85c273f5dc89b5751","infoHashBuffer":{"type":"Buffer","data":[50,191,243,178,193,205,3,102,245,246,105,200,92,39,63,93,200,155,87,81]},"name":"Yanni.The Dream Concert.Live from the Great Pyramids of Egypt","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}