{"title":"Find the Good by Heather Lende AZW","magnet":"magnet:?xt=urn:btih:3306618417178dbe0323b41543118a03f816f574&dn=Find+the+Good+by+Heather+Lende+AZW&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"361754","seeders":"9","leechers":"6","description":"xx\r\n\r\nFind the Good by Heather Lende AZW\r\n\r\nAs she was digging deep into the lives of community members, Heather Lende, the obituary writer for her tiny hometown newspaper in Haines, Alaska, began to notice something. Even the crustiest old Alaskan sourpuss who died in a one-room cabin always had Halloween candy for the neighborhood kids, and the eccentric owner of the seafood store who regularly warned her about government conspiracies knew how to be a true friend - his memorial service was packed.\r\n\r\nWhen Lende started intentionally seeking what was positive and true in people and situations in her own life - whether it was finding common ground with her opponents on the school board or accepting that her unmarried daughter&apos;s pregnancy might be a blessing - she felt happier, and life seemed more meaningful, too. Awful events - from a recent school shooting across the country to a fisherman drowning in Haines - are always followed by dozens and dozens of good deeds. When tragedy strikes, we can choose to focus on the first responders rushing toward the scene or the guys grilling hot dogs for hurricane refugees, and, like yawning, caring is contagious. There&apos;s so much to gain by taking responsibility for your own happiness and nothing to lose. In stormy times like these, we have to make our own good weather, and Find the Good shows us how.\r\n\r\nxx","last_updated":"2018-04-25T12:04:06.704Z","parsed":{"xt":"urn:btih:3306618417178dbe0323b41543118a03f816f574","dn":"Find the Good by Heather Lende AZW","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3306618417178dbe0323b41543118a03f816f574","infoHashBuffer":{"type":"Buffer","data":[51,6,97,132,23,23,141,190,3,35,180,21,67,17,138,3,248,22,245,116]},"name":"Find the Good by Heather Lende AZW","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}