{"title":"Secret Agent Heaven no. 1 (Taiwanese, 1964, restored) (DVDrip)","magnet":"magnet:?xt=urn:btih:3384f9816bd631b0b8e9128bfd8a7c6ab9fd2fc5&dn=Secret+Agent+Heaven+no.+1+%28Taiwanese%2C+1964%2C+restored%29+%28DVDrip%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"rflm","categoryP":"video","categoryS":"movies","size":"1903873066","seeders":"0","leechers":"0","description":"Secret Agent Heaven no. 1 (a.k.a. The Best Secret Agent) is a Taiwanese spy film, with elements of anti-Japanese propaganda, directed by CHANG Ying in 1964. It stars the wonderful Bai Hong as secret agent Heaven no. 1.\r\n\r\nThis is a DVD rip. The original Taiwanese audio was lost, but a Chinese dub survived, which is the default audio source. I recommend, however, switching to the second audio source, which is a modern redub in Taiwanese (both are labeled &apos;Chinese&apos;; the newer dub is the one that sounds better).\r\n\r\nSubtitles are in Chinese and English.\r\n\r\nThere are two extra features: one short video fragment showcasing the digital restoration of the film, and one interview with the director. Both are in Chinese, without English subtitles.\r\n\r\n---\r\n\r\nDuring the Sino-Japanese War, Tsui-Ying flees with her father from the Japanese occupation. She meets a young man, Ling-Yun, and falls in love. Yet Tsui-Ying chooses to leave Ling-Yun and marries a traitor who serves the Japanese. Out of heartbreak, Ling-Yun leaves the country to study abroad. In the meantime, &#x201C;Special Agent 001&#x201D; leads the sabotage against the Japanese. After Ling-Yun returns to Shanghai, he is surprised to find out his ex-lover has become the wife of his uncle Chao-Chun. A struggle about love and patriotism starts in this family. Special Agent 001 continues the sabotage and the identity of the agent finally reveals.\r\n\r\nThe Best Secret Agent is a remake by director CHANG Ying of the 1945 movie of the same name that caused a sensation in Shanghai. Fueled by a dog-eat-dog plot and the changing faces of the &#x201C;female spy&#x201D; protagonist, the film has been likened to a Taiwanese version of the 007 movies. The film broke box office records in Taiwan and kick-started the popularity of Taiwanese spy movies for years to come.\r\n\r\n-Taiwan Cinema Toolkit","last_updated":"2018-06-14T12:03:05.745Z","parsed":{"xt":"urn:btih:3384f9816bd631b0b8e9128bfd8a7c6ab9fd2fc5","dn":"Secret Agent Heaven no. 1 (Taiwanese, 1964, restored) (DVDrip)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3384f9816bd631b0b8e9128bfd8a7c6ab9fd2fc5","infoHashBuffer":{"type":"Buffer","data":[51,132,249,129,107,214,49,176,184,233,18,139,253,138,124,106,185,253,47,197]},"name":"Secret Agent Heaven no. 1 (Taiwanese, 1964, restored) (DVDrip)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}