{"title":"Astounding: Golden Age of Science Fiction by A. Nevala-Lee EPUB","magnet":"magnet:?xt=urn:btih:33f5d574ea5122bafc7547edbf3c1c4ebfa0c956&dn=Astounding%3A+Golden+Age+of+Science+Fiction+by+A.+Nevala-Lee+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3391904","seeders":"1","leechers":"0","description":"xx\r\n\r\nAstounding: .. The Golden Age of Science Fiction by Alec Nevala-Lee EPUB\r\n\r\nAstounding is the landmark account of the extraordinary partnership between four controversial writers - John W. Campbell, Isaac Asimov, Robert A. Heinlein, and L. Ron Hubbard - who set off a revolution in science fiction and forever changed our world. \r\n\r\nThis remarkable cultural narrative centers on the figure of John W. Campbell, Jr., whom Asimov called &#x201C;[T]he most powerful force in science fiction ever.&#x201D; Campbell, who has never been the subject of a biography until now, was both a visionary author - he wrote the story that was later filmed as The Thing - and the editor of the groundbreaking magazine best known as Astounding Science Fiction, in which he discovered countless legendary writers and published classic works ranging from the I, Robot series to Dune. Over a period of more than 30 years, from the rise of the pulps to the debut of Star Trek, he dominated the genre, and his three closest collaborators reached unimaginable heights. Asimov became the most prolific author in American history; Heinlein emerged as the leading science-fiction writer of his generation with the novels Starship Troopers and Stranger in a Strange Land; and Hubbard achieved lasting fame - and infamy - as the founder of the Church of Scientology. \r\n\r\nDrawing on unexplored archives, thousands of unpublished letters, and dozens of interviews, Alec Nevala-Lee offers a riveting portrait of this circle of authors, their work, and their tumultuous private lives. With unprecedented scope, drama, and detail, Astounding describes how fan culture was born in the depths of the Great Depression; follows these four friends and rivals through World War II and the dawn of the atomic era; and honors such exceptional women as Do&#xF1;a Campbell and Leslyn Heinlein, whose pivotal roles in the history of the genre have gone largely unacknowledged. For the first time, it reveals the startling extent of Campbell&#x2019;s influence on the ideas that evolved into Scientology, which prompted Asimov to observe: &#x201C;I knew Campbell and I knew Hubbard, and no movement can have two Messiahs.&#x201D; It looks unsparingly at the tragic final act that estranged the others from Campbell, bringing the golden age of science fiction to a close, and it illuminates how their complicated legacy continues to shape the imaginations of millions and our vision of the future itself.\r\n\r\nxx","last_updated":"2018-10-26T12:08:45.791Z","parsed":{"xt":"urn:btih:33f5d574ea5122bafc7547edbf3c1c4ebfa0c956","dn":"Astounding: Golden Age of Science Fiction by A. Nevala-Lee EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"33f5d574ea5122bafc7547edbf3c1c4ebfa0c956","infoHashBuffer":{"type":"Buffer","data":[51,245,213,116,234,81,34,186,252,117,71,237,191,60,28,78,191,160,201,86]},"name":"Astounding: Golden Age of Science Fiction by A. Nevala-Lee EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}