{"title":"Brothers of the Gun by Marwan Hisham, Molly Crabapple EPUB","magnet":"magnet:?xt=urn:btih:340008ca7fc6502a259b87bf4843ee448ae2f5aa&dn=Brothers+of+the+Gun+by+Marwan+Hisham%2C+Molly+Crabapple+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"99807494","seeders":"0","leechers":"0","description":"xx\r\n\r\nBrothers of the Gun by Marwan Hisham, Molly Crabapple EPUB\r\n\r\nA bracingly immediate memoir by a young man coming of age during the Syrian war, Brothers of the Gun is an intimate lens on the century&#x2019;s bloodiest conflict and a profound meditation on kinship, home, and freedom. \r\n\r\nIn 2011, Marwan Hisham and his two friends - fellow working-class college students Nael and Tareq - joined the first protests of the Arab Spring in Syria, in response to a recent massacre. Arm in arm they marched, poured Coca-Cola into one another&#x2019;s eyes to blunt the effects of tear gas, ran from the security forces, and cursed the country&#x2019;s president, Bashar al-Assad. It was ecstasy. A long-bottled revolution was finally erupting, and freedom from a brutal dictator seemed, at last, imminent. Five years later, the three young friends were scattered: one now an Islamist revolutionary, another dead at the hands of government soldiers, and the last, Marwan, now a journalist in Turkish exile, trying to find a way back to a homeland reduced to rubble.\r\n\r\nBrothers of the Gun is the story of a young man coming of age during the Syrian war, from its inception to the present. Marwan watched from the rooftops as regime warplanes bombed soldiers; as revolutionary activist groups, for a few dreamy days, spray-painted hope on Raqqa; as his friends died or threw in their lot with Islamist fighters. He became a journalist by courageously tweeting out news from a city under siege by ISIS, the Russians, and the Americans all at once. He watched the country that ran through his veins - the country that held his hopes, dreams, and fears - be destroyed in front of him and eventually joined the relentless stream of refugees risking their lives to escape.\r\n\r\nBrothers of the Gun offers a ground-level reflection on the Syrian revolution - and how it bled into international catastrophe and global war. This is a story of pragmatism and idealism, impossible violence and repression, and, even in the midst of war, profound acts of courage, creativity, and hope.\r\n\r\nxx","last_updated":"2018-05-17T12:06:13.324Z","parsed":{"xt":"urn:btih:340008ca7fc6502a259b87bf4843ee448ae2f5aa","dn":"Brothers of the Gun by Marwan Hisham, Molly Crabapple EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"340008ca7fc6502a259b87bf4843ee448ae2f5aa","infoHashBuffer":{"type":"Buffer","data":[52,0,8,202,127,198,80,42,37,155,135,191,72,67,238,68,138,226,245,170]},"name":"Brothers of the Gun by Marwan Hisham, Molly Crabapple EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}