{"title":"Mars, Inc.: The Billionaire's Club by Ben Bova EPUB","magnet":"magnet:?xt=urn:btih:344b98a3e540597ba4bcaf7e7128816d6f745b30&dn=Mars%2C+Inc.%3A+The+Billionaire%27s+Club+by+Ben+Bova+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"469366","seeders":"43","leechers":"6","description":"xx\r\n\r\nMars, Inc.: The Billionaire&apos;s Club by Ben Bova EPUB\r\n\r\nBova, a six-time Hugo Award winner and past president of theNational Space Society, returns to his most popular and best-selling subject: the quest for Mars!\r\n\r\nHow do you get to the Red Planet? Not via a benightedgovernment program trapped in red tape and bound by budget constrictions,that&apos;s for sure. No, what it will take is a helping of adventure, science,corporate power plays, a generous dollop of seduction - both in and out of theboardroom - and money, money, money!\r\n\r\nArt Thrasher knows this. He is a man with a driving vision:send humans to Mars. The government has utterly failed, but Thrasher has gotthe plan to accomplish such a feat: form a &quot;club&quot; of billionaires to chip inone billion a year until the dream is accomplished. The problem is, these menand women are tough cookies, addicted to a profitable bottom-line anddisdainful of pie-in-the-sky dreamers who want to use their cash to makesomebody else&apos;s dreams come true.\r\n\r\nBut Thrasher is different from the other dreamers in animportant regard: he&apos;s a billionaire himself, and the president of a successfulcompany. Still, it&apos;s going to take all his wiles as a captain of industry andmaster manipulator of business and capital to overcome setbacks andsabotage - and get a rocket full of scientists, engineers, visionaries, anddreamers on their way to the Red Planet.\r\n\r\nThe man for the job has arrived. Art Thrasher is prepared todo whatever it takes to put humans on Mars - or die trying!\r\n\r\nxx","last_updated":"2018-11-25T12:05:30.186Z","parsed":{"xt":"urn:btih:344b98a3e540597ba4bcaf7e7128816d6f745b30","dn":"Mars, Inc.: The Billionaire's Club by Ben Bova EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"344b98a3e540597ba4bcaf7e7128816d6f745b30","infoHashBuffer":{"type":"Buffer","data":[52,75,152,163,229,64,89,123,164,188,175,126,113,40,129,109,111,116,91,48]},"name":"Mars, Inc.: The Billionaire's Club by Ben Bova EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}