{"title":"Left of Boom by Douglas Laux, Ralph Pezzullo EPUB","magnet":"magnet:?xt=urn:btih:3455712c94424a6c4166068278134e37fc01f89d&dn=Left+of+Boom+by+Douglas+Laux%2C+Ralph+Pezzullo+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3127923","seeders":"22","leechers":"6","description":"xx\r\n\r\nLeft of Boom by Douglas Laux, Ralph Pezzullo EPUB\r\n\r\nThe explosive New York Times best seller!\r\n\r\nOn September 11, 2001, Doug Laux was a freshman in college, on the path to becoming a doctor. But with the fall of the Twin Towers came a turning point in his life. After graduating, he joined the Central Intelligence Agency, determined to get himself to Afghanistan and into the center of the action. Through persistence and hard work, he was fast-tracked to a clandestine operations position overseas. Dropped into a remote region of Afghanistan, he received his baptism by fire.\r\n\r\nFrustrated by bureaucratic red tape, a widespread lack of knowledge of the local customs and culture, and an attitude of complacency that hindered his ability to combat the local Taliban, Doug confounded his peers by dressing like a native and mastering the local dialect, making contacts, and building sources within several deadly terrorist networks. His new approach resulted in unprecedented successes, including uncovering the largest IED network in the world, responsible for killing hundreds of US soldiers.\r\n\r\nMeanwhile, Doug had to keep up false pretenses with his family, girlfriend, and friends - nobody could know what he did for a living - and deal with the emotional turbulence of constantly living a lie. His double life was building to an explosive resolution, with repercussions that would have far reaching consequences.\r\n\r\nxx","last_updated":"2018-01-31T12:06:45.502Z","parsed":{"xt":"urn:btih:3455712c94424a6c4166068278134e37fc01f89d","dn":"Left of Boom by Douglas Laux, Ralph Pezzullo EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3455712c94424a6c4166068278134e37fc01f89d","infoHashBuffer":{"type":"Buffer","data":[52,85,113,44,148,66,74,108,65,102,6,130,120,19,78,55,252,1,248,157]},"name":"Left of Boom by Douglas Laux, Ralph Pezzullo EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}