{"title":"Split Tooth by Tanya Tagaq EPUB","magnet":"magnet:?xt=urn:btih:34a233f931c9fcb62ce472d2537136f3fa4a3dfa&dn=Split+Tooth+by+Tanya+Tagaq+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4117005","seeders":"0","leechers":"0","description":"xx\r\n\r\nSplit Tooth by Tanya Tagaq EPUB\r\n\r\nFrom the internationally acclaimed Inuit throat singer who has dazzled and enthralled the world with music it had never heard before, a fierce, tender, heartbreaking story unlike anything you&apos;ve ever heard.\r\n\r\nFact can be as strange as fiction. It can also be as dark, as violent, as rapturous. In the end, there may be no difference between them.\r\n\r\nA girl grows up in Nunavut in the 1970s. She knows joy and friendship and parents&apos; love. She knows boredom and listlessness and bullying. She knows the tedium of the everyday world and the raw, amoral power of the ice and sky, the seductive energy of the animal world. She knows the ravages of alcohol and violence at the hands of those she should be able to trust. She sees the spirits that surround her and the immense power that dwarfs all of us.\r\n\r\nWhen she becomes pregnant, she must navigate all this.\r\n\r\nVeering back and forth between the grittiest features of a small arctic town, the electrifying proximity of the world of animals and ravishing world of myth, Tanya Tagaq explores a world where the distinctions between good and evil, animal and human, victim and transgressor, real and imagined lose their meaning, but the guiding power of love remains.\r\n\r\nHaunting, brooding, exhilarating, and tender all at once, Tagaq moves effortlessly between fiction and memoir, myth and reality, poetry and prose, and conjures a world and a heroine readers will never forget.\r\n\r\nxx","last_updated":"2018-09-26T12:04:07.246Z","parsed":{"xt":"urn:btih:34a233f931c9fcb62ce472d2537136f3fa4a3dfa","dn":"Split Tooth by Tanya Tagaq EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"34a233f931c9fcb62ce472d2537136f3fa4a3dfa","infoHashBuffer":{"type":"Buffer","data":[52,162,51,249,49,201,252,182,44,228,114,210,83,113,54,243,250,74,61,250]},"name":"Split Tooth by Tanya Tagaq EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}