{"title":"Year One [Chronicles of The One -1] - Nora Roberts","magnet":"magnet:?xt=urn:btih:354258970518a37ba0490439c8a0b6ac521f4961&dn=Year+One+%5BChronicles+of+The+One+-1%5D+-+Nora+Roberts&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ComGetMe","categoryP":"audio","categoryS":"audio_books","size":"709752612","seeders":"11","leechers":"8","description":"It began on New Year&apos;s Eve.\r\n\r\nThe sickness came on suddenly, and spread quickly. The fear spread even faster. Within weeks, everything people counted on began to fail them. The electrical grid sputtered; law and government collapsed - and more than half of the world&apos;s population was decimated.\r\n\r\nWhere there had been order, there was now chaos. And as the power of science and technology receded, magic rose up in its place. Some of it is good, like the witchcraft worked by Lana Bingham, practicing in the loft apartment she shares with her lover, Max. Some of it is unimaginably evil, and it can lurk anywhere, around a corner, in fetid tunnels beneath the river - or in the ones you know and love the most.\r\n\r\nAs word spreads that neither the immune nor the gifted are safe from the authorities who patrol the ravaged streets, and with nothing left to count on but each other, Lana and Max make their way out of a wrecked New York City. \r\n\r\nAt the same time, other travelers are heading west too, into a new frontier. Chuck, a tech genius trying to hack his way through a world gone offline. \r\n\r\nArlys, a journalist who has lost her audience but uses pen and paper to record the truth. \r\n\r\nFred, her young colleague, possessed of burgeoning abilities and an optimism that seems out of place in this bleak landscape. \r\n\r\nAnd Rachel and Jonah, a resourceful doctor and a paramedic who fend off despair with their determination to keep a young mother and three infants in their care alive.\r\n\r\nIn a world of survivors where every stranger encountered could be either a savage or a savior, none of them knows exactly where they are heading, or why. But a purpose awaits them that will shape their lives and the lives of all those who remain.\r\n\r\nThe end has come. The beginning comes next.\r\n\r\n\r\nRead by: Julia Whelan\r\n\r\nFormat: Stereo mp3\r\n\r\nBit Rate: 128Kbps                      \r\n\r\n\r\nRemember to tip your uploader and seed! :)","last_updated":"2018-03-14T12:17:45.291Z","parsed":{"xt":"urn:btih:354258970518a37ba0490439c8a0b6ac521f4961","dn":"Year One [Chronicles of The One -1] - Nora Roberts","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"354258970518a37ba0490439c8a0b6ac521f4961","infoHashBuffer":{"type":"Buffer","data":[53,66,88,151,5,24,163,123,160,73,4,57,200,160,182,172,82,31,73,97]},"name":"Year One [Chronicles of The One -1] - Nora Roberts","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}