{"title":"The Sociopath Next Door by Martha Stout EPUB","magnet":"magnet:?xt=urn:btih:35af0062236588339bc81ec652a3ee1399b0c7b5&dn=The+Sociopath+Next+Door+by+Martha+Stout+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"312540","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Sociopath Next Door by Martha Stout EPUB\r\n\r\nWe are accustomed to think of sociopaths as violent criminals, but in The Sociopath Next Door, Harvard psychologist Martha Stout reveals that a shocking 4 percent of ordinary people, one in 25, has an often undetected mental disorder, the chief symptom of which is that that person possesses no conscience. He or she has no ability whatsoever to feel shame, guilt, or remorse. One in 25 everyday Americans, therefore, is secretly a sociopath. They could be your colleague, your neighbor, even family. And they can do literally anything at all and feel absolutely no guilt.\r\n\r\nHow do we recognize the remorseless? One of their chief characteristics is a kind of glow or charisma that makes sociopaths more charming or interesting than the other people around them. They&apos;re more spontaneous, more intense, more complex, or even sexier than everyone else, making them tricky to identify and leaving us easily seduced. Fundamentally, sociopaths are different because they cannot love. Sociopaths learn early on to show sham emotion, but underneath they are indifferent to others&apos; suffering. They live to dominate and thrill to win.\r\n\r\nThe fact is, we all almost certainly know at least one or more sociopaths already. Part of the urgency in reading The Sociopath Next Door is the moment when we suddenly recognize that someone we know, someone we worked for, or were involved with, or voted for, is a sociopath. But what do we do with that knowledge? To arm us against the sociopath, Dr. Stout teaches us to question authority, suspect flattery, and beware the pity play. Above all, she writes, when a sociopath is beckoning, do not join the game.\r\n\r\nIt is the ruthless versus the rest of us, and The Sociopath Next Door will show you how to recognize and defeat the devil you know.\r\n\r\nxx","last_updated":"2018-05-15T12:03:12.037Z","parsed":{"xt":"urn:btih:35af0062236588339bc81ec652a3ee1399b0c7b5","dn":"The Sociopath Next Door by Martha Stout EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"35af0062236588339bc81ec652a3ee1399b0c7b5","infoHashBuffer":{"type":"Buffer","data":[53,175,0,98,35,101,136,51,155,200,30,198,82,163,238,19,153,176,199,181]},"name":"The Sociopath Next Door by Martha Stout EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}