{"title":"Naruto to Boruto Shinobi Striker.iso","magnet":"magnet:?xt=urn:btih:360407a324d97be1b3b0938f0d674655fc34c1e9&dn=Naruto+to+Boruto+Shinobi+Striker.iso&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"brucelee666","categoryP":"games","categoryS":"pc","size":"7021420544","seeders":"1","leechers":"2","description":"Naruto to Boruto: Shinobi Striker, released on PC, PS4 and XONE, is a third person action game focused on online matches. The game was developed by Japanese studio called Soleil composed of people that worked on Devil&apos;s Third or games from Ninja Gaiden and Dead or Alive series. The leader of the team is Katsunoru Ehara who had the same role during the production of Ninja Gaiden II. \r\n\r\nPlot \r\nThe game is focused on multpilayer, therefore it doesn&apos;t offer a complex narrative. As the title suggests the game is set in the universe known from manga series called Naruto that combines elements of medieval Japan, fantasy and modern technologies. Players can choose from ninja warriors who have supernatural powers and then participate in fights between small groups. \r\n\r\nMechanics \r\nNaruto to Boruto: Shinobi Striker, released on PC, PS4 and XONE, is an online action game in which two teams, with up to four players each, fight on enclosed arenas. Players can choose from many characters known from the comic book and its animated adaptation. Among them there are heroes such as Naruto Uzumaki, Sasuke Uchiha, Sakura Haruno, Kakashi Hatake, Pain, Konan, Itachi Uchiha or Kisame Hoshigaki. Each one of them has their unique abilities, weapons and special skills. \r\n\r\nThe game offers a complex combat and movement system. The characters can use various attacks and powers as well as perform various acrobatics and run on all planes, including walls and ceilings. All arenas were designed with this feature in mind and thanks to that they have complicated vertical constructions, along with objects that provide players a lot of possibilities for moving and performing attacks. \r\n\r\nIncludes :\r\n\r\n- NTBSS: Shinobi Strikers Coat: Black (Gender-Neutral) \r\n- NTBSS: Character Pain Master Early Unlock \r\n- NTBSS: Seventh Hokage Costume (Gender-Neutral) \r\n- NTBSS: Season Pass","last_updated":"2018-09-01T12:05:13.300Z","parsed":{"xt":"urn:btih:360407a324d97be1b3b0938f0d674655fc34c1e9","dn":"Naruto to Boruto Shinobi Striker.iso","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"360407a324d97be1b3b0938f0d674655fc34c1e9","infoHashBuffer":{"type":"Buffer","data":[54,4,7,163,36,217,123,225,179,176,147,143,13,103,70,85,252,52,193,233]},"name":"Naruto to Boruto Shinobi Striker.iso","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}