{"title":"Tailspin by Steven Brill EPUB","magnet":"magnet:?xt=urn:btih:365fe59a3cf887d101efbae97a38e978f9a31e4e&dn=Tailspin+by+Steven+Brill+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"52373918","seeders":"0","leechers":"0","description":"xx\r\n\r\nTailspin by Steven Brill EPUB\r\n\r\nFrom the award-winning journalist and best-selling author of America&apos;s Bitter Pill: a tour de force examination of 1) how and why major American institutions no longer serve us as they should, causing a deep rift between the vulnerable majority and the protected few, and 2) how some individuals and organizations are laying the foundation for real, lasting change.\r\n\r\nIn this revelatory narrative covering the years 1967 to 2017, Steven Brill gives us a stunningly cogent picture of the broken system at the heart of our society. He shows us how, over the last half-century, America&apos;s core values - meritocracy, innovation, due process, free speech, and even democracy itself - have somehow managed to power its decline into dysfunction. They have isolated our best and brightest, whose positions at the top have never been more secure or more remote. The result has been an erosion of responsibility and accountability, an epidemic of shortsightedness, an increasingly hollow economic and political center, and millions of Americans gripped by apathy and hopelessness. \r\n\r\nBy examining the people and forces behind the rise of big-money lobbying, legal and financial engineering, the demise of private-sector unions, and a hamstrung bureaucracy, Brill answers the question on everyone&apos;s mind: How did we end up this way? Finally, he introduces us to those working quietly and effectively to repair the damages. \r\n\r\nAt once a diagnosis of our national ills, a history of their development, and a prescription for a brighter future, Tailspin is a work of riveting journalism - and a welcome antidote to political despair.\r\n\r\nxx","last_updated":"2018-05-30T12:00:51.728Z","parsed":{"xt":"urn:btih:365fe59a3cf887d101efbae97a38e978f9a31e4e","dn":"Tailspin by Steven Brill EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"365fe59a3cf887d101efbae97a38e978f9a31e4e","infoHashBuffer":{"type":"Buffer","data":[54,95,229,154,60,248,135,209,1,239,186,233,122,56,233,120,249,163,30,78]},"name":"Tailspin by Steven Brill EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}