{"title":"The Evening Spider by Emily Arsenault EPUB","magnet":"magnet:?xt=urn:btih:36771e6e5541aecded3dbe77cb33c0a6687048d4&dn=The+Evening+Spider+by+Emily+Arsenault+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"739012","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Evening Spider by Emily Arsenault EPUB\r\n\r\nA gripping blend of psychological suspense and historical true crime, this riveting novel - inspired by a sensational real-life murder from the 1800s - by critically acclaimed author Emily Arsenault delivers a heart-stopping mystery linking two young mothers from different centuries.\r\n\r\nFrances Barnett and Abby Bernacki are two haunted young mothers living in the same house in two different centuries.\r\n\r\nIn 1885, Frances Barnett is in the Northampton Lunatic Hospital, telling her story to a visitor. She has come to distrust her own memories and believes that her pregnancy, birth, and early days of motherhood may have impaired her sanity.\r\n\r\nDuring the earliest months of her baby&apos;s life, Frances eagerly followed the famous murder trial of Mary Stannard that captivated New Englanders with its salacious details and expert forensic testimony. Following - and even attending - this trial, Frances found an escape from the monotony of new motherhood. But as her story unfolds, Frances must admit that her obsession with the details of the murder were not entirely innocent.\r\n\r\nPresent day: Abby has been adjusting to motherhood smoothly - until recently, when odd sensations and dreams have begun to unsettle her while home alone with her baby. When she starts to question the house&apos;s history, she is given the diary of Frances Barnett, who lived in the house 125 years earlier. Abby finds the diary disturbing and researches the Barnett family&apos;s history. The more Abby learns, the more she wonders about a negative - possibly supernatural - influence in her house. She becomes convinced that when she sleeps, she leaves her daughter vulnerable - and then vows not to sleep until she can determine the cause of her eerie experiences.\r\n\r\nFrances Barnett might not be the only new mother to lose her mind in this house. And like Frances, Abby discovers that by trying to uncover another&apos;s secrets, she risks awakening some of her own.\r\n\r\nxx","last_updated":"2018-03-13T12:03:34.360Z","parsed":{"xt":"urn:btih:36771e6e5541aecded3dbe77cb33c0a6687048d4","dn":"The Evening Spider by Emily Arsenault EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"36771e6e5541aecded3dbe77cb33c0a6687048d4","infoHashBuffer":{"type":"Buffer","data":[54,119,30,110,85,65,174,205,237,61,190,119,203,51,192,166,104,112,72,212]},"name":"The Evening Spider by Emily Arsenault EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}