{"title":"Becoming Mrs. Lewis by Patti Callahan EPUB","magnet":"magnet:?xt=urn:btih:36893324f1af781a11a03f3cca407f65f57c374c&dn=Becoming+Mrs.+Lewis+by+Patti+Callahan+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"687969","seeders":"0","leechers":"1","description":"xx\r\n\r\nBecoming Mrs. Lewis by Patti Callahan EPUB\r\n\r\n&#x201C;Patti Callahan seems to have found the story she was born to tell in this tale of unlikely friendship turned true love between Joy Davidman and C. S. Lewis, that tests the bounds of faith and radically alters both of their lives. Their connection comes to life in Callahan&#x2019;s expert hands, revealing a connection so persuasive and affecting, we wonder if there&#x2019;s another like it in history. Luminous and penetrating.&#x201D; (Paula McLain, New York Times best-selling author of The Paris Wife)\r\n\r\nIn a most improbable friendship, she found love. In a world where women were silenced, she found her voice. \r\n\r\nFrom New York Times best-selling author Patti Callahan comes an exquisite novel of Joy Davidman, the woman C. S. Lewis called &#x201C;my whole world.&#x201D; When poet and writer Joy Davidman began writing letters to C. S. Lewis - known as Jack - she was looking for spiritual answers, not love. Love, after all, wasn&#x2019;t holding together her crumbling marriage. Everything about New Yorker Joy seemed ill-matched for an Oxford don and the beloved writer of Narnia, yet their minds bonded over their letters. Embarking on the adventure of her life, Joy traveled from America to England and back again, facing heartbreak and poverty, discovering friendship and faith, and against all odds, finding a love that even the threat of death couldn&#x2019;t destroy. \r\n\r\nIn this masterful exploration of one of the greatest love stories of modern times, we meet a brilliant writer, a fiercely independent mother, and a passionate woman who changed the life of this respected author and inspired books that still enchant us and change us. Joy lived at a time when women weren&#x2019;t meant to have a voice - and yet her love for Jack gave them both voices they didn&#x2019;t know they had. \r\n\r\nAt once a fascinating historical novel and a glimpse into a writer&#x2019;s life, Becoming Mrs. Lewis is above all a love story - a love of literature and ideas and a love between a husband and wife that, in the end, was not impossible at all.\r\n\r\nxx","last_updated":"2018-10-14T12:05:36.247Z","parsed":{"xt":"urn:btih:36893324f1af781a11a03f3cca407f65f57c374c","dn":"Becoming Mrs. Lewis by Patti Callahan EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"36893324f1af781a11a03f3cca407f65f57c374c","infoHashBuffer":{"type":"Buffer","data":[54,137,51,36,241,175,120,26,17,160,63,60,202,64,127,101,245,124,55,76]},"name":"Becoming Mrs. Lewis by Patti Callahan EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}