{"title":"Notes from No Man's Land: American Essays by Eula Biss EPUB","magnet":"magnet:?xt=urn:btih:373446d21ec550010f38fdb045314912d0d8961d&dn=Notes+from+No+Man%27s+Land%3A+American+Essays+by+Eula+Biss+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1817903","seeders":"0","leechers":"0","description":"xx\r\n\r\nNotes from No Man&#x2019;s Land: American Essays by Eula Biss EPUB\r\n\r\nWinner of the National Book Critics Circle Award for Criticism\r\n\r\nWinner of the Graywolf Press Nonfiction Prize\r\n\r\nA frank and fascinating exploration of race and racial identity\r\n\r\nIn a book that begins with a series of lynchings and ends with a series of apologies, Eula Biss explores race in America. Her response to the topic is informed by the experiences chronicled in these essays - teaching in a Harlem school on the morning of 9/11, reporting for an African American newspaper in San Diego, watching the aftermath of Katrina from a college town in Iowa, and settling in Chicago&#x2019;s most diverse neighborhood. As Biss moves across the country from New York to California to the Midwest, her essays move across time from biblical Babylon to the freedman&#x2019;s schools of Reconstruction to a Jim Crow mining town to post-war white flight. She brings an eclectic education to the page, drawing variously on the Eagles, Laura Ingalls Wilder, James Baldwin, Alexander Graham Bell, Joan Didion, religious pamphlets, and reality television shows.\r\n\r\nThese spare, sometimes lyric essays explore the legacy of race in America, artfully revealing in intimate detail how families, schools, and neighborhoods participate in preserving racial privilege. Faced with a disturbing past and an unsettling present, Biss still remains hopeful about the possibilities of American diversity, &#x201C;not the sun-shininess of it, or the quota-making politics of it, but the real complexity of it.&#x201D;\r\n\r\nxx","last_updated":"2018-05-02T12:01:23.547Z","parsed":{"xt":"urn:btih:373446d21ec550010f38fdb045314912d0d8961d","dn":"Notes from No Man's Land: American Essays by Eula Biss EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"373446d21ec550010f38fdb045314912d0d8961d","infoHashBuffer":{"type":"Buffer","data":[55,52,70,210,30,197,80,1,15,56,253,176,69,49,73,18,208,216,150,29]},"name":"Notes from No Man's Land: American Essays by Eula Biss EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}