{"title":"Raymond Queneau - Novels, Poetry and Short Prose (10 books)","magnet":"magnet:?xt=urn:btih:37b407f67ba1b301d8577a9abb079be35edafa5c&dn=Raymond+Queneau+-+Novels%2C+Poetry+and+Short+Prose+%2810+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"34168432","seeders":"9","leechers":"9","description":"\nRAYMOND QUENEAU (1903-1976) was a French novelist, poet and editor who became one of the most significant figures in twentieth-century French letters.  His work touched on many of the major literary movements of his lifetime, from surrealism to the experimental school of the nouveau roman.  In 1924 he met and briefly joined the Surrealists, but never fully shared their penchants for automatic writing or ultra-left politics.  From that period he retained a taste for verbal juggling, a tendency toward black humour, and a derisive posture toward authority.  His puns, sneers, spelling extravaganzas, and other linguistic contortions concealed a total pessimism, an obsession with death.\n\nFor Albert Camus, Queneau&apos;s books were &quot;ambiguous fairylands in which the scenes of everyday life are mingled with a melancholy which is ageless.&quot;  His fiction defied strict categorization.  PIERROT MON AMI (1942), considered by many to be one of his finest achievements, is a quirky coming-of-age novel concerning a young man&#x2019;s initiation into a world filled with deceit, fraud, and manipulation.  Pierrot represents one of the main types of the Queneau hero, according to critic Martin Esslin: the simpleton who is a natural poet and who passes through an absurd and meaningless world without understanding it, without seeking to understand it.\n\nOne of his most influential works is EXERCISES IN STYLE (1947), a collection of 99 retellings of the same simple story, but each in a radically different style, as a sonnet, an opera, in slang, and with many more permutations, demonstrating the tremendous variety of styles in which storytelling can take place.  WE ALWAYS TREAT WOMEN TOO WELL (1947) is a wickedly funny send-up of cheap smut&#x2014;Queneau&apos;s response to a popular bodice-ripper of the 1940s&#x2014;exposing the link between sexual fantasy and actual domination while celebrating the imagination&apos;s power to transmute crude sensationalism into pleasure pure and simple.\n\nTHE FLIGHT OF ICARUS (1968) is his only novel written in the form of a play, complete with stage directions.  Consciously parodying Pirandello and Robbe-Grillet, it begins with a novelist&apos;s discovery that his principal character has vanished. This sets off a rash of other such disappearances, and before long, a number of desperate authors are searching for their fugitive characters, who wander through the Paris of the 1890s, occasionally meeting one another, and even straying into new novels.  Throughout these almost vaudevillian turns of the plot, we are always aware of Queneau&apos;s evident delight at holding the thin line between farce and philosophy.\n\nSTORIES AND REMARKS (1981) collects the best of Queneau&apos;s shorter prose, including short stories, an uncompleted novel, melancholic and absurd essays, occasionally baffling &quot;Texticles,&quot; a pastiche of Alice in Wonderland, and his only play.  Talking dogs, boozing horses, and suicides come head to head with ruminations on the effects of aerodynamics on addition, rhetorical dreams, and a pioneering example of permutational fiction influenced by computer language.\n\n\nThe following books are in ePUB and/or PDF format as indicated:\n\n\n                                 == NOVELS ==\n\n* Bark Tree, The (New Directions, 1971).  Barbara Wright, trans. -- ePUB + PDF\n* Blue Flowers, The (New Directions, 1985).  Barbara Wright, trans. -- ePUB\n* Flight of Icarus, The (New Directions, 1973).  Barbara Wright, trans. -- ePUB\n* Odile (Dalkey Archive, 1985).  Carole Sanders, trans. -- PDF**\n* Pierrot (Lehmann, 1950).  Julian MacLaren-Ross, trans. -- PDF\n* Pierrot Mon Ami (Dalkey Archive, 1987).  Barbara Wright, trans. -- PDF**\n* We Always Treat Women Too Well (NYRB, 2003).  Barbara Wright, trans. -- PDF**\n\n\n                                 == POETRY ==\n\n* Pataphysical Poems (Unicorn, 1985).  Teo Savory, trans. -- PDF**\n\n\n                                  == OTHER ==\n\n* Exercises in Style (New Directions, 2012).  Barbara Wright, trans. -- ePUB\n* Stories and Remarks (Nebraska, 2000).  Marc Lowenthal, trans. -- PDF**\n\n\nNOTE: PDF** denotes a scan generously provided by @Mohamed5438, to whom many thanks.\n\n____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-10-25T12:32:49.870Z","parsed":{"xt":"urn:btih:37b407f67ba1b301d8577a9abb079be35edafa5c","dn":"Raymond Queneau - Novels, Poetry and Short Prose (10 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"37b407f67ba1b301d8577a9abb079be35edafa5c","infoHashBuffer":{"type":"Buffer","data":[55,180,7,246,123,161,179,1,216,87,122,154,187,7,155,227,94,218,250,92]},"name":"Raymond Queneau - Novels, Poetry and Short Prose (10 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}