{"title":"Analized - Kira Noir (Stretches Her Ass in Preparation for Destr","magnet":"magnet:?xt=urn:btih:38de34612f9e0d5dc73d50d3f94a85021fb4d830&dn=Analized+-+Kira+Noir+%28Stretches+Her+Ass+in+Preparation+for+Destr&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"819646559","seeders":"25","leechers":"26","description":"Kira Noir is a HOT, athletic, black babe with a penchant for anal stretching and a love for huge cocks shoved up her butt. She starts out with a baby butt plug, teasing her ass for the punishment to come. She tastes the toy straight from her butt, and proceeds to shove a BIG glass dildo into her tiny fuck hole. But Kira&apos;s not satisfied with how wide she can stretch on her own. She needs a big cock and a hard pounding for her ass to gape properly. James shows up, on cue, his cock hard and ready to fuck her right. He begins with her mouth, stretching her throat with his fingers before jamming his dick into her, as if to fish out all her drool. Copious fluids pour from Kira&apos;s lips as she performs the most amazing blowjob, complete with a rough face fucking. James chokes the skinny slut and slaps her small perky tits. She smiles and begs for his cock to be shoved up her ass. Finally, James gives in and throws Kira on to her back, so that he can fuck her butt. Her hole barely stretches around his cock. The intensity nearly makes her cum. And James hasn&apos;t even started pounding yet. He pummels Kira&apos;s ass in missionary and then drags her on to the ground, so that her ass is propped up in the air. There, he delivers another epic ass pounding, stopping only so that he can hold her hole open and admire her beautiful gape. Kira begs for cum inside her. James gives in, switching holes to her pussy, and filling her up with an enormous creampie. Kira jumps off James&apos; cock so that she can watch his semen spill out of her cunt. She ends the scene as a satisfied little slut, her hole slick with cum!\r\nCATEGORIES: Anal, Black, Creampie, Fisting, Gaping, Great Ass, Hipster, Natural, Pornstar, Rimming, Rough Sex, Shaved Pussy\r\n <a href=\"\nhttp://imgdone.com/image/XK5dh\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/XK5dh</a>\r\n <a href=\"\nhttp://imgdone.com/image/XK8VU\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/XK8VU</a>","last_updated":"2018-06-04T12:03:24.644Z","parsed":{"xt":"urn:btih:38de34612f9e0d5dc73d50d3f94a85021fb4d830","dn":"Analized - Kira Noir (Stretches Her Ass in Preparation for Destr","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"38de34612f9e0d5dc73d50d3f94a85021fb4d830","infoHashBuffer":{"type":"Buffer","data":[56,222,52,97,47,158,13,93,199,61,80,211,249,74,133,2,31,180,216,48]},"name":"Analized - Kira Noir (Stretches Her Ass in Preparation for Destr","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}