{"title":"Dream with Little Angels by Michael Hiebert EPUB","magnet":"magnet:?xt=urn:btih:391c199af28ba08396cb071cf36f991d30fafd19&dn=Dream+with+Little+Angels+by+Michael+Hiebert+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"810548","seeders":"24","leechers":"2","description":"xx\r\n\r\nDream with Little Angels (Alvin, Alabama, Book 1) by Michael Hiebert EPUB\r\n\r\nMichael Hiebert&#x2019;s remarkable debut novel tells the riveting story of a small Southern town haunted by tragedy, one brave woman&#x2019;s struggle to put a troubling mystery to rest - and its impact on the sensitive boy who comes of age in the midst of it all.\r\n\r\nAbe Teal wasn&#x2019;t even born when Ruby Mae Vickers went missing 12 years ago. Few people in Alvin, Alabama, talk about the months spent looking for her, or about how Ruby Mae&#x2019;s lifeless body was finally found beneath a willow tree. Even Abe&#x2019;s mom, Leah, Alvin&#x2019;s only detective, has avoided the subject. But now, another girl is missing.\r\n\r\n14-year-old Mary Ann Dailey took the bus home from school as usual, then simply vanished. Townsfolk comb the dense forests and swampy creeks to no avail. Days later, Tiffany Michelle Yates disappears. Abe saw her only hours before, holding an ice cream cone and wearing a pink dress.\r\n\r\nObservant and smart, Abe watches his mother battle small-town bureaucracy and old resentments, desperate to find both girls and quietly frantic for her own children&#x2019;s safety. As the search takes on a terrifying urgency, Abe traverses the shifting ground between innocence and hard-won understanding, eager to know and yet fearing what will be revealed .\r\n\r\nDream with Little Angels is by turns lyrical, heartbreaking, and shocking - a brilliantly plotted novel of literary suspense and of the dark shadows, painful secrets, and uncompromising courage in one small town.\r\n\r\nxx","last_updated":"2018-09-22T12:32:43.037Z","parsed":{"xt":"urn:btih:391c199af28ba08396cb071cf36f991d30fafd19","dn":"Dream with Little Angels by Michael Hiebert EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"391c199af28ba08396cb071cf36f991d30fafd19","infoHashBuffer":{"type":"Buffer","data":[57,28,25,154,242,139,160,131,150,203,7,28,243,111,153,29,48,250,253,25]},"name":"Dream with Little Angels by Michael Hiebert EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}