{"title":"KeePass 2.38 + Portable","magnet":"magnet:?xt=urn:btih:3acd8a5667880b6165f10c787968f075b8922202&dn=KeePass+2.38+%2B+Portable&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"istra77","categoryP":"applications","categoryS":"windows","size":"9039922","seeders":"7","leechers":"3","description":"KeePass Password Safe is a free, open source, lightweight, and easy-to-use password manager for Windows, Linux and Mac OS X, with ports for Android, iPhone/iPad and other mobile devices. With so many passwords to remember and the need to vary passwords to protect your valuable data, it&#x2019;s nice to have KeePass to manage your passwords in a secure way. KeePass puts all your passwords in a highly encrypted database and locks them with one master key or a key file. As a result, you only have to remember one single master password or select the key file to unlock the whole database. And the databases are encrypted using the best and most secure encryption algorithms currently known, AES and Twofish. See our features page for details.\r\n\r\n\r\n&lt;Features&gt;\r\n*Strong security (AES encryption, SHA-256 hash, protection against dictionary and guessing attacks, in-memory protection, ...).\r\n*Portable (no installation required), available for many platforms (Windows, Linux, Mac OS X, smart devices/phones, ...).\r\n*Efficient and flexible organization (entry groups, tags, time fields, file attachments, ...).\r\n*Various data transfer methods (clipboard, drag and drop, auto-type, plugins can provide integration with other applications, ...).\r\n*Powerful password generator (generation based on character sets and patterns, with many options).\r\n*Extensible (plugin architecture) and multi-language (more than 40 languages are available)","last_updated":"2018-01-27T12:07:36.093Z","parsed":{"xt":"urn:btih:3acd8a5667880b6165f10c787968f075b8922202","dn":"KeePass 2.38   Portable","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3acd8a5667880b6165f10c787968f075b8922202","infoHashBuffer":{"type":"Buffer","data":[58,205,138,86,103,136,11,97,101,241,12,120,121,104,240,117,184,146,34,2]},"name":"KeePass 2.38   Portable","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}