{"title":"All the Beautiful Lies by Peter Swanson EPUB","magnet":"magnet:?xt=urn:btih:3af36475bdf0e691500c80438cd7c2392bb02441&dn=All+the+Beautiful+Lies+by+Peter+Swanson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"394072","seeders":"0","leechers":"0","description":"xx\r\n\r\nAll the Beautiful Lies by Peter Swanson EPUB\r\n\r\nFrom the acclaimed author of Her Every Fear and The Kind Worth Killing comes a diabolically clever tale of obsession, revenge, and cold-blooded murder - a sly and brilliant guessing game of a novel in the vein of Ruth Ware, Paula Hawkins, and Patricia Highsmith. \r\n\r\nHarry Ackerson has always considered his stepmother, Alice, to be sexy and beautiful in an &quot;otherworldly&quot; way. She has always been kind and attentive, if a little aloof in the last few years. \r\n\r\nDays before his college graduation, Alice calls with shocking news. His father is dead, and the police think it&apos;s suicide. Devastated, Harry returns to his father&apos;s home in Maine. There, he and Alice will help each other pick up the pieces of their lives and uncover what happened to his father. \r\n\r\nShortly after he arrives, Harry meets a mysterious young woman named Grace McGowan. Though she claims to be new to the area, Harry begins to suspect that Grace may not be a complete stranger to his family. But she isn&apos;t the only attractive woman taking an interest in Harry. The sensual Alice is also growing closer, coming on to him in an enticing, clearly sexual way. \r\n\r\nMesmerized by these two women, Harry finds himself falling deeper under their spell. Yet the closer he gets to them, the more isolated he feels, disoriented by a growing fear that both women are hiding dangerous - even deadly - secrets...and that neither one is telling the truth. \r\n\r\nxx","last_updated":"2018-04-08T12:14:18.306Z","parsed":{"xt":"urn:btih:3af36475bdf0e691500c80438cd7c2392bb02441","dn":"All the Beautiful Lies by Peter Swanson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3af36475bdf0e691500c80438cd7c2392bb02441","infoHashBuffer":{"type":"Buffer","data":[58,243,100,117,189,240,230,145,80,12,128,67,140,215,194,57,43,176,36,65]},"name":"All the Beautiful Lies by Peter Swanson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}