{"title":"Dragon Age Origins","magnet":"magnet:?xt=urn:btih:3afd80ea17a11f41fa9ebf153d33f534f422ef30&dn=Dragon+Age+Origins&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"freedisk","categoryP":"games","categoryS":"pc","size":"22448432516","seeders":"0","leechers":"0","description":"You are a Grey Warden, one of the last of a legendary order of guardians. With the return of an ancient foe and the kingdom engulfed in civil war, you have been chosen by fate to unite the shattered lands and slay the archdemon once and for all.\r\n\r\nA Stunning World to Explore\r\nBioWare&#x2019;s deepest universe to date with over 80 hours of gameplay and more than double the size and scope of Mass Effect\r\nTravel throughout dozens of environments and fully immerse yourself in a shattered world that is on the brink of utter annihilation\r\nAn epic story that is completely shaped and reactive to your play style\r\nComplex Moral Choices\r\nThere are no easy choices\r\nTailor your Dragon Age: Origins experience from the very beginning by choose from six different Origin Stories\r\nDecide how to handle complex issues like murder, genocide, betrayal, and the possession/sacrificing of children without the security of a good/bad slider to tell you what to do\r\nFull Character Customization\r\nSculpt your hero in your own image or fantasy\r\nElaborate character creator allows you to create your own hero unique from anyone else\r\nShape your character&#x2019;s personality and morality based on the choices you make throughout the game\r\nEngage in Bone-Crushing, Visceral Combat\r\nBattle against massive and terrifying creatures\r\nUnleash legendary powers and choose from over 100 different magical spells and skills\r\nExperience the adrenaline rush of brutal combat, beheading your foes or casting spells that make enemies explode from within\r\n\r\n  Blood Dragon Armor\r\nCommissioned by an infamous Nevarran dragon hunter, this armor was crafted in a time when dragons had almost been hunted to extinction. Infused with their blood, the armor gained notoriety after the hunter died at the hands of men rather than the dragons it was designed to protect him from.\r\nGrants exceptional protection in combat\r\nArmor will be usable in BioWare&apos;s upcoming science fiction epic, Mass Effect 2\r\n\r\n  The Stone Prisoner\r\nThe darkspawn-infested village of Honnleath holds a secret: the forgotten stone figure at the town&#x2019;s heart is a powerful golem frozen in time. Free the creature and reveal a storied quest to unlock its power and mysterious past.\r\nDownload The Stone Prisoner and gain access to Shale, a mighty stone golem who can join the party and travel throughout Dragon Age: Origins. One of the most powerful characters in the game, Shale comes with a rich back story, extensive voice acting, and a unique follower quest to explore. The Stone Prisoner also includes new environments, items, and hours of additional gameplay that adds to the Dragon Age: Origins campaign.\r\nA powerful new party member to aid in the epic quest to save Ferelden from the Blight\r\nNew areas, including the troubled village of Honnleath\r\nNew achievements, items, and unique insights into the Dragon Age: Origins storyline","last_updated":"2018-10-01T12:11:43.983Z","parsed":{"xt":"urn:btih:3afd80ea17a11f41fa9ebf153d33f534f422ef30","dn":"Dragon Age Origins","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3afd80ea17a11f41fa9ebf153d33f534f422ef30","infoHashBuffer":{"type":"Buffer","data":[58,253,128,234,23,161,31,65,250,158,191,21,61,51,245,52,244,34,239,48]},"name":"Dragon Age Origins","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}