{"title":"A Spark of Light by Jodi Picoult EPUB","magnet":"magnet:?xt=urn:btih:3cf7c9dc038f15f4bb1b79b8fed2c6752e4c95d0&dn=A+Spark+of+Light+by+Jodi+Picoult+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"476121","seeders":"0","leechers":"0","description":"xx\r\n\r\nA Spark of Light by Jodi Picoult EPUB\r\n\r\nThe number-one New York Times best-selling author of Small Great Things returns with a powerful and provocative new novel about ordinary lives that intersect during a heart-stopping crisis. \r\n\r\nThe warm fall day starts like any other at the Center - a women&#x2019;s reproductive health services clinic - its staff offering care to anyone who passes through its doors. Then, in late morning, a desperate and distraught gunman bursts in and opens fire, taking all inside hostage. \r\n\r\nAfter rushing to the scene, Hugh McElroy, a police hostage negotiator, sets up a perimeter and begins making a plan to communicate with the gunman. As his phone vibrates with incoming text messages he glances at it and, to his horror, finds out that his 15-year-old daughter, Wren, is inside the clinic. \r\n\r\nBut Wren is not alone. She will share the next and tensest few hours of her young life with a cast of unforgettable characters: A nurse who calms her own panic in order to save the life of a wounded woman. A doctor who does his work not in spite of his faith but because of it, and who will find that faith tested as never before. A pro-life protester, disguised as a patient, who now stands in the cross hairs of the same rage she herself has felt. A young woman who has come to terminate her pregnancy. And the disturbed individual himself, vowing to be heard. \r\n\r\nTold in a daring and enthralling narrative structure that counts backward through the hours of the standoff, this is a story that traces its way back to what brought each of these very different individuals to the same place on this fateful day. \r\n\r\nJodi Picoult - one of the most fearless writers of our time - tackles a complicated issue in this gripping and nuanced novel. How do we balance the rights of pregnant women with the rights of the unborn they carry? What does it mean to be a good parent? A Spark of Light will inspire debate, conversation...and, hopefully, understanding. \r\n\r\n&#x201C;Picoult delivers another riveting yarn...in this carefully crafted, utterly gripping tale.&#x201D; (Booklist) \r\n\r\nxx","last_updated":"2018-10-02T12:25:03.510Z","parsed":{"xt":"urn:btih:3cf7c9dc038f15f4bb1b79b8fed2c6752e4c95d0","dn":"A Spark of Light by Jodi Picoult EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3cf7c9dc038f15f4bb1b79b8fed2c6752e4c95d0","infoHashBuffer":{"type":"Buffer","data":[60,247,201,220,3,143,21,244,187,27,121,184,254,210,198,117,46,76,149,208]},"name":"A Spark of Light by Jodi Picoult EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}