{"title":"The Smartest Places on Earth by Antoine van Agtmael EPUB","magnet":"magnet:?xt=urn:btih:3d04a353e0d3f952235b1264428b83bceac60cb3&dn=The+Smartest+Places+on+Earth+by+Antoine+van+Agtmael+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"20937228","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Smartest Places on Earth by Antoine van Agtmael EPUB\r\n\r\nAntoine van Agtmael coined the term &quot;emerging markets&quot; and built a career and a multibillion-dollar investing firm centered on these surging economies that would, over time, supplant the West as engines of wealth and prosperity. The trend held for decades, but a few years ago van Agtmael and Alfred Bakker, a renowned European journalist, began seeing signs that the tide might be turning. For example, during a visit to an enormously successful chip company in Taiwan, the company&apos;s leaders told them that their American competitors were now eating their lunch. And Taiwan was not the only place giving them this message.\r\n\r\nThus began a remarkable two-year journey to reassess the conventional wisdom that the US and Europe are yesterday&apos;s story and to determine whether there is something profound that is happening that points the way to the creation of the next economy.\r\n\r\nIn The Smartest Places on Earth, van Agtmael and Bakker present a truly hopeful and inspiring investigation into the emerging sources of a new era of competitiveness for America and Europe that are coming from unlikely places - those cities and areas once known as &quot;rustbelts&quot; that have, from an economic perspective, been written off. Take Akron, Ohio, whose economy for decades was dependent on industries such as tire manufacturing, a product now made cheaply elsewhere. In Akron and other such communities, a combination of forces - including visionary thinkers, government initiatives, start-ups making real products, and even big corporations - have succeeded in creating what van Agtmael and Bakker call a &quot;brainbelt&quot;. These &quot;brainbelts&quot; depend on a collaborative style of working that is unique to the societies and culture of America and Europe, since they involve levels of trust and freedom of thinking that can&apos;t be replicated elsewhere. They are producing products and technologies transforming industries such as vehicles and transportation, farming and food production, medical devices and health-care.\r\n\r\nFor several decades American and European industry focused on cost by outsourcing production to those emerging markets that can make things cheaper. The tide has now turned, as van Agtmael and Bakker report, to being smart, and the next emerging market, may, in fact, be the West.\r\n\r\nxx","last_updated":"2018-05-19T12:01:54.168Z","parsed":{"xt":"urn:btih:3d04a353e0d3f952235b1264428b83bceac60cb3","dn":"The Smartest Places on Earth by Antoine van Agtmael EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3d04a353e0d3f952235b1264428b83bceac60cb3","infoHashBuffer":{"type":"Buffer","data":[61,4,163,83,224,211,249,82,35,91,18,100,66,139,131,188,234,198,12,179]},"name":"The Smartest Places on Earth by Antoine van Agtmael EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}