{"title":"Anatomy of a Robot (gnv64)","magnet":"magnet:?xt=urn:btih:3e14866547524c6b373b2bf14e0c4c3e18231d08&dn=Anatomy+of+a+Robot+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"22608954","seeders":"3","leechers":"182","description":"Anatomy of a Robot: Literature, Cinema, and the Cultural Work of Artificial People\r\nby Despina Kakoudaki\r\nRutgers University Press | July 2014 | ISBN-10: 0813562155 | 256 pages | True PDF | 21.4 mb\r\n\r\n\tWhy do we find artificial people fascinating? Drawing from a rich fictional and cinematic tradition, Anatomy of a Robot explores the political and textual implications of our perennial projections of humanity onto figures such as robots, androids, cyborgs, and automata. In an engaging, sophisticated, and accessible presentation, Despina Kakoudaki argues that, in their narrative and cultural deployment, artificial people demarcate what it means to be human. They perform this function by offering us a non-human version of ourselves as a site of investigation. Artificial people teach us that being human, being a person or a self, is a constant process and often a matter of legal, philosophical, and political struggle.\r\n\tBy analyzing a wide range of literary texts and films (including episodes from Twilight Zone, the fiction of Philip K. Dick, Kazuo Ishiguro&apos;s novel Never Let Me Go, Metropolis, The Golem, Frankenstein, The Terminator, Iron Man, Blade Runner, and I, Robot), and going back to alchemy and to Aristotle&apos;s Physics and De Anima, she tracks four foundational narrative elements in this centuries-old discourse- the fantasy of the artificial birth, the fantasy of the mechanical body, the tendency to represent artificial people as slaves, and the interpretation of artificiality as an existential trope. What unifies these investigations is the return of all four elements to the question of what constitutes the human.\r\n\tThis focused approach to the topic of the artificial, constructed, or mechanical person allows us to reconsider the creation of artificial life.? By focusing on their historical provenance and textual versatility, Kakoudaki elucidates artificial people&apos;s main cultural function, which is the political and existential negotiation of what it means to be a person\r\n\r\nAbout the Author\r\nDESPINA KAKOUDAKI is an associate professor in the department of literature at American University in Washington, D.C.\r\n\r\nCONTENTS\r\nAcknowledgments ix\r\nIntroduction: Robot Anatomies 1\r\n1 The Artificial Birth 29\r\n2 The Mechanical Body 69\r\n3 The Mechanical Slave 114\r\n4 The Existential Cyborg 173\r\nConclusion: The Ends of the Human 212\r\nNotes 221\r\nIndex 245\r\n <a href=\"\nhttps://s8.postimg.cc/4a0txv51h/Anatomy_of_a_Robot.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s8.postimg.cc/4a0txv51h/Anatomy_of_a_Robot.jpg</a>","last_updated":"2018-08-21T12:10:23.005Z","parsed":{"xt":"urn:btih:3e14866547524c6b373b2bf14e0c4c3e18231d08","dn":"Anatomy of a Robot (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3e14866547524c6b373b2bf14e0c4c3e18231d08","infoHashBuffer":{"type":"Buffer","data":[62,20,134,101,71,82,76,107,55,59,43,241,78,12,76,62,24,35,29,8]},"name":"Anatomy of a Robot (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}