{"title":"Suffragettes with Lucy Worsley 2018 MP4 + subs BigJ0554","magnet":"magnet:?xt=urn:btih:3ec1beb7bebe13a83667e76226111effc02154d2&dn=Suffragettes+with+Lucy+Worsley+2018+MP4+%2B+subs+BigJ0554&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BigJ.0554","categoryP":"video","categoryS":"hd___tv_shows","size":"1749594926","seeders":"21","leechers":"8","description":"2018 marks 100 years since the first women over the age of 30, who owned property, were allowed to vote in the UK. The fight for the vote was about much more than just the Pankhurst family or Emily Davidson&apos;s fateful collision with the king&apos;s horse. In this film, Lucy is at the heart of the drama, alongside a group of less well known, but equally astonishing, young working-class suffragettes who decided to go against every rule and expectation that Edwardian society had about them.\r\nLucy explores the actions of these women as their campaign becomes more and more dangerous, while their own words are delivered in simple but strikingly emotive pieces of dramatised testimony. Lucy also tells this story from a range of iconic original locations, from the Houses of Parliament and 10 Downing Street to the Savoy Hotel, and has access to an amazing range of artefacts, from hunger-striking medals to defused bombs and private letters between the government and the press.\r\nIn this Edwardian history drama, Lucy and her group of suffragettes from the Women&apos;s Social Political Union reveal what life was like for these young women, as she follows the trail of increasingly illegal and dangerous acts they would end up committing. For while they would start with peaceful protests, but they would go from to obstruction to vandalism and finally to arson and bomb making.\r\nLucy investigates what drove them to break the law, to the prison conditions they experienced, including violent force feedings and the subsequent radicalisation of these women that occurred, driving them to more and more extreme actions. Lucy looks at the ways in which the press responded to the suffragettes and their own use of PR and branding to counteract the negative portrayals - from WSPU postcards to pennants and exhibitions.\r\n\r\nVideo: 540p MP4 H264 @3.0Mbps\r\nAudio: AAC 2ch @128Kbps\r\nSubtitles: English .SRT","last_updated":"2018-06-08T12:13:25.989Z","parsed":{"xt":"urn:btih:3ec1beb7bebe13a83667e76226111effc02154d2","dn":"Suffragettes with Lucy Worsley 2018 MP4   subs BigJ0554","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3ec1beb7bebe13a83667e76226111effc02154d2","infoHashBuffer":{"type":"Buffer","data":[62,193,190,183,190,190,19,168,54,103,231,98,38,17,30,255,192,33,84,210]},"name":"Suffragettes with Lucy Worsley 2018 MP4   subs BigJ0554","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}