{"title":"War of the Worlds (2005) 1080p DTS-HD HEVC Quovadis67","magnet":"magnet:?xt=urn:btih:3edb782cc0944e610178d15badf7ac40d27ea4c2&dn=War+of+the+Worlds+%282005%29+1080p+DTS-HD+HEVC+Quovadis67&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Quovadis67","categoryP":"video","categoryS":"hd___movies","size":"18127115473","seeders":"3","leechers":"9","description":"War of the Worlds 1080p DTS-HD 5.1 + Spanish AC3 HEVC / x265 all subs on disc included.\r\n\r\nVery High Quality Encode as can be evidenced by the unreasonably large file size.\r\n\r\n <a href=\"\nhttps://www.imdb.com/title/tt0407304/\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.imdb.com/title/tt0407304/</a>\r\n\r\n\r\nRare upload from me, number of downloaders to number of seeders pretty much destroyed my enthuisiasm for creating content but I&apos;ve decided I will still do occasional torrents if I&apos;m in the mood.\r\n\r\nI will probably seed continuously for a few days after which I&apos;ll add it to my pool of other torrents (90% Gryms, lets face it he sets the gold standard)\r\n\r\nps. A word about Cropping vs Aspect Ratio.\r\n\r\nI crop. That does not mean the aspect ratio is damaged. It just means the black bars are not encoded. Meta data associated with the video will allow most play back software to position the video correctly on your output device with black bars being displayed on any excess regions of the screen (vertically and/or horizontally) as disctated by the pixel count of the video.\r\n\r\nAspect ratio corruption only occurs if your playback software &quot;expands&quot; the video to full-screen and this is the only real benefit that enocding the black bars offers. For example if a video that has an active pixel count of 1920*800 is encoded as 1920*1080 then expaniding it to fill the screen (of a 1080p display) will not alter the image as the video playback software does not know that 280 lines of the video are just black bars. But if you did the same thing with a video encoded at 1920*800 the 800 lines of data will be extrapolated out into 1080 lines on your display and distortion will occur.\r\n\r\nSo FYI This video is almost full screen, with 20 pixel high black bars above and below. Free tools like MKVToolNix can easily be used to examine the stream contents of any multimedia container (like mkv) if you want to find out about the video dimensions of any particular video.\r\n\r\nLastly, idiots who complain about containers (like mkv) are just that. Idiots. There is no cure for stupid","last_updated":"2018-04-17T16:24:17.274Z","parsed":{"xt":"urn:btih:3edb782cc0944e610178d15badf7ac40d27ea4c2","dn":"War of the Worlds (2005) 1080p DTS-HD HEVC Quovadis67","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3edb782cc0944e610178d15badf7ac40d27ea4c2","infoHashBuffer":{"type":"Buffer","data":[62,219,120,44,192,148,78,97,1,120,209,91,173,247,172,64,210,126,164,194]},"name":"War of the Worlds (2005) 1080p DTS-HD HEVC Quovadis67","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}