{"title":"The Aesthetic Brain by Anjan Chatterjee EPUB","magnet":"magnet:?xt=urn:btih:3f04c15c356f55676ed7304ce722b04204397232&dn=The+Aesthetic+Brain+by+Anjan+Chatterjee+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"2031724","seeders":"70","leechers":"4","description":"xx\r\n\r\nThe Aesthetic Brain: How We Evolved to Desire Beauty and Enjoy Art by Anjan Chatterjee EPUB\r\n\r\nThe Aesthetic Brain takes the reader on a wide-ranging journey through the world of beauty, pleasure, and art. Chatterjee uses neuroscience to probe how an aesthetic sense is etched in our minds and evolutionary psychology to explain why aesthetic concerns feature centrally in our lives. Along the way, Chatterjee addresses fundamental questions: What is beauty? Is beauty universal? How is beauty related to pleasure? What is art? Should art be beautiful? Do we have an instinct for art? Chatterjee starts by probing the reasons that we find people, places, and even numbers beautiful. At the root of beauty, he finds, is pleasure. He then examines our pleasures by dissecting why we want and why we like food, sex, and money and how these rewards relate to aesthetic encounters. His ruminations on beauty and pleasure prepare him and the reader to face art. He wanders through the problems of defining art, understanding contemporary art, and interpreting ancient art. He explores why art, something that seems so useless, also feels fundamental to our humanity. Replete with facts, anecdotes, and analogies, this empirical guide to aesthetics offers scientific answers without deflating the wonders of beauty and art.\r\n\r\nxx","last_updated":"2018-09-22T12:26:57.754Z","parsed":{"xt":"urn:btih:3f04c15c356f55676ed7304ce722b04204397232","dn":"The Aesthetic Brain by Anjan Chatterjee EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3f04c15c356f55676ed7304ce722b04204397232","infoHashBuffer":{"type":"Buffer","data":[63,4,193,92,53,111,85,103,110,215,48,76,231,34,176,66,4,57,114,50]},"name":"The Aesthetic Brain by Anjan Chatterjee EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}