{"title":"What Truth Sounds Like by Michael Eric Dyson EPUB","magnet":"magnet:?xt=urn:btih:3f712f8994c5f8b56ae4d7c266a73cc60d5420ae&dn=What+Truth+Sounds+Like+by+Michael+Eric+Dyson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"903127","seeders":"0","leechers":"0","description":"xx\r\n\r\nWhat Truth Sounds Like by Michael Eric Dyson EPUB\r\n\r\nWhat Truth Sounds Like is a timely exploration of America&apos;s tortured racial politics that continues the conversation from Michael Eric Dyson&apos;s New York Times best seller Tears We Cannot Stop. \r\n\r\nPresident Barack Obama: &quot;Everybody who speaks after Michael Eric Dyson pales in comparison.&quot; \r\n\r\nIn 2015, BLM activist Julius Jones confronted presidential candidate Hillary Clinton with an urgent query: &quot;What in your heart has changed that&apos;s going to change the direction of this country?&quot; &quot;I don&apos;t believe you just change hearts&quot;, she protested. &quot;I believe you change laws.&quot; \r\n\r\nThe fraught conflict between conscience and politics - between morality and power - in addressing race hardly began with Clinton. An electrifying and traumatic encounter in the &apos;60s crystallized these furious disputes. \r\n\r\nIn 1963, Attorney General Robert Kennedy sought out James Baldwin to explain the rage that threatened to engulf black America. Baldwin brought along some friends, including playwright Lorraine Hansberry, psychologist Kenneth Clark, and a valiant activist, Jerome Smith. It was Smith&apos;s relentless, unfiltered fury that set Kennedy on his heels, reducing him to sullen silence. \r\n\r\nKennedy walked away from the nearly three-hour meeting angry - that the black folk assembled didn&apos;t understand politics, and that they weren&apos;t as easy to talk to as Martin Luther King. But especially that they were more interested in witness than policy. But Kennedy&apos;s anger quickly gave way to empathy, especially for Smith. &quot;I guess if I were in his shoes...I might feel differently about this country.&quot; Kennedy set about changing policy - the meeting having transformed his thinking in fundamental ways. \r\n\r\n..\r\n\r\nxx","last_updated":"2018-06-06T12:03:29.064Z","parsed":{"xt":"urn:btih:3f712f8994c5f8b56ae4d7c266a73cc60d5420ae","dn":"What Truth Sounds Like by Michael Eric Dyson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3f712f8994c5f8b56ae4d7c266a73cc60d5420ae","infoHashBuffer":{"type":"Buffer","data":[63,113,47,137,148,197,248,181,106,228,215,194,102,167,60,198,13,84,32,174]},"name":"What Truth Sounds Like by Michael Eric Dyson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}