{"title":"LED ZEPPELIN - Companion Discs Compilation 2CD 24 Tracks FLAC","magnet":"magnet:?xt=urn:btih:405be4ee04b6cae7c961a2f7730382d2e446da29&dn=LED+ZEPPELIN+-+Companion+Discs+Compilation+2CD+24+Tracks+FLAC&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"mysterioso","categoryP":"audio","categoryS":"flac","size":"800140859","seeders":"15","leechers":"10","description":"LED ZEPPELIN - Companion Discs Compilation 2CD 24 Tracks FLAC\r\n\r\nA compilation of some of the more interesting tracks from the Led Zeppelin \r\nreissue/remaster companion discs.\r\n\r\n\r\nDisc One = 61:34\r\n\r\n01 - WHOLE LOTTA LOVE (Rough Mix with Vocal) (Different vocal track, back to original after solo section, breakdown section is much simpler with much less theremin, no solo guitar track)\r\n\r\n02 - THE SONG REMAINS THE SAME (Guitar Overdub Reference Mix) (No vocals, alternate guitar tracks)\r\n\r\n03 - THE RAIN SONG (Mix Minus Piano)\r\n\r\n04 - WE&apos;RE GONNA GROOVE (Alternate Mix) (More vocals. Differences in guitar takes starting around 1:15. Vocal addition around 1:30)\r\n\r\n05 - SUGAR MAMA (Mix) (Zep I era)\r\n\r\n06 - ST. TRISTAN&apos;S SWORD (Rough Mix) (Zep III era)\r\n\r\n07 - THE EPIC (CAROUSELAMBRA) (Rough Mix) (Fewer keyboard overdubs, the bass guitar is turned down slightly, and the guitar and vocals are brought more forward in the mix in the first portion of the song)\r\n\r\n08 - LA LA (Intro Outro Rough Mix) (Backing Track) (Zep II era)\r\n\r\n09 - KEY TO THE HIGHWAY / TROUBLE IN MIND (Rough Mix) (Zep III era)\r\n\r\n10 - WALTERS WALK (Rough Mix) (No vocals Repeats intro at 1:15)\r\n\r\n11 - SICK AGAIN (Early Version) (No Vocals, Jimmy on Bass)\r\n\r\n12 - THE IMMIGRANT SONG (Alternate Mix) (Less reverb, slightly different outro vocals)\r\n\r\n13 - DESIRE (The Wanton Song) (Rough Mix) (John Paul Jones on clavinet, fewer overdubs and Plant&apos;s vocals are clearer)\r\n\r\n\r\nDisc Two = 60:01\r\n\r\n01 - IN THE EVENING (Rough Mix) (Slightly different intro. Vocals are dry (whereas the 1979-issued mix has delay applied). A flute-like counter melody appears at approx. 4:30)\r\n\r\n02 - BRANDY &amp; COKE (Trampled Under Foot) (Initial Rough Mix) (Fewer guitar overdubs, no bass guitar and the drum track is brought forward more)\r\n\r\n03 - IF IT KEEPS ON RAINING (When the Levee Breaks) (Rough Mix) (Early version, faster, has different lyrics, an intro that is accompanied by a bass riff, and is shorter by 3 minutes)\r\n\r\n04 - Bathroom Sound (Out on the Tiles) (No Vocal)\r\n\r\n05 - Friends (A different version of the Led Zeppelin III track played along with the Bombay Orchestra)\r\n\r\n06 - 10 Ribs &amp; All Carrot Pod Pod (Reference Mix from Presence era)\r\n\r\n07 - Heartbreaker (Rough Mix with Vocal) (Different guitar track for the first solo (before the drums and bass come in)\r\n\r\n08 - Bring It On Home (Rough Mix) (Version of the Led Zeppelin II track, strictly the middle part (not the blues cover intro outro)\r\n\r\n09 - Jennings Farm Blues (Bron-Y-Aur Stomp) (Rough Mix of All Guitar Overdubs That Day)\r\n\r\n10 - Everybody Makes It Through (In the Light) (Rough Mix) (A conglomerate version of the Physical Graffiti (Deluxe Edition) vocal track with the drums and drone of the Physical Graffiti track In the Light)\r\n\r\n11 - Everybody Makes It Through (In the Light) (Early Version In Transit) (It features a different structure and alternate lyrics. Also, a different clavinet riff is used in the opening and throughout the track)","last_updated":"2018-03-25T12:19:30.186Z","parsed":{"xt":"urn:btih:405be4ee04b6cae7c961a2f7730382d2e446da29","dn":"LED ZEPPELIN - Companion Discs Compilation 2CD 24 Tracks FLAC","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"405be4ee04b6cae7c961a2f7730382d2e446da29","infoHashBuffer":{"type":"Buffer","data":[64,91,228,238,4,182,202,231,201,97,162,247,115,3,130,210,228,70,218,41]},"name":"LED ZEPPELIN - Companion Discs Compilation 2CD 24 Tracks FLAC","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}