{"title":"Brass_ A Novel by Xhenet Aliu EPUB","magnet":"magnet:?xt=urn:btih:408e1f3372d63fe9b0d583027d47b56e29d77c13&dn=Brass_+A+Novel+by+Xhenet+Aliu+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1070555","seeders":"13","leechers":"2","description":"xx\r\n\r\nBrass_ A Novel by Xhenet Aliu EPUB\r\n\r\n&quot;A fierce, big-hearted, unflinching debut&quot; (Celeste Ng, author of Little Fires Everywhere) novel about mothers and daughters, haves and have-nots, and the stark realities behind the American dream\r\n\r\nA waitress at the Betsy Ross Diner, Elsie hopes her nickel-and-dime tips will add up to a new life. Then she meets Bashkim, who is at once both worldly and na&#xEF;ve, a married man who left Albania to chase his dreams - and wound up working as a line cook in Waterbury, Connecticut. Back when the brass mills were still open, this bustling factory town drew one wave of immigrants after another. Now it&apos;s the place they can&apos;t seem to leave. Elsie, herself the granddaughter of Lithuanian immigrants, falls in love quickly, but when she learns that she&apos;s pregnant, Elsie can&apos;t help wondering where Bashkim&apos;s heart really lies and what he&apos;ll do about the wife he left behind.\r\n\r\nSeventeen years later, headstrong and independent Luljeta receives a rejection letter from NYU and her first-ever suspension from school on the same day. Instead of striking out on her own in Manhattan, she&apos;s stuck in Connecticut with her mother, Elsie - a fate she refuses to accept. Wondering if the key to her future is unlocking the secrets of the past, Lulu decides to find out what exactly her mother has been hiding about the father she never knew. As she soon discovers, the truth is closer than she ever imagined.\r\n\r\nTold in equally gripping parallel narratives with biting wit and grace, Brass announces a fearless new voice with a timely, tender, and quintessentially American story.\r\n\r\nxx","last_updated":"2018-01-27T12:06:22.242Z","parsed":{"xt":"urn:btih:408e1f3372d63fe9b0d583027d47b56e29d77c13","dn":"Brass_ A Novel by Xhenet Aliu EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"408e1f3372d63fe9b0d583027d47b56e29d77c13","infoHashBuffer":{"type":"Buffer","data":[64,142,31,51,114,214,63,233,176,213,131,2,125,71,181,110,41,215,124,19]},"name":"Brass_ A Novel by Xhenet Aliu EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}