{"title":"Welcome to Your Crisis by Laura Day EPUB","magnet":"magnet:?xt=urn:btih:40f17cfc8bdd735af0da7d93f8a035eaa0808ad6&dn=Welcome+to+Your+Crisis+by+Laura+Day+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"269472","seeders":"0","leechers":"0","description":"xx\r\n\r\nWelcome to Your Crisis: How to Use the Power of Crisis to Create the Life You Want by Laura Day EPUB\r\n\r\nThe moment your life falls apart is also the moment your new life begins, says Laura Day. It is the moment when illusion and deception fall away and naked truth emerges. Crisis can be extraordinarily painful. But, when approached head-on, it can also be a source of power, hope, and vision, and the start of the life you really want. Best-selling author Laura Day has helped countless individuals through their life&apos;s worst moments: the death of a loved one, the end of a marriage or friendship, the loss of a job. In this inspirational new book, she draws from that depth of experience to guide her readers out of crisis and toward the flourishing lives beyond, providing step-by-step advice and exercises that are as practical as they are revolutionary.\r\n\r\nCrisis can be the most authentic version of self-transformation. Points of crisis bring us face-to-face with our deepest doubts and fears, and our most essential aspirations. And this means that our response to change is every bit as important as the change itself. Laura Day identifies several types of reactions to crisis, people may respond with denial, anxiety, rage, or depression. She tells readers how to rethink each response, and she gives practical and personalized tools for turning the lowest times of life into life&apos;s greatest gift. Through the exercises, rituals, and activities Day prescribes, readers can learn the best practices for rebuilding a more meaningful life. Getting through crisis is part acceptance, part reinvention, and this book provides invaluable lessons for closing one life chapter and beginning the next. Remember, as Laura Day says: Rock bottom can be the best place to start.\r\n\r\nxx","last_updated":"2018-07-03T12:00:40.884Z","parsed":{"xt":"urn:btih:40f17cfc8bdd735af0da7d93f8a035eaa0808ad6","dn":"Welcome to Your Crisis by Laura Day EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"40f17cfc8bdd735af0da7d93f8a035eaa0808ad6","infoHashBuffer":{"type":"Buffer","data":[64,241,124,252,139,221,115,90,240,218,125,147,248,160,53,234,160,128,138,214]},"name":"Welcome to Your Crisis by Laura Day EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}