{"title":"American Entrepreneur by Willie Robertson, William Doyle (.epub)","magnet":"magnet:?xt=urn:btih:4143528d2d28cb0ed9987ed31c00cafc62cc009b&dn=American+Entrepreneur+by+Willie+Robertson%2C+William+Doyle+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"11051607","seeders":"0","leechers":"0","description":"American Entrepreneur: How 400 Years of Risk-Takers, Innovators, and Business Visionaries Built the U.S.A. by Willie Robertson, William Doyle\r\n\r\nRequirements: .ePUB Reader\r\n\r\nOverview: America is the ultimate start-up venture &#x2013; and these are the heroes who made it happen\r\n\r\nThe history of the United States is, to a remarkable degree, the story of its entrepreneurs, those daring movers and shakers who dreamed big and risked everything to build better lives for themselves, and their fellow Americans. In American Entrepreneur, Duck Commander CEO and star of the blockbuster Duck Dynasty series Willie tells the captivating true tale of the visionaries and doers who have embodied the American Dream.\r\n\r\nWe begin with the first American entrepreneurs, the Native Americans, who established a highly sophisticated commercial network across the land in the precolonial days. The original Founding Father, George Washington, was also a founding entrepreneur, at the head of a thriving agri-business venture that gave him the executive skills to steer the nation through the darkest hours of the revolution. Then, of course, there were the Mega-entrepreneurs, legendary figures like Astor, Vanderbilt, Carnegie, and Rockefeller, who transformed America, connected the country with miles of railroad track and supplied the fuel and steel that would help make this country the most powerful nation on earth. And in recent years, business visionaries from Jobs to Gates to Zuckerberg, not to mention the thousands of equally vital, yet smaller-scale, operators that spring up every year, have ushered America into the 21st century.\r\n\r\nGenre: Non-Fiction &gt; Biographies &amp; Memoirs","last_updated":"2018-11-21T12:18:39.956Z","parsed":{"xt":"urn:btih:4143528d2d28cb0ed9987ed31c00cafc62cc009b","dn":"American Entrepreneur by Willie Robertson, William Doyle (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4143528d2d28cb0ed9987ed31c00cafc62cc009b","infoHashBuffer":{"type":"Buffer","data":[65,67,82,141,45,40,203,14,217,152,126,211,28,0,202,252,98,204,0,155]},"name":"American Entrepreneur by Willie Robertson, William Doyle (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}