{"title":"Set the Boy Free by Johnny Marr EPUB","magnet":"magnet:?xt=urn:btih:41818cd1d0f1f441370e86b868a47cb1e7724e8d&dn=Set+the+Boy+Free+by+Johnny+Marr+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5370105","seeders":"0","leechers":"0","description":"xx\r\n\r\nSet the Boy Free by Johnny Marr EPUB\r\n\r\nThe long-awaited memoir from the legendary guitarist and cofounder of the seminal British band The Smiths.\r\n\r\nAn artist who helped define a period in popular culture, Johnny Marr tells his story in a memoir as vivid and arresting as his music. The Smiths, the band with the signature sound he cofounded, remains one of the most beloved bands ever and have had a profound influence on a number of acts that followed - from the Stone Roses, Suede, Blur, and Radiohead to Oasis, The Libertines, and Arctic Monkeys.\r\n\r\nMarr recalls his childhood growing up in the northern working-class city of Manchester, in a house filled with music. He takes us back to the summer of 1982, when, at 18, he sought out one Stephen Morrissey to form a new band they called The Smiths. Marr invites fans onstage, on the road, and in the studio for the five years The Smiths were together and shares how, after a rapid ascent, the working-class teenage rock star enjoyed and battled with the perks of success until ideological differences, combined with his much publicized strained relationships with his bandmates, caused him to leave in 1987. Marr&apos;s &quot;escape&quot;, as he calls it, ensured the beginning of the end for one of the most influential groups of a generation.\r\n\r\nBut The Smiths&apos; end was only the beginning for Marr. The bona fide guitar hero continues to experiment and evolve in his solo career to this day, playing with Paul McCartney, Pretenders, Modest Mouse, and Oasis and collaborating with today&apos;s most creative and renowned artists.\r\n\r\nRising above and beyond the personal struggles and bitter feuds, Marr delivers the story of his music and his band, sharing the real insights of a man who has made music his life and finally giving fans what they&apos;ve truly been waiting for.\r\n\r\nxx","last_updated":"2018-01-31T12:00:56.485Z","parsed":{"xt":"urn:btih:41818cd1d0f1f441370e86b868a47cb1e7724e8d","dn":"Set the Boy Free by Johnny Marr EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"41818cd1d0f1f441370e86b868a47cb1e7724e8d","infoHashBuffer":{"type":"Buffer","data":[65,129,140,209,208,241,244,65,55,14,134,184,104,164,124,177,231,114,78,141]},"name":"Set the Boy Free by Johnny Marr EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}