{"title":"Future Presence: How Virtual Reality .. by Peter Rubin EPUB","magnet":"magnet:?xt=urn:btih:418a2719cbcc1fb6a3026e86be654cc11c989568&dn=Future+Presence%3A+How+Virtual+Reality+..+by+Peter+Rubin+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2774548","seeders":"0","leechers":"0","description":"xx\r\n\r\nFuture Presence: How Virtual Reality .. by Peter Rubin EPUB\r\n\r\nA Wired senior editor and virtual reality expert presents a captivating, candid glimpse into the future &quot;realities&quot; of this emerging technology: how we will use it to form previously impossible relationships, explore new frontiers of intimacy, and how it will forever change human connection.\r\n\r\nHeralded as the most significant technological innovation since the smartphone, virtual reality is poised to transform our very notions of life and humanity. Though this tech is still in its infancy, to those on the inside, it is the future. VR will change how we work, how we experience entertainment, how we feel pleasure and other emotions, how we see ourselves, and most importantly, how we relate to each other in the real world. And we will never be the same.\r\n\r\nPeter Rubin, senior culture editor for Wired and the industry&apos;s go-to authority on the subject, calls it an &quot;intimacy engine&quot;. While once we needed another person to feel the sensations of closeness, trust, vulnerability, confidence, and titillation, VR will give us the ability to induce these sensations by ourselves for the first time in human history. This metamorphosis, Rubin argues, is going to have a powerful impact on relationships that will ripple throughout our society and our individual lives.\r\n\r\nA journey into this uncertain future and a glimpse at the cultural implications and promises of a new reality, Future Presence explores a host of complex questions about what makes us human, what connects us, and what is real. Offering a glimpse into the mind-blowing things happening in universities, labs, and tech companies around the world, Rubin leads readers on an entertaining tour of the weirdest, wildest corners of this fascinating new universe. Describing this book as &quot;half travelogue and half crystal ball&quot;, Rubin will: \r\n\r\nIntroduce readers to the creators and consumers of VR technology \r\n\r\nShow readers what an experience is like inside the current VR devices \r\n\r\nExplain how this technology will upend everything we know about human connection in the future \r\n\r\n..\r\n\r\nxx","last_updated":"2018-05-02T12:08:42.932Z","parsed":{"xt":"urn:btih:418a2719cbcc1fb6a3026e86be654cc11c989568","dn":"Future Presence: How Virtual Reality .. by Peter Rubin EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"418a2719cbcc1fb6a3026e86be654cc11c989568","infoHashBuffer":{"type":"Buffer","data":[65,138,39,25,203,204,31,182,163,2,110,134,190,101,76,193,28,152,149,104]},"name":"Future Presence: How Virtual Reality .. by Peter Rubin EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}