{"title":"My Raspberry Pi Collector's Edition app for android","magnet":"magnet:?xt=urn:btih:425e113bcd5c2aae0206e473ac68270850e01a34&dn=My+Raspberry+Pi+Collector%27s+Edition+app+for+android&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Apptyze","categoryP":"applications","categoryS":"android","size":"12715291","seeders":"0","leechers":"0","description":"The Raspberry Pi Song is a love song dedicated to the infamous single-board computer known as Rasberry Pi. In this record, the Raspberry Pi adventurer, cryptocurrency enthusiast, entertainer, and hip-hop artist/lyricist Saint Ignatius of Cyberspace parallels love to computing by drawing on his previous experience of dysfunctional dating relationships, emphasizing that he would rather choose the single board computer as a partner. \r\n\r\nIn this Collector&apos;s Edition listeners will also have the ability to stream and download the single &quot;My Raspberry Pi (A Love Song),&quot; and set the song as a ringtone. In addition, the application includes the lyrics which can be read along during song play, a downloadable Collector&apos;s Edition Graffiti Art on a Raspberry Pi background Wallpaper, a Raspberry Pi Hacks video feed, social media, and more.\r\n\r\nThe Raspberry Pi Song will also be featured in the up and coming album &quot;Binary Gospell EP&quot; by Saint Ignatius of Cyberspace, which is a Raspberry Pi project currently in the works, and will be recorded on a Raspberry Pi 3 B+, and is expected to be completed sometime by end of 2018.\r\n\r\n <a href=\"\nhttp://www.saintignati.us\" rel=\"nofollow\" target=\"_NEW\">\nhttp://www.saintignati.us</a>    <a href=\"\nhttp://www.apptyze.com\" rel=\"nofollow\" target=\"_NEW\">\nhttp://www.apptyze.com</a>\r\n\r\n\r\nMusic used: Hello Mr. Princeton by Otis McDonald \r\nLicensed under Creative Commons Attribution 3.0\r\n\r\nBTC: 1Pu1ymV3gb622E3GcTRPt2YZmomMzKyHES\r\nETH: 0x700f358098df656c57abecb2c61f664efdd1f97d\r\nLTC: LTbXoG7UXaLhJCA1dbyoCgQvc2mSR67eTk\r\n\r\nBinary Gospell EP (The Album):\r\n\r\nThe Binary Gospell EP is a Raspberry Pi project currently in the works and is a hip-hop studio album by Saint Ignatius of Cyberspace, expected to be fully completed and launched by end of 2018. The album will focus on delivering a sound that resonates with the uplifting soulful and funky &apos;90&apos;s era sample based conscious hip-hop with an overtone of live instrument play (ex. The Roots), while the lyrical content and rhymes will be driven by principles of lyricism which will cover a wide range of topics belonging to the lifestyle of a typical millennial geek (ex. Saint Ignatius of Cyberspace)","last_updated":"2018-08-26T12:04:45.309Z","parsed":{"xt":"urn:btih:425e113bcd5c2aae0206e473ac68270850e01a34","dn":"My Raspberry Pi Collector's Edition app for android","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"425e113bcd5c2aae0206e473ac68270850e01a34","infoHashBuffer":{"type":"Buffer","data":[66,94,17,59,205,92,42,174,2,6,228,115,172,104,39,8,80,224,26,52]},"name":"My Raspberry Pi Collector's Edition app for android","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}