{"title":"Digital Film Tools PhotoCopy 2.0.11 (x64) Pre-Activated[BabuPC]","magnet":"magnet:?xt=urn:btih:43af33851b6b661857c7b9a5d227f8ad5e649815&dn=Digital+Film+Tools+PhotoCopy+2.0.11+%28x64%29+Pre-Activated%5BBabuPC%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BabuPC","categoryP":"applications","categoryS":"windows","size":"63685009","seeders":"6","leechers":"3","description":"[img]http://babupc.com/wp-content/uploads/2018/10/Digital-Film-Tools-PhotoCop.gif[/img]\r\n\r\nDigital Film Tools PhotoCopy\r\n\r\nSoftware that creates a photographic reproduction of a printed or graphic work made with a process in which a new image is formed by the action of proprietary image analysis, color, texture and light. Whether it&#x2019;s still or moving images, the key attributes are copied from one image and applied to another.\r\n\r\nWe have painstakingly analyzed the brightness, color, tone, detail, grain and texture of some of the world&#x2019;s greatest movies, paintings, photographs and historical photographic processes. The DNA of these masterpieces can now be applied to your very own images with PhotoCopy. The color, tone and brightness of the original work are replicated while the texture, grain and detail are simulated.\r\n\r\nHave some images that you would like to copy and apply their attributes to other images? No problem. Just create, save and apply these custom presets to other images. Make any picture look interesting. Good, bad, ugly&#x2014;PhotoCopy doesn&#x2019;t care. You supply the image, we supply the secret sauce. Combine the two and create a new work of art.\r\nPhotoCopy Features:\r\n\r\n&#x2013; Pick from 94 Academy Award nominated movies including Apocalypse Now, Blade Runner, Frankenstein, Gone with the Wind, King Kong and The Lord of the Rings\r\n&#x2013; Choose from 72 paintings from artists such as Cezanne, Chagall, Greco, Leonardo, Monet, Rembrandt, Renoir and Van Gogh to name a few\r\n&#x2013; Select from 40 photographs by various masters of photography including Abbott, Andreev, Cunningham, Fenton, Nadar, Outerbridge, Stieglitz and Weston\r\n&#x2013; Try one of 30 historical processes, some of which are Ambrotype, Cyanotype, Liquid Emulsion, Kallitype, Palladium, Salt Print, Vandyke and Wet Plate\r\n&#x2013; Search for images to copy using one of our many preset searches that include famous movies, painters, photographers, historical processes or do your own custom search","last_updated":"2018-10-28T12:20:05.258Z","parsed":{"xt":"urn:btih:43af33851b6b661857c7b9a5d227f8ad5e649815","dn":"Digital Film Tools PhotoCopy 2.0.11 (x64) Pre-Activated[BabuPC]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"43af33851b6b661857c7b9a5d227f8ad5e649815","infoHashBuffer":{"type":"Buffer","data":[67,175,51,133,27,107,102,24,87,199,185,165,210,39,248,173,94,100,152,21]},"name":"Digital Film Tools PhotoCopy 2.0.11 (x64) Pre-Activated[BabuPC]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}