{"title":"Dreamland by Sam Quinones EPUB","magnet":"magnet:?xt=urn:btih:4495aacdc3ed26da8ae1155deb8daee5606009cd&dn=Dreamland+by+Sam+Quinones+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1007557","seeders":"35","leechers":"4","description":"xx\r\n\r\nDreamland: The True Tale of America&apos;s Opiate Epidemic by Sam Quinones EPUB\r\n\r\nIn 1929, in the blue-collar city of Portsmouth, Ohio, a company built a swimming pool the size of a football field; named Dreamland, it became the vital center of the community. Now, addiction has devastated Portsmouth, as it has hundreds of small rural towns and suburbs across America - addiction like no other the country has ever faced. How that happened is the riveting story of Dreamland. With a great reporter&apos;s narrative skill and the storytelling ability of a novelist, acclaimed journalist Sam Quinones weaves together two classic tales of capitalism run amok whose unintentional collision has been catastrophic. The unfettered prescribing of pain medications during the 1990s reached its peak in Purdue Pharma&apos;s campaign to market OxyContin, its new, expensive - and extremely addictive - miracle painkiller. Meanwhile a massive influx of black tar heroin - cheap, potent, and originating from one small county on Mexico&apos;s west coast, independent of any drug cartel - assaulted small towns and midsized cities across the country, driven by a brilliant, almost unbeatable marketing and distribution system. Together these phenomena continue to lay waste to communities from Tennessee to Oregon, Indiana to New Mexico. Introducing a memorable cast of characters - pharma pioneers, young Mexican entrepreneurs, narcotics investigators, survivors, and parents - Quinones shows how these tales fit together. Dreamland is a revelatory account of the corrosive threat facing America and its heartland.\r\n\r\nxx","last_updated":"2018-06-29T12:14:30.885Z","parsed":{"xt":"urn:btih:4495aacdc3ed26da8ae1155deb8daee5606009cd","dn":"Dreamland by Sam Quinones EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4495aacdc3ed26da8ae1155deb8daee5606009cd","infoHashBuffer":{"type":"Buffer","data":[68,149,170,205,195,237,38,218,138,225,21,93,235,141,174,229,96,96,9,205]},"name":"Dreamland by Sam Quinones EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}