{"title":"How to Get Sh*t Done by Erin Falconer (.epub)","magnet":"magnet:?xt=urn:btih:44b80ebcb7909efad1d9153edf3256ffc77c7fee&dn=How+to+Get+Sh%2At+Done+by+Erin+Falconer+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"3438016","seeders":"78","leechers":"8","description":"How to Get Sh*t Done: Why Women Need to Stop Doing Everything so They Can Achieve Anything by Erin Falconer\r\n\r\nRequirements: .ePUB Reader\r\n\r\nOverview: Erin Falconer, editor in chief and co-owner of the highly respected self-improvement site Pick the Brain (with over 1.8 million monthly page views), shows overscheduled, overwhelmed women how to do less so that they can achieve more.\r\nWomen live in a state of constant guilt: that we&#x2019;re not doing enough, that we&#x2019;re not good enough, that we can&#x2019;t keep up. If we&#x2019;re not climbing the corporate ladder, building our side hustle, preparing home-cooked meals, tucking the kids in at night, meditating daily, and scheduling playdates, date nights, and girls&#x2019; nights every week, we feel like we&#x2019;re not living our best lives. Yet traditional productivity books&#x2014;written by men&#x2014;barely touch the tangle of cultural pressures that women feel when facing down a to-do list.\r\nFinally, in the first productivity book by a woman in a decade, Erin Falconer will show you how to do less&#x2014;a lot less. In fact, How to Get Sh*t Done will teach you how to zero in on the three areas of your life where you want to excel, and then it will show you how to off-load, outsource, or just stop giving a damn about the rest. As the founder of two technology start-ups and one of Refinery29&#x2019;s Top 10 Women Changing the Digital Landscape for Good, Erin has seen what happens when women chase an outdated, patriarchal model of productivity, and in How to Get Sh*t Done she shows how even the most perfectionistic among us can tap into our inner free spirit and learn to feel like badasses, rather than drudges.\r\nPacked with real-life advice, honest stories from Erin&#x2019;s successful career, and dozens of actionable resources, How to Get Sh*t Done will forever reframe productivity so that you can stop doing everything for everyone and start doing what matters to you.\r\n\r\nGenre: &#xA0;Non-Fiction &gt; Self-Help &gt; Time Management","last_updated":"2018-09-24T12:43:00.729Z","parsed":{"xt":"urn:btih:44b80ebcb7909efad1d9153edf3256ffc77c7fee","dn":"How to Get Sh*t Done by Erin Falconer (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"44b80ebcb7909efad1d9153edf3256ffc77c7fee","infoHashBuffer":{"type":"Buffer","data":[68,184,14,188,183,144,158,250,209,217,21,62,223,50,86,255,199,124,127,238]},"name":"How to Get Sh*t Done by Erin Falconer (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}