{"title":"Abandoned and Unseen by Carrie Ann Ryan, Alexandra Ivy EPUB","magnet":"magnet:?xt=urn:btih:44ee415d22c826401c6147e5ffc4da9af633a4f7&dn=Abandoned+and+Unseen+by+Carrie+Ann+Ryan%2C+Alexandra+Ivy+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"237677","seeders":"0","leechers":"0","description":"xx\r\n\r\nAbandoned and Unseen by Carrie Ann Ryan, Alexandra Ivy EPUB\r\n\r\nThe next in a new dark and gritty paranormal series. Abandoned and Unseen continues the journey with New York Times best-selling authors Alexandra Ivy and Carrie Ann Ryan.\r\n\r\nAbandoned\r\n\r\nWhen bear shifter Anya Tucker fell in love with the wrong man, the only thing she left with was a broken heart - and her two bear cubs. Now, she&apos;s mended her wounds and learned that in order to raise her babies, she can only trust herself. When her sons meet the lazy cat next door and fall heads over tails for him, she&apos;ll do whatever she takes to protect them - even from a past she&apos;d thought she&apos;d left behind.\r\n\r\nCole McDermott is a jaguar on a mission. Long naps, a willing woman, and a full stomach is usually all he needs when it comes to relaxing after a long day of protecting his pack. Then he meets Anya, and the burn of temptation is silky and tantalizing indeed. When a horror from Anya&apos;s past threatens everything she loves, Cole will put everything aside and fight for her family - as well as his own.\r\n\r\nUnseen\r\n\r\nNicole Bradley had no reason to live after the humans murdered her son - not until she learns to hunt down those responsible for his death. Shifting into her wolf form at night, she slips out of the compound, determined to do as much damage as possible. The last thing she expected was to discover secrets that could destroy the SAU.\r\n\r\nPolar shifter Tucker Stone lives off the grid. It&apos;s the only way the unseen can avoid being rounded up by the humans and tossed into a compound. Besides, he&apos;s a loner by nature. But he can&apos;t walk away when he sees the pretty female wolf in danger. Risking exposure, he takes her to his hidden den and tries to heal her wounds.\r\n\r\nCan a reclusive polar bear and a wolf with a death wish find happiness together?\r\n\r\nxx","last_updated":"2018-05-08T12:00:38.709Z","parsed":{"xt":"urn:btih:44ee415d22c826401c6147e5ffc4da9af633a4f7","dn":"Abandoned and Unseen by Carrie Ann Ryan, Alexandra Ivy EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"44ee415d22c826401c6147e5ffc4da9af633a4f7","infoHashBuffer":{"type":"Buffer","data":[68,238,65,93,34,200,38,64,28,97,71,229,255,196,218,154,246,51,164,247]},"name":"Abandoned and Unseen by Carrie Ann Ryan, Alexandra Ivy EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}