{"title":"The Lost Detective by Nathan Ward EPUB","magnet":"magnet:?xt=urn:btih:4516ed9606279a448d06a1ff40a3c86fb2ba39c0&dn=The+Lost+Detective+by+Nathan+Ward+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1158029","seeders":"16","leechers":"10","description":"xx\r\n\r\nThe Lost Detective by Nathan Ward EPUB\r\n\r\nBefore he became a household name in America as perhaps our greatest hard-boiled crime writer, before his attachment to Lillian Hellman and blacklisting during the McCarthy era, and his subsequent downward spiral, Dashiell Hammett led a life of action. Born in 1894 into a poor Maryland family, Hammett left school at 13 and held several jobs before joining the Pinkerton National Detective Agency as an operative in 1915. With time off in 1918 to serve at the end of World War I, he remained with the agency until 1922, participating in the banal and dramatic actions alike of an operative. The tuberculosis he contracted during the war forced him to leave the Pinkertons - but it may well have prompted one of America&apos;s most acclaimed writing careers.\r\n\r\nWhile Hammett&apos;s life on center stage has been well-documented, the question of how he got there has not. That largely overlooked phase is the subject of Nathan Ward&apos;s enthralling The Lost Detective. Hammett&apos;s childhood, his life in San Francisco, and especially his experience as a detective deeply informed his writing and his characters, from the nameless Continental Op to Sam Spade and Nick Charles. The success of his many stories in the pulp magazine Black Mask led him to novels; he would write five between 1929 and 1934, two of them (The Maltese Falcon and The Thin Man) now American classics. Though he inspired generations of writers, after The Thin Man he never finished another book - a painful silence for his devoted fans - and his popular image has long been shaped by the remembrance of Hellman, who knew him after his literary reputation had been made.\r\n\r\nBased on original research across the country, The Lost Detective is the first book to illuminate Hammett&apos;s transformation from real detective to great American detective writer, throwing brilliant new light on one of America&apos;s most celebrated and remembered novelists and his world.\r\n\r\nxx","last_updated":"2018-04-25T12:04:10.473Z","parsed":{"xt":"urn:btih:4516ed9606279a448d06a1ff40a3c86fb2ba39c0","dn":"The Lost Detective by Nathan Ward EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4516ed9606279a448d06a1ff40a3c86fb2ba39c0","infoHashBuffer":{"type":"Buffer","data":[69,22,237,150,6,39,154,68,141,6,161,255,64,163,200,111,178,186,57,192]},"name":"The Lost Detective by Nathan Ward EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}