{"title":"Visible Empire by Hannah Pittard EPUB","magnet":"magnet:?xt=urn:btih:454acf3ccd122130419136b58d37a61b16c9ea94&dn=Visible+Empire+by+Hannah+Pittard+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6462155","seeders":"1","leechers":"1","description":"xx\r\n\r\nVisible Empire by Hannah Pittard EPUB\r\n\r\nFrom a writer who &quot;deserves the attention of anyone in search of today&apos;s best fiction&quot; (Washington Post) comes an epic novel - based on true events - of wealth, race, grief, and love, charting one sweltering summer in Atlanta that left no one unchanged. \r\n\r\nIt&apos;s a humid summer day when the phones begin to ring: Disaster has struck. Air France Flight 007, which had been chartered to ferry home more than 100 of Atlanta&apos;s cultural leaders following a luxurious arts-oriented tour of Europe, crashed shortly after takeoff in Paris. In one fell swoop, most of the city&apos;s wealthiest residents perished. Left behind were children, spouses, lovers, friends, and a city on the cusp of great change: the civil rights movement was at its peak; the hedonism of the &apos;60s was at its doorstep. \r\n\r\nIn Hannah Pittard&apos;s dazzling and most ambitious novel yet, she gives us the journeys of those who must now rebuild this place and their lives. Mayor Ivan Allen is tasked with the job of keeping the city moving forward. Nineteen-year-old Piedmont Dobbs, who had been denied admission to an integrated school, senses a moment of opportunity. Robert, a newspaper editor, must decide if he can reconnect with his beloved but estranged wife, Lily, who has learned that her wealthy parents left her penniless. \r\n\r\nVisible Empire is the story of a single sweltering summer and of the promise and hope that remains in the wake of crisis. It&apos;s the story of a husband and wife - Robert and Lily - who don&apos;t truly come to understand each other and their love until their city&apos;s chaos drives them to clarity.\r\n\r\nxx","last_updated":"2018-09-30T12:03:35.736Z","parsed":{"xt":"urn:btih:454acf3ccd122130419136b58d37a61b16c9ea94","dn":"Visible Empire by Hannah Pittard EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"454acf3ccd122130419136b58d37a61b16c9ea94","infoHashBuffer":{"type":"Buffer","data":[69,74,207,60,205,18,33,48,65,145,54,181,141,55,166,27,22,201,234,148]},"name":"Visible Empire by Hannah Pittard EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}