{"title":"When They Severed Earth from Sky by E. Barber, P.Barber EPUB","magnet":"magnet:?xt=urn:btih:4558508669ea7caeb644e5e84fa67a89cb7f5c74&dn=When+They+Severed+Earth+from+Sky+by+E.+Barber%2C+P.Barber+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1676546","seeders":"42","leechers":"9","description":"xx\r\n\r\nWhen They Severed Earth from Sky_ How the Human Mind Shapes Myth by Elizabeth Wayland Barber, Paul T. Barber EPUB\r\n\r\nWhy were Prometheus and Loki envisioned as chained to rocks? What was the Golden Calf? Why are mirrors believed to carry bad luck? How could anyone think that mortals like Perseus, Beowulf, and St. George actually fought dragons, since dragons don&apos;t exist? Strange though they sound, however, these &quot;myths&quot; did not begin as fiction.\r\n\r\nThis absorbing book shows that myths originally transmitted real information about real events and observations, preserving the information sometimes for millennia within nonliterate societies. Geologists&apos; interpretations of how a volcanic cataclysm long ago created Oregon&apos;s Crater Lake, for example, is echoed point for point in the local myth of its origin. The Klamath tribe saw it happen and passed down the story - for nearly 8,000 years. We, however, have been literate for so long that we&apos;ve forgotten how myths encode reality. Recent studies of how our brains work, applied to a wide range of data from the Pacific Northwest to ancient Egypt to modern stories reported in newspapers, have helped the Barbers deduce the characteristic principles by which such tales both develop and degrade through time. Myth is in fact a quite reasonable way to convey important messages orally over many generations - although reasoning back to the original events is possible only under rather specific conditions.\r\n\r\nOur oldest written records date to 5,200 years ago, but we have been speaking and mythmaking for perhaps 100,000. This groundbreaking book points the way to restoring some of that lost history and teaching us about human storytelling.\r\n\r\nxx","last_updated":"2018-06-29T12:14:28.341Z","parsed":{"xt":"urn:btih:4558508669ea7caeb644e5e84fa67a89cb7f5c74","dn":"When They Severed Earth from Sky by E. Barber, P.Barber EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4558508669ea7caeb644e5e84fa67a89cb7f5c74","infoHashBuffer":{"type":"Buffer","data":[69,88,80,134,105,234,124,174,182,68,229,232,79,166,122,137,203,127,92,116]},"name":"When They Severed Earth from Sky by E. Barber, P.Barber EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}