{"title":"The Icarus Syndrome by Peter Beinart EPUB","magnet":"magnet:?xt=urn:btih:458a487c2cf4f51647b825cec48c5427c74bf5f2&dn=The+Icarus+Syndrome+by+Peter+Beinart+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"902421","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Icarus Syndrome: A History of American Hubris by Peter Beinart EPUB\r\n\r\nIn The Icarus Syndrome, Peter Beinart tells a tale as old as the Greeks&#x2014;a story about the seductions of success. Beinart describes Washington on the eve of three wars&#x2014;World War I, Vietnam, and Iraq&#x2014;three moments when American leaders decided they could remake the world in their image. Each time, leading intellectuals declared that history was over, and the spread of democracy was inevitable. Each time, a president held the nation in the palm of his hand. And each time, a war conceived in arrogance brought untold tragedy.\r\n\r\nIn dazzling color, Beinart portrays three extraordinary generations: the progressives who took America into World War I, led by Woodrow Wilson, the lonely preacher&apos;s son who became the closest thing to a political messiah the world had ever seen; the Camelot intellectuals who took America into Vietnam, led by Lyndon Johnson, who lay awake at night after night shaking with fear that his countrymen considered him weak; and George W. Bush and the post-cold war neoconservatives, the romantic bullies who believed they could bludgeon the Middle East and liberate it at the same time.\r\n\r\nLike Icarus, each of these generations crafted &quot;wings&quot;&#x2014;a theory about America&apos;s relationship to the world. They flapped carefully at first, but gradually lost their inhibitions until, giddy with success, they flew into the sun.\r\n\r\nBut every era also brought new leaders and thinkers who found wisdom in pain. They reconciled American optimism&#x2014;our belief that anything is possible&#x2014;with the realities of a world that will never fully bend to our will. In their struggles lie the seeds of American renewal today.\r\n\r\nBased on years of research, The Icarus Syndrome is a provocative and strikingly original account of hubris in the American century&#x2014;and how we learn from the tragedies that result.\r\n\r\nxx","last_updated":"2018-09-17T12:01:04.951Z","parsed":{"xt":"urn:btih:458a487c2cf4f51647b825cec48c5427c74bf5f2","dn":"The Icarus Syndrome by Peter Beinart EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"458a487c2cf4f51647b825cec48c5427c74bf5f2","infoHashBuffer":{"type":"Buffer","data":[69,138,72,124,44,244,245,22,71,184,37,206,196,140,84,39,199,75,245,242]},"name":"The Icarus Syndrome by Peter Beinart EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}