{"title":"The Rise of the Seleukid Empire by John D. Grainger (.epub)+","magnet":"magnet:?xt=urn:btih:46476cc35ce885c6a607fd429341377006708922&dn=The+Rise+of+the+Seleukid+Empire+by+John+D.+Grainger+%28.epub%29%2B&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"1627749","seeders":"71","leechers":"13","description":"The Rise of the Seleukid Empire (323-223 BC): Seleukos I to Seleukos III by John D. Grainger\r\n\r\nRequirements: .ePUB, .AZW3 reader\r\n\r\nOverview: The Seleukid kingdom was the largest state in the world for a century and more between Alexander&apos;s death and the rise of Rome. It was ruled for all that time by a succession of able kings, but broke down twice, before eventually succumbing to dynastic rivalries, and simultaneous external invasions and internal grasps for independence. The first king, Seleukos I, established a pattern of rule which was unusually friendly towards his subjects, and his policies promoted the steady growth of wealth and population in many areas which had been depopulated when he took them over. In particular the dynasty was active in founding cities from Asia Minor to Central Asia. Its work set the social and economic scene of the Middle East for many centuries to come. Yet these kings had to be warriors too as they defended their realm from jealous neighbours. John D Grainger&apos;s trilogy charts the rise and fall of this superpower of the ancient world. &#x2028;&#x2028;In the first volume, John D Grainger relates the remarkable twists of fortune and daring that saw Seleukos, an officer in an elite guard unit, emerge from the wars of the diadochi (Alexander&apos;s successors) in control of the largest and richest part of the empire of the late Alexander the Great. After his conquests and eventual murder, we then see how his successors continued his policies, including the repeated wars with the Ptolemaic rules of Egypt over control of Syria. The volume ends with the deep internal crisis and the wars of the brothers, which left only a single member of the dynasty alive in 223 BC.\r\n\r\nGenre: Non-Fiction &gt; History","last_updated":"2018-09-23T12:25:54.265Z","parsed":{"xt":"urn:btih:46476cc35ce885c6a607fd429341377006708922","dn":"The Rise of the Seleukid Empire by John D. Grainger (.epub) ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"46476cc35ce885c6a607fd429341377006708922","infoHashBuffer":{"type":"Buffer","data":[70,71,108,195,92,232,133,198,166,7,253,66,147,65,55,112,6,112,137,34]},"name":"The Rise of the Seleukid Empire by John D. Grainger (.epub) ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}