{"title":"The Bloomsbury Research Handbook of Indian Ethics 2016 [ePub]","magnet":"magnet:?xt=urn:btih:46cd1740e1229a5f58a485286a58a9873b88e8d9&dn=The+Bloomsbury+Research+Handbook+of+Indian+Ethics+2016+%5BePub%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Horisarte","categoryP":"other","categoryS":"e_books","size":"1177125","seeders":"0","leechers":"0","description":"Shyam Ranganathan (Ed.) - The Bloomsbury Research Handbook of Indian Ethics - 2016\r\n\r\n\r\nFeaturing leading scholars from philosophy and religious studies, The Bloomsbury Research Handbook of Indian Ethics dispels the myth that Indian thinkers and philosophers were uninterested in ethics.\r\n\r\nThis comprehensive research handbook traces Indian moral philosophy through classical, scholastic Indian philosophy, pan-Indian literature including the Epics, Ayurvedic medical ethics, as well as recent, traditionalist and Neo-Hindu contributions. Contrary to the usual myths about India (that Indians were too busy being religious to care about ethics), moral theory constitutes the paradigmatic differentia of formal Indian philosophy, and is reflected richly in popular literature. Many of the papers make this clear by an analytic explication that draws critical comparisons and contrasts between classical Indian moral philosophy and contemporary contributions to ethics.\r\n\r\nBy critically addressing ethics as a sub-discipline of philosophy and acknowledging the mistaken marginalization of Indian moral philosophy, this handbook reveals how Indian contributions can illuminate contemporary philosophical research on ethics.\r\n\r\nUnlike previous approaches to Indian ethics, this volume is organized in accordance with major topics in moral philosophy. The volume contains an extended introduction, exploring topics in moral semantics, the philosophy of thought, (metaethical and normative) ethical theory, and the politics of scholarship, which serve to show how the diversity of Indian moral philosophy is a contribution to the discipline of ethics. With an overview of Indian moral theory, and a glossary, this is a valuable guide to understanding the past, present and future research directions of a central component of Indian philosophy.\r\n <a href=\"\nhttps://www.bloomsbury.com/us/the-bloomsbury-research-handbook-of-indian-ethics-9781472587770/\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.bloomsbury.com/us/the-bloomsbury-research-handbook-of-indian-ethics-9781472587770/</a>","last_updated":"2018-05-01T12:00:51.185Z","parsed":{"xt":"urn:btih:46cd1740e1229a5f58a485286a58a9873b88e8d9","dn":"The Bloomsbury Research Handbook of Indian Ethics 2016 [ePub]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"46cd1740e1229a5f58a485286a58a9873b88e8d9","infoHashBuffer":{"type":"Buffer","data":[70,205,23,64,225,34,154,95,88,164,133,40,106,88,169,135,59,136,232,217]},"name":"The Bloomsbury Research Handbook of Indian Ethics 2016 [ePub]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}