{"title":"BrattySis - Kiara Cole (Sex For My Silence) NEW 05 October 2018","magnet":"magnet:?xt=urn:btih:470a52f793528993062552b63f7451724f49717c&dn=BrattySis+-+Kiara+Cole+%28Sex+For+My+Silence%29+NEW+05+October+2018&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"609402437","seeders":"8","leechers":"25","description":"Jason has all the dirt on his stepsister Kiara Cole that he needs to get in her pants, although Kiara doesn&apos;t know it yet. He calls her in and announces that she&apos;ll be doing all his chores. If she won&apos;t, he&apos;ll tell their parents that Kiara snuck out to get her rocks off the previous evening. Kiara agrees, even going so far as to strip down to her thong when Jason insists that she make things hotter. After seeing his stepsister&apos;s tits, Jason demands that he get some full nudity. Kiara reluctantly peels off her panties and continues to clean in the nude.Completely entranced by his stepsister&apos;s stunning small figure, Jason coaxes her into bed to give him a blowjob. She asks for his promise that he won&apos;t tell their parents, and he gives it freely if Kiara can get him off. She agrees, stroking his dick and blowing him so enthusiastically that his stiffie hits the back of her throat. When Jason insists that Kiara needs to fuck him to get him off and seal their bargain, Kiara seats her meaty twat on top of his fuck stick and slides down. She can&apos;t help moaning in delight as her hips move in a fast and furious ride, betraying her genuine enjoyment.Now that the stepsiblings have started fucking they&apos;re absolutely going to enjoy it! Kiara turns around to keep riding Jason&apos;s fuck stick in reverse cowgirl, then lays on her belly as Jason takes her from behind. Reaching down to rub her clit as Jason sinks his thumb into her ass, she brings herself to a pussy pulsing climax. The stepsiblings alternate between banging with Chloe on her back and on her belly, with Jason making sure to thumb her ass whenever he can. Her sweet moans bring him off as surely as her pulsing snatch, giving him just enough time to pull out and shower Chloe&apos;s open mouth and face with a shot of hot jizz.\r\nCategories: Small Boobs Short Girls Blonde Long hair Hardcore Petite Girl-Boy Blowjob Super Skinny Facial POV\r\n <a href=\"\nhttp://imgdone.com/image/zAc01\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/zAc01</a>\r\n <a href=\"\nhttp://imgdone.com/image/zAuLs\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/zAuLs</a>","last_updated":"2018-10-05T12:23:37.694Z","parsed":{"xt":"urn:btih:470a52f793528993062552b63f7451724f49717c","dn":"BrattySis - Kiara Cole (Sex For My Silence) NEW 05 October 2018","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"470a52f793528993062552b63f7451724f49717c","infoHashBuffer":{"type":"Buffer","data":[71,10,82,247,147,82,137,147,6,37,82,182,63,116,81,114,79,73,113,124]},"name":"BrattySis - Kiara Cole (Sex For My Silence) NEW 05 October 2018","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}