{"title":"Flat Earth News by Nick Davies EPUB","magnet":"magnet:?xt=urn:btih:47c69087ee8d0a3f41a1fbacdca7006821525ec1&dn=Flat+Earth+News+by+Nick+Davies+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"668785","seeders":"0","leechers":"0","description":"xx\r\n\r\nFlat Earth News by Nick Davies EPUB\r\n\r\nWhen award-winning journalist Nick Davies decided to break Fleet Street&apos;s unwritten rule by investigating his own colleagues, he found that the business of reporting the truth had been slowly subverted by the mass production of ignorance.\r\n\r\nWorking with a network of off-the-record sources, Davies uncovered the story of the prestigious &quot;Sunday&quot; newspaper which allowed the CIA and MI6 to plant fiction in its columns; the newsroom which routinely rejects stories about black people; the respected paper that hired a professional fraudster to set up a front company to entrap senior political figures; the newspapers which support law and order while paying cash bribes to bent detectives.\r\n\r\nDavies names and exposes the national stories which turn out to be pseudo events manufactured by the PR industry, and the global news stories which prove to be fiction generated by a new machinery of international propaganda. He shows the effect of this on a world where consumers believe a mass of stories which, in truth, are as false as the idea that the Earth is flat - from the millennium bug to the WMD in Iraq - tainting government policy, perverting popular belief.\r\n\r\nWith the help of researchers from Cardiff University, who ran a ground-breaking analysis of our daily news, Davies found most reporters, most of the time, are not allowed to dig up stories or check their facts - a profession corrupted at the core.\r\n\r\nxx","last_updated":"2018-06-16T12:11:36.893Z","parsed":{"xt":"urn:btih:47c69087ee8d0a3f41a1fbacdca7006821525ec1","dn":"Flat Earth News by Nick Davies EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"47c69087ee8d0a3f41a1fbacdca7006821525ec1","infoHashBuffer":{"type":"Buffer","data":[71,198,144,135,238,141,10,63,65,161,251,172,220,167,0,104,33,82,94,193]},"name":"Flat Earth News by Nick Davies EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}