{"title":"I Should Have Honor by Khalida Brohi EPUB","magnet":"magnet:?xt=urn:btih:48234d9f6649a2f5632c020222f75654edcbc1ab&dn=I+Should+Have+Honor+by+Khalida+Brohi+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"13150217","seeders":"19","leechers":"3","description":"xx\r\n\r\nI Should Have Honor by Khalida Brohi EPUB\r\n\r\nA fearless memoir about tribal life in Pakistan - and the act of violence that inspired one ambitious young woman to pursue a life of activism and female empowerment\r\n\r\n&#x201C;Khalida Brohi understands the true nature of honor. She is fearless in her pursuit of justice and equality.&#x201D; (Malala Yousafzai, winner of the Nobel Peace Prize)\r\n\r\nFrom a young age, Khalida Brohi was raised to believe in the sanctity of arranged marriage. Her mother was forced to marry a 13-year-old boy when she was only nine; Khalida herself was promised as a bride before she was even born. But her father refused to let her become a child bride. He was a man who believed in education, not just for himself but for his daughters, and Khalida grew up thinking she would become the first female doctor in her small village. Khalida thought her life was proceeding on an unusual track for a woman of her circumstances, but one whose path was orderly and straightforward.\r\n\r\nEverything shifted for Khalida when she found out that her beloved cousin had been murdered by her uncle in a tradition known as &#x201C;honor killing.&#x201D; Her cousin&#x2019;s crime? She had fallen in love with a man who was not her betrothed. This moment ignited the spark in Khalida Brohi that inspired a globe-spanning career as an activist, beginning at the age of 16. From a tiny cement-roofed room in Karachi where she was allowed 10 minutes of computer use per day, Brohi started acampaign that went viral. From there, she created a foundation focused on empowering the lives of women in rural communities through education and employment opportunities, while crucially working to change the minds of their male partners, fathers, and brothers.\r\n\r\nThis book is the story of how Brohi, while only a girl herself, shone her light on the women and girls of Pakistan, despite the hurdles and threats she faced along the way. And ultimately, she learned that the only way to eradicate the parts of a culture she despised was to fully embrace the parts of it that she loved.\r\n\r\nxx","last_updated":"2018-11-25T12:05:20.989Z","parsed":{"xt":"urn:btih:48234d9f6649a2f5632c020222f75654edcbc1ab","dn":"I Should Have Honor by Khalida Brohi EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"48234d9f6649a2f5632c020222f75654edcbc1ab","infoHashBuffer":{"type":"Buffer","data":[72,35,77,159,102,73,162,245,99,44,2,2,34,247,86,84,237,203,193,171]},"name":"I Should Have Honor by Khalida Brohi EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}