{"title":"The Gold Cartel: Government Intervention in Gold","magnet":"magnet:?xt=urn:btih:4831e16e740c52fe3f122b2482470de1a810096e&dn=The+Gold+Cartel%3A+Government+Intervention+in+Gold&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"3834235","seeders":"0","leechers":"2","description":"The Gold Cartel: Government Intervention in Gold - Dimitri Speck [pdf]\r\n\r\nIn times of financial crises and imminent sovereign defaults, gold is the investment on everyone&apos;s lips. As a safe investment, one could traditionally rely on gold markets for good, stable performance, however in recent years, they have seen surprising volatility and price fluctuation, with no visible reason as to why.\r\n\r\nIn The Gold Cartel, seasoned commodity analyst Dimitri Speck illustrates in detail how central banks have secretly manipulated the price of gold in an effort to calm financial markets and control inflation. Using quantitative analysis of historic gold market patterns, the author shows how and when central banks intervene in gold markets, and how this has affected price movement and impacted the global financial markets, leading to the creation of a mega-bubble.\r\n\r\nSince the abolition of the gold standard in 1971, the indebtedness of the global economy has increased rapidly and has now reached levels way beyond comprehension. What are the mechanisms that have led us to this mega-bubble? Is it possible to avoid a catastrophic outcome like deflation or hyperinflation? And how does this relate to the gold markets? This book has the answers.\r\n\r\nDimitri Speck (Berlin, Germany) is a quantitative asset manager and trading system developer. He is responsible for two investment funds, a stock fund and a commodity fund, both of which have considerably outperformed the market since inception. Speck has specialized on patterns and the analysis of complex financial issues. He is a well known expert on precious metals investment analysis.\r\n\r\nHardcover: 328 pages\r\nPublisher: Palgrave Macmillan (September 26, 2013)","last_updated":"2018-09-24T12:21:55.657Z","parsed":{"xt":"urn:btih:4831e16e740c52fe3f122b2482470de1a810096e","dn":"The Gold Cartel: Government Intervention in Gold","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4831e16e740c52fe3f122b2482470de1a810096e","infoHashBuffer":{"type":"Buffer","data":[72,49,225,110,116,12,82,254,63,18,43,36,130,71,13,225,168,16,9,110]},"name":"The Gold Cartel: Government Intervention in Gold","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}