{"title":"Coast to Coast - Search for Life on Mars Psychic In MARS (Podcas","magnet":"magnet:?xt=urn:btih:484ea40ccec7d5daf33d48d987b695ebc50b2626&dn=Coast+to+Coast+-+Search+for+Life+on+Mars+Psychic+In+MARS+%28Podcas&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"handr","categoryP":"audio","categoryS":"other","size":"70376911","seeders":"2","leechers":"0","description":"---Podcast--- 2018-06-27 [Coast to Coast]\r\n\r\nIn the first half of the show, Astronomy Professor David Weintraub talked about the search for life on Mars, future missions to the Red Planet, and the possibility of life elsewhere in our solar system and beyond. One of the first discoveries about Mars was that the planet has an approximately 24-hour rotation just like Earth and early in its history we&apos;re reasonably certain the planet had quite a bit of water, he cited. &quot;We see in the ancient parts of Mars features on the surface that look like river valleys,&quot; he continued, as well as giant outflow channels where there were probably tremendous amounts of water in underground reservoirs. These ancient areas of Mars have been unchanged for the last three billion years, he added.\r\n\r\nMars lacks an ozone layer and may have lost a lot of its water because of exposure to ultraviolet light, he explained. Currently, the only manned trip to the surface of Mars by NASA or SpaceX would be a one-way journey, though there are people that have volunteered for such a mission. The moon Europa is a fascinating place which is heated by the tides of Jupiter and has a warm ocean of liquid water, along with all the basic building blocks of life, Weintraub enthused. He also addressed his study of religions reacting to the discovery of life beyond Earth and found that all but the most orthodox branches would be accepting of such a revelation","last_updated":"2018-07-01T12:10:10.392Z","parsed":{"xt":"urn:btih:484ea40ccec7d5daf33d48d987b695ebc50b2626","dn":"Coast to Coast - Search for Life on Mars Psychic In MARS (Podcas","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"484ea40ccec7d5daf33d48d987b695ebc50b2626","infoHashBuffer":{"type":"Buffer","data":[72,78,164,12,206,199,213,218,243,61,72,217,135,182,149,235,197,11,38,38]},"name":"Coast to Coast - Search for Life on Mars Psychic In MARS (Podcas","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}