{"title":"Shotguns and Stagecoaches by John Boessenecker (.ePUB)","magnet":"magnet:?xt=urn:btih:494a852b95795efa6dac076761c718e9a164da3d&dn=Shotguns+and+Stagecoaches+by+John+Boessenecker+%28.ePUB%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"23171852","seeders":"22","leechers":"4","description":"Shotguns and Stagecoaches: The Brave Men Who Rode for Wells Fargo in the Wild West by John Boessenecker\r\n\r\nRequirements: .ePUB reader\r\n\r\nOverview: The true stories of the Wild West heroes who guarded the iconic Wells Fargo stagecoaches and trains, battling colorful thieves, vicious highwaymen, and robbers armed with explosives.\r\n\r\nThe phrase &quot;riding shotgun&quot; was no teenage game to the men who guarded stagecoaches and trains the Western frontier. Armed with sawed-off, double-barreled shotguns and an occasional revolver, these express messengers guarded valuable cargo through lawless terrain. They were tough, fighting men who risked their lives every time they climbed into the front boot of a Concord coach.\r\n\r\nBoessenecker introduces soon-to-be iconic personalities like &quot;Chips&quot; Hodgkins, an express rider known for his white mule and his ability to outrace his competitors, and Henry Johnson, the first Wells Fargo detective. Their lives weren&apos;t just one shootout after another&#x2014;their encounters with desperadoes were won just as often with quick wits and memorized-by-heart knowledge of the land.\r\n\r\nThe highway robbers also get their due. It wouldn&apos;t be a book about the Wild West without Black Bart, the most infamous stagecoach robber of all time, and Butch Cassidy&apos;s gang, America&apos;s most legendary train robbers.\r\n\r\nThrough the Gold Rush and the early days of delivery with horses and saddlebags, to the heyday of stagecoaches and huge shipments of gold, and finally the rise of the railroad and the robbers who concocted unheard-of schemes to loot trains, Wells Fargo always had courageous men to protect its treasure. Their unforgettable bravery and ingenuity make this book a thrilling read.\r\n\r\nGenre: Non-Fiction &gt; History","last_updated":"2018-12-07T12:21:49.764Z","parsed":{"xt":"urn:btih:494a852b95795efa6dac076761c718e9a164da3d","dn":"Shotguns and Stagecoaches by John Boessenecker (.ePUB)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"494a852b95795efa6dac076761c718e9a164da3d","infoHashBuffer":{"type":"Buffer","data":[73,74,133,43,149,121,94,250,109,172,7,103,97,199,24,233,161,100,218,61]},"name":"Shotguns and Stagecoaches by John Boessenecker (.ePUB)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}