{"title":"The Inner Lives of Medieval Inquisitors","magnet":"magnet:?xt=urn:btih:4af89d6f03d520e385e267c609c09667171928fc&dn=The+Inner+Lives+of+Medieval+Inquisitors&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"1541332","seeders":"0","leechers":"0","description":"The Inner Lives of Medieval Inquisitors - Karen Sullivan [pdf]\r\n\r\nThere have been numerous studies in recent decades of the medieval inquisitions, most emphasizing larger social and political circumstances and neglecting the role of the inquisitors themselves. In this volume, Karen Sullivan sheds much-needed light on these individuals and reveals that they had choices&#x2014;both the choice of whether to play a part in the orthodox repression of heresy and, more frequently, the choice of whether to approach heretics with zeal or with charity.\r\n\r\nIn successive chapters on key figures in the Middle Ages&#x2014;Bernard of Clairvaux, Dominic Guzm&#xE1;n, Conrad of Marburg, Peter of Verona, Bernard Gui, Bernard D&#xE9;licieux, and Nicholas Eymerich&#x2014;Sullivan shows that it is possible to discern each inquisitor making personal, moral choices as to what course of action he would take. All medieval clerics recognized that the church should first attempt to correct heretics through repeated admonitions and that, if these admonitions failed, it should then move toward excluding them from society. Yet more charitable clerics preferred to wait for conversion, while zealous clerics preferred not to delay too long before sending heretics to the stake.\r\n\r\nBy considering not the external prosecution of heretics during the Middles Ages, but the internal motivations of the preachers and inquisitors who pursued them, as represented in their writings and in those of their peers, The Inner Lives of Medieval Inquisitors explores how it is that the most idealistic of purposes can lead to the justification of such dark ends.\r\n\r\nKaren Sullivan is the Irma Brandeis Professor of Romance Culture and Literature at Bard College. She is the author of The Interrogation of Joan of Arc and of Truth and the Heretic: Crises of Knowledge in Medieval French Literature.\r\n\r\nPrint Length: 308 pages\r\nPublisher: University of Chicago Press; Reprint edition (March 15, 2011)","last_updated":"2018-09-24T12:22:05.883Z","parsed":{"xt":"urn:btih:4af89d6f03d520e385e267c609c09667171928fc","dn":"The Inner Lives of Medieval Inquisitors","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4af89d6f03d520e385e267c609c09667171928fc","infoHashBuffer":{"type":"Buffer","data":[74,248,157,111,3,213,32,227,133,226,103,198,9,192,150,103,23,25,40,252]},"name":"The Inner Lives of Medieval Inquisitors","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}