{"title":"The Hollow Crown by Dan Jones EPUB","magnet":"magnet:?xt=urn:btih:4c4366ab382fc2733066be67b8516f022ce11d3e&dn=The+Hollow+Crown+by+Dan+Jones+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1409700","seeders":"47","leechers":"0","description":"xx\r\n\r\nThe Hollow Crown: The Wars of the Roses and the Rise of the Tudors by Dan Jones EPUB\r\n\r\nThe 15th century saw the crown of England change hands seven times as the great families of England fought to the death for power, majesty and the right to rule. \r\n\r\nThe Hollow Crown completes Dan Jones&apos; epic history of medieval England, and describes how the Plantagenets tore themselves apart to be finally replaced by the Tudors.  \r\n\r\nSome of the greatest heroes and villains in British history were thrown together in these turbulent times: Henry V, whose victory at Agincourt and prudent rule at home marked the high point of the medieval monarchy; Edward IV, who was handed his crown by the scheming soldier Warwick the Kingmaker, before their alliance collapsed into a fight to the death; and the last Plantagenet, Richard III, who stole the throne and murdered his own nephews, the Princes in the Tower. Finally, the Tudors arrived - but even their rule was only made certain in the 1520s, when Henry VIII ruthlessly hunted down his family&apos;s last remaining enemies. \r\n\r\nIn the midst this tumult, chivalry was reborn, the printing press arrived and the Renaissance began to flourish. With vivid descriptions of the battle of Towton, where 28,000 men died in a single morning, and the Battle of Bosworth Field, at which Richard III was hacked down, this is the real story behind Shakespeare&apos;s famous history plays.\r\n\r\nxx","last_updated":"2018-09-22T12:32:53.649Z","parsed":{"xt":"urn:btih:4c4366ab382fc2733066be67b8516f022ce11d3e","dn":"The Hollow Crown by Dan Jones EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4c4366ab382fc2733066be67b8516f022ce11d3e","infoHashBuffer":{"type":"Buffer","data":[76,67,102,171,56,47,194,115,48,102,190,103,184,81,111,2,44,225,29,62]},"name":"The Hollow Crown by Dan Jones EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}