{"title":"The Eighty-Dollar Champion by Elizabeth Letts EPUB","magnet":"magnet:?xt=urn:btih:4c7ccdd0d275da7eb133b3d9d0732afe5fba7088&dn=The+Eighty-Dollar+Champion+by+Elizabeth+Letts+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6209007","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Eighty-Dollar Champion by Elizabeth Letts EPUB\r\n\r\nNovember 1958, New York. Into the rarefied atmosphere of wealth and tradition at the National Horse Show in Madison Square Garden comes the most unlikely of horses&#x2014;a drab white former plow horse named Snowman&#x2014;and his rider, Harry de Leyer. They were the longest of all longshots&#x2014;and their win was the stuff of legend.\r\n\r\nHarry de Leyer first saw the horse he would name Snowman on a bleak winter afternoon between the slats of a rickety truck bound for the slaughterhouse. He recognized the spark in the eye of the beaten-up horse and bought him for eighty dollars. On Harry&#x2019;s modest farm on Long Island, the horse thrived. But the recent Dutch immigrant and his growing family needed money, and Harry was always on the lookout for the perfect thoroughbred to train for the show-jumping circuit&#x2014;so he reluctantly sold Snowman to a farm a few miles down the road.\r\n\r\nBut Snowman had other ideas about what Harry needed. When he turned up back at Harry&#x2019;s barn, dragging an old tire and a broken fence board, Harry knew that he had misjudged the horse. And so he set about teaching this shaggy, easygoing horse how to fly. One show at a time, against extraordinary odds and some of the most expensive thoroughbreds alive, the pair climbed to the very top of the sport of show jumping.\r\n\r\nReminiscent of the inspiring, against-the-odds success story that made Seabiscuit a best seller, The Eighty-Dollar Champion tells of the dramatic and inspiring rise to stardom of an unlikely duo, based on the insight and recollections of the &#x201C;Flying Dutchman&#x201D; himself. Their story captured the heart of Cold War&#x2013;era America&#x2014;a story of unstoppable hope, inconceivable dreams, and the chance to have it all. Elizabeth Letts&#x2019;s message is simple: Never give up, even when the obstacles seem sky-high. There is something extraordinary in all of us.\r\n\r\nxx","last_updated":"2018-06-06T12:03:27.359Z","parsed":{"xt":"urn:btih:4c7ccdd0d275da7eb133b3d9d0732afe5fba7088","dn":"The Eighty-Dollar Champion by Elizabeth Letts EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4c7ccdd0d275da7eb133b3d9d0732afe5fba7088","infoHashBuffer":{"type":"Buffer","data":[76,124,205,208,210,117,218,126,177,51,179,217,208,115,42,254,95,186,112,136]},"name":"The Eighty-Dollar Champion by Elizabeth Letts EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}