{"title":"Empower Your Fear by Scott Allan AZW3","magnet":"magnet:?xt=urn:btih:4cd096e1db49a07805b6cd60b5872c93abaafa4e&dn=Empower+Your+Fear+by+Scott+Allan+AZW3&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"345332","seeders":"0","leechers":"0","description":"xx\r\n\r\nEmpower Your Fear by Scott Allan AZW3\r\n\r\nI know how you feel. Life doesn&apos;t work out the way we think it will. When it doesn&apos;t we feel helpless, hopeless and bitter.\r\n\r\nYou can beat your fear.\r\n\r\nEmpower Your Fear focuses in on leveraging what scares you, applying real strategies to get you unstuck, and doing the things that scare you no matter where you are at in life. My motto is: &quot;It&apos;s never too late if you start today.&quot;\r\n\r\nAs we will see in this book, the problem isn&apos;t about &quot;getting rid of the fear&quot; that is controlling you; it&apos;s adapting to your fear and leveraging it as a motivator to take action. The fear is here to stay; how you respond to it ultimately decides your level of success.\r\n\r\nWill you allow yourself to keep living a mediocre lifestyle full of disappointment? Are you ready to take action and change your future? My name is Scott Allan, and for years I lived a fearful lifestyle. Everything about me was mediocre: My choices and actions were defined by what the world expected and not what I could deliver. I knew I could do and be so much more but I was too scared to do anything. I had become paralyzed with self-doubt and defeated by lack of confidence. Eventually I changed my life with one ultimate decision that made all the difference.\r\n\r\nNow, I have written a book to help you get to where you want to be and dig yourself out of the rut that is holding you back. You can stay where you are at or you can start your journey today.\r\n\r\nLet me show you how.\r\n\r\nxx","last_updated":"2018-03-11T12:01:01.936Z","parsed":{"xt":"urn:btih:4cd096e1db49a07805b6cd60b5872c93abaafa4e","dn":"Empower Your Fear by Scott Allan AZW3","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4cd096e1db49a07805b6cd60b5872c93abaafa4e","infoHashBuffer":{"type":"Buffer","data":[76,208,150,225,219,73,160,120,5,182,205,96,181,135,44,147,171,170,250,78]},"name":"Empower Your Fear by Scott Allan AZW3","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}