{"title":"Astoria by Peter Stark EPUB","magnet":"magnet:?xt=urn:btih:4dce89554dcb086157a4d820117bf5a8c9407dee&dn=Astoria+by+Peter+Stark+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4285994","seeders":"33","leechers":"3","description":"xx\r\n\r\nAstoria by Peter Stark EPUB\r\n\r\nAt a time when the edge of American settlement barely reached beyond the Appalachian Mountains, two visionaries, President Thomas Jefferson and millionaire John Jacob Astor, foresaw that one day the Pacific would dominate world trade as much as the Atlantic did in their day. Just two years after the Lewis and Clark expedition concluded in 1806, Jefferson and Astor turned their sights westward once again. Thus began one of history&apos;s dramatic but largely forgotten turning points in the conquest of the North American continent.\r\n\r\nAstoria is the harrowing tale of the quest to settle a Jamestown-like colony on the Pacific coast. Astor set out to establish a global trade network based at the mouth of the Columbia River in what is now Oregon, while Jefferson envisioned a separate democracy on the western coast that would spread eastward to meet the young United States.\r\n\r\nAstor backed this ambitious enterprise with the vast fortune he&apos;d made in the fur trade and in New York real estate since arriving in the United States as a near-penniless immigrant soon after the Revolutionary War. He dispatched two groups of men west: One by sea around the southern tip of South America and one by land over the Rockies.\r\n\r\nUnfolding from 1810 to 1813, Astoria is a tale of high adventure and incredible hardship, drawing extensively on firsthand accounts of those who made the journey. Though the colony itself would be short-lived, its founders opened provincial American eyes to the remarkable potential of the western coast, discovered the route that became the Oregon Trail, and permanently altered the nation&apos;s landscape and global standing.\r\n\r\nxx","last_updated":"2018-09-22T12:39:00.351Z","parsed":{"xt":"urn:btih:4dce89554dcb086157a4d820117bf5a8c9407dee","dn":"Astoria by Peter Stark EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4dce89554dcb086157a4d820117bf5a8c9407dee","infoHashBuffer":{"type":"Buffer","data":[77,206,137,85,77,203,8,97,87,164,216,32,17,123,245,168,201,64,125,238]},"name":"Astoria by Peter Stark EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}