{"title":"Floox 1.5 - Multipurpose Joomla Template for Business","magnet":"magnet:?xt=urn:btih:4dfe8e8bbde279b26dd2de382e3cdf9cbfb289e3&dn=Floox+1.5+-+Multipurpose+Joomla+Template+for+Business&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Shadow","categoryP":"other","categoryS":"other","size":"26307119","seeders":"0","leechers":"0","description":"Visit us on:  <a href=\"\nhttps://www.nulledforums.org\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.nulledforums.org</a>\r\nIf there are no seeds, use our forum for direct download links!\r\n\r\n\r\n \r\nFloox is a creative, innovative, robustly reliable Joomla 3.7+ responsive multipurpose template. It is a wonderful toolkit for crafting powerful modern business websites in a matter of minutes and with an endless capacity for visual branding, customization, and personification. Floox is an ideal template that can be used by businesses, freelance artists, designers, photographers, marketing agencies, and affiliates. This premium template allows business/corporate agencies to easily showcase their portfolio, display their products and service offerings, write blog posts, and display the working team.\r\n\r\nFloox has 5 different homepage variations. It gives you huge flexibility and it can save you plenty of times. All homepage variations are very intuitive and can be easily customized. Based on a modular Bootstrap design, Floox is natively responsive, cross-compatible with browsers, desktop, and mobile devices.\r\n\r\nThe template can be used with any language as it is natively translation &amp; RTL ready. Floox is developed on JoomShaper&#x2019;s Helix3 template framework. Take full control of your site design from header to footer. Create boxed or wide layouts using drag &amp; drop SP Page Builder Pro, responsive layouts, sliders, image and video backgrounds, parallax scrolling, custom styling, animations etc. SP Page Builder Pro is provided for free in the template QuickStart package.\r\n\r\nWe included AcyMailing newsletter integration. While we provide 4 preset colors inside, you can get unlimited color schemes using Helix options. Try Floox today, and let your creative energy flow freely!","last_updated":"2018-07-03T12:01:47.189Z","parsed":{"xt":"urn:btih:4dfe8e8bbde279b26dd2de382e3cdf9cbfb289e3","dn":"Floox 1.5 - Multipurpose Joomla Template for Business","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4dfe8e8bbde279b26dd2de382e3cdf9cbfb289e3","infoHashBuffer":{"type":"Buffer","data":[77,254,142,139,189,226,121,178,109,210,222,56,46,60,223,156,191,178,137,227]},"name":"Floox 1.5 - Multipurpose Joomla Template for Business","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}