{"title":"If Kennedy Lived by Jeff Greenfield EPUB","magnet":"magnet:?xt=urn:btih:4fc6cfbc430a4cc4fa7eb445801a1914680945a0&dn=If+Kennedy+Lived+by+Jeff+Greenfield+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"720450","seeders":"58","leechers":"4","description":"xx\r\n\r\nIf Kennedy Lived by Jeff Greenfield EPUB\r\n\r\nFrom one of the country&apos;s most brilliant political commentators, the best-selling author of Then Everything Changed, an extraordinary, thought-provoking look at Kennedy&apos;s presidency - after November 22, 1963.\r\n\r\nNovember 22, 1963: JFK does not die. What would happen to his life, his presidency, his country, his world?\r\n\r\nIn Then Everything Changed, Jeff Greenfield created an &quot;utterly compelling&quot; (Joe Klein), &quot;riveting&quot; (The New York Times), &quot;eye-opening&quot; (Peggy Noonan), &quot;captivating&quot; (Doris Kearns Goodwin) exploration of three modern alternate histories, &quot;with the kind of political insight and imagination only he possesses&quot; (David Gregory).\r\n\r\nBased on memoirs, histories, oral histories, fresh reporting, and his own knowledge of the players, the book looked at the tiny hinges of history - and the extraordinary changes that would have resulted if they had gone another way.\r\n\r\nNow he presents his most compelling narrative of all about the historical event that has riveted us for fifty years. What if Kennedy were not killed that fateful day? What would the 1964 campaign have looked like? Would changes have been made to the ticket? How would Kennedy, in his second term, have approached Vietnam, civil rights, the Cold War? With Hoover as an enemy, would his indiscreet private life finally have become public? Would his health issues have become so severe as to literally cripple his presidency? And what small turns of fate in the days and years before Dallas might have kept him from ever reaching the White House in the first place?\r\n\r\nAs with Then Everything Changed, the answers Greenfield provides and the scenarios he develops are startlingly realistic, rich in detail, shocking in their projections, but always deeply, remarkably plausible. It is a tour de force of American political history.\r\n\r\nxx","last_updated":"2018-06-17T12:05:36.844Z","parsed":{"xt":"urn:btih:4fc6cfbc430a4cc4fa7eb445801a1914680945a0","dn":"If Kennedy Lived by Jeff Greenfield EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4fc6cfbc430a4cc4fa7eb445801a1914680945a0","infoHashBuffer":{"type":"Buffer","data":[79,198,207,188,67,10,76,196,250,126,180,69,128,26,25,20,104,9,69,160]},"name":"If Kennedy Lived by Jeff Greenfield EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}