{"title":"The Greatest Love Story Ever Told by Nick Offerman .. EPUB","magnet":"magnet:?xt=urn:btih:50f6f93023f134e2aab47568983d36199437602b&dn=The+Greatest+Love+Story+Ever+Told+by+Nick+Offerman+..+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"37959045","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Greatest Love Story Ever Told: An Oral History by Nick Offerman, Megan Mullally EPUB\r\n\r\nAt last, the full story behind Megan Mullally and Nick Offerman&apos;s epic romance, including stories, portraits, and the occasional puzzle, all telling the smoldering tale that has fascinated Hollywood for over a decade. \r\n\r\nThe year: 2000. The setting: Los Angeles. A gorgeous virtuoso of an actress had agreed to star in a random play, and a basement-dwelling scenic carpenter had said he would assay a supporting role in the selfsame pageant. At the first rehearsal, she surveyed her fellow cast members, as one does, determining if any of the men might qualify to provide her with a satisfying fling. Her gaze fell upon the carpenter, and like a bolt of lightning, the thought struck her: No dice. Moving on.  \r\n\r\nYet, unbeknownst to our protagonists, Cupid had merely set down his bow and picked up a rocket launcher. Then fired a love rocket (not a euphemism). The players were Megan Mullally and Nick Offerman, and the resulting romance, once it ignited, was... epic. Beyond epic. It resulted in a coupling that has endured to this day; a sizzling, perpetual tryst that has captivated the world with its kindness, athleticism, astonishingly low-brow humor, and true (fire emoji) passion.  \r\n\r\nHow did they do it? They came from completely different families, endured a significant age difference, and were separated by the gulf of several social strata. Megan loved books and art history; Nick loved hammers. But much more than these seemingly unsurpassable obstacles were the values they held in common: respect, decency, the ability to mention genitalia in almost any context, and an abiding obsession with the songs of Tom Waits.  \r\n\r\nEighteen years later, they&apos;re still very much in love, and have finally decided to reveal the philosophical mountains they have conquered, the lessons they&apos;ve learned, and the myriad jigsaw puzzles they&apos;ve completed, in a book. Featuring anecdotes, hijinks, interviews, photos, and a veritable grab bag of tomfoolery, this is not only the intoxicating book that Mullally&apos;s and Offerman&apos;s fans have been waiting for, it might just hold the solution to the greatest threat facing our modern world: the single life.\r\n\r\nxx","last_updated":"2018-10-03T12:01:15.786Z","parsed":{"xt":"urn:btih:50f6f93023f134e2aab47568983d36199437602b","dn":"The Greatest Love Story Ever Told by Nick Offerman .. EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"50f6f93023f134e2aab47568983d36199437602b","infoHashBuffer":{"type":"Buffer","data":[80,246,249,48,35,241,52,226,170,180,117,104,152,61,54,25,148,55,96,43]},"name":"The Greatest Love Story Ever Told by Nick Offerman .. EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}