{"title":"[psychedelic rock, shoegaze] (2015) The Telescopes - Hidden Fiel","magnet":"magnet:?xt=urn:btih:52037406777cdfb84f34cb1b372ebbc40318dcec&dn=%5Bpsychedelic+rock%2C+shoegaze%5D+%282015%29+The+Telescopes+-+Hidden+Fiel&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"100.XY","categoryP":"audio","categoryS":"flac","size":"212681938","seeders":"0","leechers":"0","description":"(2015) The Telescopes - Hidden Fields\r\n\r\nReview: \r\nAll music is art. Whether or not you like that piece of art is largely irrelevant for you to be able to appreciate the creativity process from which it came. But even art with little instant appeal to your ears and eyes has the power to enhance, if given the chance to do so. If you&#x2019;re a newcomer to the wonders of The Telescopes, then you must first put aside all preconceptions of what type of music appeals to you and simply focus on the fact that it is unequivocally art. \r\nFor all intents and purposes, Stephen Lawrie has been the one constant creative artist for The Telescopes since their 1987 formation, he being the only remaining founder member. During the past 28 years the band have taken quite a journey, from shoegaze to noise rock to psychedelic rock to space rock via numerous band members and now, for studio album number eight, Lawrie heads back towards a more familiar song structure &#x2013; in the main. The band recently signed to German label Tapete, but there&#x2019;s no Krautrock on show here, it&#x2019;s mind-melting feedback screech infused psychedelia recorded in Glasgow. \r\nAt just five tracks, a first look will have you thinking it&#x2019;s an EP rather than LP. But album closer The Living Things lasts a colossal 15 minutes and it is undeniably the one track that is Hidden Fields&#x2019; heart. It walks a pedestrian trudge through an imaginary icy field of broken glass, debris and post-apocalyptic mayhem, underpinned by morbid wails and what can only be compared to your primary school teacher screeching their nails down the blackboard to silence the classroom. It&#x2019;s an absolute monster, sounding at times like Newcombe&#x2019;s BJM meeting Psychocandy era The Jesus And Mary Chain and My Bloody Valentine &#x2013; its persistent bass line will burrow itself into your brain; beware, you may lose your mind in here. \r\n \r\nTracklist: \r\n01 - You Know the Way.flac \r\n02 - Absence.flac \r\n03 - In Every Sense.flac \r\n04 - Don&apos;t Bring Me Round.flac \r\n05 - The Living Things.flac \r\n\r\nSummary: \r\nCountry: Scotland \r\nGenre: psychedelic rock, shoegaze","last_updated":"2018-04-27T12:00:32.857Z","parsed":{"xt":"urn:btih:52037406777cdfb84f34cb1b372ebbc40318dcec","dn":"[psychedelic rock, shoegaze] (2015) The Telescopes - Hidden Fiel","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"52037406777cdfb84f34cb1b372ebbc40318dcec","infoHashBuffer":{"type":"Buffer","data":[82,3,116,6,119,124,223,184,79,52,203,27,55,46,187,196,3,24,220,236]},"name":"[psychedelic rock, shoegaze] (2015) The Telescopes - Hidden Fiel","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}