{"title":"Richard the Lionheart by W. B. Bartlett (.ePUB) ","magnet":"magnet:?xt=urn:btih:530843e3a379e3188bf389b386cfb7635c7f1c6a&dn=Richard+the+Lionheart+by+W.+B.+Bartlett+%28.ePUB%29+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"1624227","seeders":"20","leechers":"2","description":"Richard the Lionheart: The Crusader King of England by W. B. Bartlett\r\n\r\nRequirements: .ePUB reader\r\n\r\nOverview: Whilst Richard I is one of medieval England&#x2019;s most famous kings he is also the most controversial. He has variously been considered a great warrior but a poor king, a man driven by the quest for fame and glory but also lacking in self-discipline and prone to throwing away the short-term advantages that his military successes brought him. In this reassessment W. B. Bartlett looks at his deeds and achievements in a new light. The result is a compelling new portrait of &#x2018;the Lionheart&#x2019; which shows that the king is every bit as remarkable as his medieval contemporaries found him to be. This includes his Muslim enemies, who spoke of him as their most dangerous and gallant opponent. It shows him to be a man badly let down by some of those around him, especially his brother John and the duplicitous French king Philip. The foibles of his character are also exposed to the full, including his complicated relationships with the key women in his life, especially the imposing contemporary figure of his mother, Eleanor of Aquitaine, and his wife, Berengaria, with whom he failed to produce an heir, leading to later suggestions of homosexuality. This is a new Richard, one for the twenty-first century, and a re-evaluation of the life story of one of the greatest personalities of medieval Europe.\r\n\r\nGenre: Non-Fiction &gt; History","last_updated":"2018-12-07T12:22:29.952Z","parsed":{"xt":"urn:btih:530843e3a379e3188bf389b386cfb7635c7f1c6a","dn":"Richard the Lionheart by W. B. Bartlett (.ePUB) ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"530843e3a379e3188bf389b386cfb7635c7f1c6a","infoHashBuffer":{"type":"Buffer","data":[83,8,67,227,163,121,227,24,139,243,137,179,134,207,183,99,92,127,28,106]},"name":"Richard the Lionheart by W. B. Bartlett (.ePUB) ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}