{"title":"Le Passe (The Past) (2013) 1080p H.264 (moviesbyrizzo) multisub","magnet":"magnet:?xt=urn:btih:54891937c4eb3f6c7f6dea8d215b2604e92314ed&dn=Le+Passe+%28The+Past%29+%282013%29+1080p+H.264+%28moviesbyrizzo%29+multisub&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"moviesbyrizzo","categoryP":"video","categoryS":"hd___movies","size":"2589945813","seeders":"10","leechers":"10","description":" <a href=\"https://www.imdb.com/title/tt2404461/\" rel=\"nofollow\" target=\"_NEW\">https://www.imdb.com/title/tt2404461/</a>\r\n\r\n1920 X 1080 H.264 video with 640k Dolby AC3 6ch French audio\r\n\r\nSubtitles included for Arabic Bosnian Croatian Czech Danish Dutch English\r\nFarsi Finnish French German Greek Hungarian Italian Portuguese + Brazilian\r\nRomanian Serbian Slovenian Swedish Turkish and Ukrainian (we had to do a bit\r\nof work on the German subs we found on the net to re-sync sections and lines\r\nfor better timing)\r\n\r\nThis is a look at a torn relationship between a brunette styled Frenchwoman\r\n- Miss B&#xE9;r&#xE9;nice Bejo and two men from the middle east - at least one of whom \r\nMonsieur Asghar Farhadi hails from the Iranian area. many of the best men from\r\nthe middlestern countries such as Iran and Lebanon could pass for Italian even\r\nor Spanish perhaps in the manner in which they choose to believe in their ideas\r\nof manhood and humanism in general i should think and are as good as men as you\r\ncould find in Europe I think so too in any event over the long run I say. \r\n\r\nYou might remember him from the telling movie from Iran (the separation) in which\r\nhe appeared with Ms. Leila Hatami with whom he is very well matched indeed as they share a common bond of mutual understanding and loving care as characters\r\nthat run too deep to be lost in displacement or momentary misunderstandings. \r\nThey know each others moods, temperments, thoughts, ideas, values, and meanings\r\nof all it is that they say and do. They are prepared to accommodate and do what they must do and be in order to meet the needs of each other. These connections\r\nrun deep and are precious to those in the middle east as they are a bastion of \r\ntrue human warmth and genuine deep rooted feeling from the heart and at the core\r\nof their true being that will serve as a bastion of good for the planet in the\r\nyears to come, well into the future I believe.\r\n\r\nThe Frenchwoman in this movie could also have been cast opposite a Spanish or Italian man too perhaps with similar outcome I should think.\r\n\r\nPlease seed this interesting movie which shows a great understanding of the two cultures involved, and is a great read of characters in their differences and\r\nsimilarities that share a bond on the planet, and within their own traditional areas especially - although the Frenchwoman as i say would do well in Spain \r\nor Italy too I&apos;m sure.\r\n\r\nthanks indeed\r\n\r\nMichael Rizzo Chessman\r\n(moviesbyrizzo)","last_updated":"2018-10-06T12:11:29.198Z","parsed":{"xt":"urn:btih:54891937c4eb3f6c7f6dea8d215b2604e92314ed","dn":"Le Passe (The Past) (2013) 1080p H.264 (moviesbyrizzo) multisub","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"54891937c4eb3f6c7f6dea8d215b2604e92314ed","infoHashBuffer":{"type":"Buffer","data":[84,137,25,55,196,235,63,108,127,109,234,141,33,91,38,4,233,35,20,237]},"name":"Le Passe (The Past) (2013) 1080p H.264 (moviesbyrizzo) multisub","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}