{"title":"West Like Lightning by Jim DeFelice EPUB","magnet":"magnet:?xt=urn:btih:54a88919a8f9ef75840038f868df31dd2bdd0470&dn=West+Like+Lightning+by+Jim+DeFelice+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5116654","seeders":"0","leechers":"0","description":"xx\r\n\r\nWest Like Lightning by Jim DeFelice EPUB\r\n\r\nThe thrilling narrative history of one of the most enduring icons of the American West, the Pony Express, from the number-one New York Times best-selling co-author of American Sniper - an exciting tale of daring young men pushing limits to the extremes across the vast, rugged, and unsettled American West.\r\n\r\nIn the spring of 1860 on the eve of a civil war that threatened to tear the country apart, two Americans conceived of an audacious plan for linking the nation&#x2019;s two coasts, thereby joining its present with its future. All that stood in the way was a 1,900 miles of uninhabited desert, ice-capped mountains, oceanic plains roamed by hostile Indian tribes, whitewater-choked rivers, and rugged, unsettled frontier wilderness where &quot;civilized&quot; men where outnumbered a million to one by grizzlies, mountain lions, wolves, bison, rattlesnakes, and more. Many deemed their revolutionary scheme impossible. Run by the Central Overland California and Pikes Peak Express Company, the Pony Express as it came to be known, would use a relay system of daring horseback riders to ferry mail and small packages halfway across a continent in just 10 days. \r\n\r\nThe challenges they faced were enormous, yet the Pony Express succeeded, delivering tens of thousands of letters at record speed. The service would quickly become the most direct means of communication between the Eastern United States and its Western territories, helping to firmly connect them to the Union. West Like Lightning traces the development of the Pony Express and follows it from its start in St. Joseph, Missouri - the edge of the civilized world in the mid-19th century - 1,500 miles west to Sacramento. Jim DeFelice - who traveled the Express&#x2019;s route in his research - plumbs the legends, myths, and true facts of the service, viewing it within the context of the American story and exploring its lasting relevance today. Though the Pony Express was eclipsed by the telegraph in less than two years, it remains today an enduring symbol of American values: rugged individualism, perseverance, and speed. \r\n\r\nxx","last_updated":"2018-05-18T12:09:09.610Z","parsed":{"xt":"urn:btih:54a88919a8f9ef75840038f868df31dd2bdd0470","dn":"West Like Lightning by Jim DeFelice EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"54a88919a8f9ef75840038f868df31dd2bdd0470","infoHashBuffer":{"type":"Buffer","data":[84,168,137,25,168,249,239,117,132,0,56,248,104,223,49,221,43,221,4,112]},"name":"West Like Lightning by Jim DeFelice EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}