{"title":"FantasyMassage - Kimber Woods (BBC Massage) NEW 25 April 2018","magnet":"magnet:?xt=urn:btih:5517c03325eaf438f3dbca5fbed474f8578d9a81&dn=FantasyMassage+-+Kimber+Woods+%28BBC+Massage%29+NEW+25+April+2018&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"337628838","seeders":"17","leechers":"19","description":"Kimber Woods is at home and is bored out of her mind. With nothing to do, she figures she could go check out the new massage parlor that opened up down the street. She picks up the phone and asks the receptionist if she needs to bring anything. She&apos;s never had a massage before and doesn&apos;t know how it works. When she&apos;s told that all she needs to bring is herself, she books the appointment and makes her way down there. When she arrives, she&apos;s greeted by Ricky Johnson. When he tells her he&apos;ll be the one servicing her, she tells him she&apos;s never been massaged by a man before. Ricky tells her not to worry and to go ahead and get undressed. When he enters the room, Kimber is clinging to a towel for dear life. It&apos;s clear to him that she&apos;s a little nervous. He takes it from her, places it on the table and tells her that she just needs to relax. Shy and somewhat reluctant, she follows his lead and lies down on the table. He oils up his hands and starts the massage. He works on her back, her legs, and her ass. Kimber is enjoying his touch but gets uncomfortable when he asks her to take off her bra and panties. Insisting that he simply doesn&apos;t want to get oil on them, she removes them reluctantly. When he starts working on her again, she starts enjoying his touch. When Ricky notices that Kimber has been staring at his cock, he asks her if she wants to see it. She denies this at first, but when he informs her that it&apos;s included in the package she figures she may as well have a look since she paid for it. When he pulls it out she can&apos;t believe how big it is. It only takes a while but eventually, she just has to have it in her mouth and when she&apos;s nice and turned on, she begs him to fuck her and since it&apos;s his job, he can&apos;t help but comply!\r\nCategories Oil, Pussy Licking, Brunette, Body Massage, Blowjob, 69, Cum in Mouth, Facial, Deepthroat, Hardcore\r\n <a href=\"\nhttp://imgdone.com/image/Rs4q\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/Rs4q</a>\r\n <a href=\"\nhttp://imgdone.com/image/RvlL\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/RvlL</a>","last_updated":"2018-04-25T12:09:42.324Z","parsed":{"xt":"urn:btih:5517c03325eaf438f3dbca5fbed474f8578d9a81","dn":"FantasyMassage - Kimber Woods (BBC Massage) NEW 25 April 2018","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5517c03325eaf438f3dbca5fbed474f8578d9a81","infoHashBuffer":{"type":"Buffer","data":[85,23,192,51,37,234,244,56,243,219,202,95,190,212,116,248,87,141,154,129]},"name":"FantasyMassage - Kimber Woods (BBC Massage) NEW 25 April 2018","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}