{"title":"The Good Luck Girls of Shipwreck Lane by Kelly Harms EPUB","magnet":"magnet:?xt=urn:btih:55a469acb44b654e0ced97a263494154810842c1&dn=The+Good+Luck+Girls+of+Shipwreck+Lane+by+Kelly+Harms+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"864177","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Good Luck Girls of Shipwreck Lane by Kelly Harms EPUB\r\n\r\nA debut novel about luck and love, and winning a sweepstakes, with a cast of characters who will charm readers. The Home-Sweet-Home Network has just announced this year&apos;s lucky winner of a brand-new, fully loaded dream home: Janine Brown of Cedar Falls, Iowa. For Janine &quot;Janey&quot; Brown, hearing her name called on the TV has the hallmarks of one of her aunt Midge&apos;s hare-brained plans designed to bring Janey into a world outside the one she once shared with her fiance. Janey, however, is reluctant to give up the safety and sanctity she finds in her tiny kitchen, submerging her anxiety and grief in the pursuit of the perfect pot-au-feu.\r\n\r\nMeanwhile, across town, Janine &quot;Nean&quot; Brown just knows that this house is her destiny. Good fortune took its sweet time showing up in her life, but better late than never. And now that it&apos;s here, the house promises an escape from the latest in her revolving door of crappy jobs and drunk boyfriends. This house will turn her into someone the world sees, instead of the bedraggled girl who others look past without a thought.\r\n\r\nBoth Janine Browns head for Christmas Cove, Maine, to claim the prize they both rightfully think is theirs. When their lives and personalities intersect, however, they discover that more than just a million-dollar dream home awaits them at the water&#x2019;s edge. These three women (oh yes, Aunt Midge comes along for the ride!) arrive at their newfound mansion only to uncover what exactly it means to truly be &quot;home.&quot;\r\n\r\nFilled with wit and charm, The Good Luck Girls of Shipwreck Lane is Kelly Harms&apos;s enchanting and heartfelt debut - a testament to the many, many ways love finds us, the power of a home-cooked meal, and just what it means to be lucky.\r\n\r\nxx","last_updated":"2018-04-23T12:00:33.496Z","parsed":{"xt":"urn:btih:55a469acb44b654e0ced97a263494154810842c1","dn":"The Good Luck Girls of Shipwreck Lane by Kelly Harms EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"55a469acb44b654e0ced97a263494154810842c1","infoHashBuffer":{"type":"Buffer","data":[85,164,105,172,180,75,101,78,12,237,151,162,99,73,65,84,129,8,66,193]},"name":"The Good Luck Girls of Shipwreck Lane by Kelly Harms EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}