{"title":"The Messy Middle by Scott Belsky EPUB","magnet":"magnet:?xt=urn:btih:55c08af7c128272390af815193c21227f571a6ff&dn=The+Messy+Middle+by+Scott+Belsky+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5555499","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Messy Middle: Finding Your Way Through the Hardest and Most Crucial Part of Any Bold Venture by Scott Belsky EPUB\r\n\r\nThe Messy Middle is the indispensable guide to navigating the volatility of new ventures and leading bold creative projects by Scott Belsky, best-selling author, entrepreneur, chief product officer at Adobe, and product advisor to many of today&apos;s top start-ups.\r\n\r\nCreating something from nothing is an unpredictable journey. The first mile births a new idea into existence, and the final mile is all about letting go. We love talking about starts and finishes, even though the middle stretch is the most important and often the most ignored and misunderstood. \r\n\r\nBroken into three sections with 100-plus insights, this no-nonsense book will help you: \r\n\r\nEndure the roller coaster of successes and failures by strengthening your resolve, embracing the long game, and short-circuiting your reward system to get to the finish line. \r\n\r\nOptimize what&#x2019;s working so you can improve the way you hire, better manage your team, and meet your customers&#x2019; needs. \r\n\r\nFinish strong and avoid the pitfalls many entrepreneurs make so you can overcome resistance, exit gracefully, and continue onto you next creative endeavor with ease. \r\n\r\nWith insightful interviews from today&#x2019;s leading entrepreneurs, artists, writers, and executives, as well as Belsky&#x2019;s own experience working with companies like Airbnb, Pinterest, Uber, and sweetgreen, The Messy Middle will outfit you to find your way through the hardest parts of any bold project or new venture.\r\n\r\nxx","last_updated":"2018-10-03T12:01:08.849Z","parsed":{"xt":"urn:btih:55c08af7c128272390af815193c21227f571a6ff","dn":"The Messy Middle by Scott Belsky EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"55c08af7c128272390af815193c21227f571a6ff","infoHashBuffer":{"type":"Buffer","data":[85,192,138,247,193,40,39,35,144,175,129,81,147,194,18,39,245,113,166,255]},"name":"The Messy Middle by Scott Belsky EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}