{"title":"In The Afterlight (The Darkest Minds Book 3) (MOBI, EPUB, PDF)","magnet":"magnet:?xt=urn:btih:55e698e5ea3166dc2195c02d5e9d9b97fb398d88&dn=In+The+Afterlight+%28The+Darkest+Minds+Book+3%29+%28MOBI%2C+EPUB%2C+PDF%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"mwsfan","categoryP":"other","categoryS":"e_books","size":"4279147","seeders":"14","leechers":"2","description":"Book three in the hit series that&apos;s soon to be a major motion picture starring Amandla Stenberg and Mandy Moore--now with a stunning new paperback look and an exclusive bonus short story that delves into the mind of Clancy Gray. Ruby can&apos;t look back. Fractured by an unbearable loss, she and the kids who survived the government&apos;s attack on Los Angeles travel north to regroup. Only Ruby can keep their highly dangerous prisoner in check. But with Clancy Gray, there&apos;s no guarantee you&apos;re fully in control, and everything comes with a price. When the Children&apos;s League disbands, Ruby rises up as a leader and forms an unlikely allegiance with Liam&apos;s brother, Cole, who has a volatile secret of his own. There are still thousands of other Psi kids suffering in government &quot;rehabilitation camps&quot; all over the country. Freeing them--revealing the government&apos;s unspeakable abuses in the process--is the mission Ruby has claimed since her own escape from Thurmond, the worst camp in the country. But not everyone is supportive of the plan Ruby and Cole craft to free the camps. As tensions rise, competing ideals threaten the mission to uncover the cause of IANN, the disease that killed most of America&apos;s children and left Ruby and others with powers the government will kill to keep contained. With the fate of a generation in their hands, there is no room for error. One wrong move could be the spark that sets the world on fire.\r\n\r\n**","last_updated":"2018-06-08T12:12:05.404Z","parsed":{"xt":"urn:btih:55e698e5ea3166dc2195c02d5e9d9b97fb398d88","dn":"In The Afterlight (The Darkest Minds Book 3) (MOBI, EPUB, PDF)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"55e698e5ea3166dc2195c02d5e9d9b97fb398d88","infoHashBuffer":{"type":"Buffer","data":[85,230,152,229,234,49,102,220,33,149,192,45,94,157,155,151,251,57,141,136]},"name":"In The Afterlight (The Darkest Minds Book 3) (MOBI, EPUB, PDF)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}