{"title":"Grass Valley Edius 9.10.3086 Pro [TeamOS]","magnet":"magnet:?xt=urn:btih:56897215e11aa0494d537b7181a1383f030e1bdc&dn=Grass+Valley+Edius+9.10.3086+Pro+%5BTeamOS%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"OnlyByTheRain","categoryP":"applications","categoryS":"windows","size":"743278815","seeders":"21","leechers":"15","description":"EDIUS supports real-time work with video in almost all known formats, as well as with uncompressed video. The program allows you to work with an unlimited number of layers containing audio, video data or effects. Projects created in EDIUS can be saved using the native Canopus HQ codec, which has the option of encoding with variable bitrates. Edius is one of the best professional programs for non-linear video editing. Supports editing video formats AVCHD, HDV, DV, MPEG-1, MPEG-2 in real time. \r\n\r\nFeatures of Grass Valley EDIUS: \r\n\r\nInstallation of all kinds of HD / SD formats, including DV, HDV, AVCHD, MPEG-2, Windows Media and QuickTime, in real time.\r\nFlexible user interface, unlimited number of tracks for video, sound, captions and graphics \r\nEditing and converting in real time of all kinds of HD / SD formats (16: 9 and 4: 3) \r\nEditing and converting in real time video with different frame rates of 60i, 50i and 24p \r\nEditing and converting in real time video with different resolutions 1440x1080, 1280x720 and 720x480 \r\nHD / SD effects, keros, transitions and titles in real time \r\nDV video output in real time directly from the time line \r\nThe possibility of editing immediately several cognitions on one time line \r\nHigh-speed export HDV \r\nCoding of individual segments of a time line (&apos;Smart Rendering&apos;). With the support of MPEG and HDV, Segment Encoding greatly reduces the time it takes to export a project by encoding only edited and modified clip segments \r\nDVD authoring on time line \r\nSoftware utility Quick Titler for titration, working in real time \r\nSupport for new file formats based, even Infiniti JPEG 2000, XDCAM and XDCAM EX, P2 (DVCPRO and AVC-Intra), and GFCAM \r\nMulti-cameras, editing up to eight different sources at one and the same time \r\nHigh speed SD HDV and MPEG-2 export, built on dual-core technology \r\nDirect-to-DVD export","last_updated":"2018-03-17T12:12:06.703Z","parsed":{"xt":"urn:btih:56897215e11aa0494d537b7181a1383f030e1bdc","dn":"Grass Valley Edius 9.10.3086 Pro [TeamOS]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"56897215e11aa0494d537b7181a1383f030e1bdc","infoHashBuffer":{"type":"Buffer","data":[86,137,114,21,225,26,160,73,77,83,123,113,129,161,56,63,3,14,27,220]},"name":"Grass Valley Edius 9.10.3086 Pro [TeamOS]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}