{"title":"Code Name_ Johnny Walker by Jim DeFelice, Johnny Walker EPUB","magnet":"magnet:?xt=urn:btih:577464f634fb89fdeb5941cf98c16b6db1a2007e&dn=Code+Name_+Johnny+Walker+by+Jim+DeFelice%2C+Johnny+Walker+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1039756","seeders":"0","leechers":"0","description":"xx\r\n\r\nCode Name_ Johnny Walker by Jim DeFelice, Johnny Walker EPUB\r\n\r\nIn this illuminating and informative memoir, an Iraqi translator who risked his life working with American Sniper author Chris Kyle and the Navy SEALs tells his remarkable and inspiring story, offering a refreshing new perspective on the Iraq War.\r\n\r\nAs the insurgency in Iraq intensified following the American invasion, U.S. Navy SEALs were called upon to root terrorists from their lairs. Unsure of the local neighborhoods and unable to speak the local languages, they came to rely on one man to guide them and watch their backs. He was a &quot;terp&quot; - an interpreter - with a job so dangerous they couldn&apos;t even use his real name. They named him Johnny Walker. They soon called him brother.\r\n\r\nOver the course of eight years, the Iraqi native traveled around the country with nearly every SEAL and special operations unit deployed there. He went on thousands of missions, saved dozens of SEAL and other American lives, and risked his own daily. Helped to the U.S. by the SEALs he protected, Johnny Walker&apos;s life is so remarkable that his tale sounds like fiction. But every word of it is true.\r\n\r\nFor the first time ever, a &quot;terp&quot; tells what it was like in Iraq during the American occupation. With inside details on SEAL operations and a humane understanding of how most civilians caught between the terrorists and the new government really felt, Code Name: Johnny Walker reveals a side of the war never told before.\r\n\r\nxx","last_updated":"2018-02-07T12:06:05.375Z","parsed":{"xt":"urn:btih:577464f634fb89fdeb5941cf98c16b6db1a2007e","dn":"Code Name_ Johnny Walker by Jim DeFelice, Johnny Walker EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"577464f634fb89fdeb5941cf98c16b6db1a2007e","infoHashBuffer":{"type":"Buffer","data":[87,116,100,246,52,251,137,253,235,89,65,207,152,193,107,109,177,162,0,126]},"name":"Code Name_ Johnny Walker by Jim DeFelice, Johnny Walker EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}