{"title":"WinRAR (32/64 bit) 5.60 beta 5 Full With Medicine[BabuPC]","magnet":"magnet:?xt=urn:btih:5820e926e22e2a659d4c2e324351ddea8ebf64df&dn=WinRAR+%2832%2F64+bit%29+5.60+beta+5+Full+With+Medicine%5BBabuPC%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BabuPC","categoryP":"applications","categoryS":"windows","size":"6369341","seeders":"0","leechers":"0","description":"WinRAR (32/64 bit) 5.60 beta 5 Full\r\n\r\nWinRAR is an archiving utility that completely supports RAR and ZIP archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, 7Z, Z archives. It consistently makes smaller archives than the competition, saving disk space and transmission costs.\r\n\r\nWinRAR offers a graphic interactive interface utilizing mouse and menus as well as the command line interface. WinRAR is easier to use than many other archivers with the inclusion of a special &#x201C;Wizard&#x201D; mode which allows instant access to the basic archiving functions through a simple question and answer procedure.\r\n\r\nWinRAR offers you the benefit of industry strength archive encryption using AES (Advanced Encryption Standard) with a key of 128 bits. It supports files and archives up to 8,589 billion gigabytes in size. It also offers the ability to create selfextracting and multivolume archives. With recovery record and recovery volumes, you can reconstruct even physically damaged archives.\r\n\r\nWinRAR is a 32-bit/64-bit Windows version of RAR Archiver. It can backup your data and reduce the size of email attachments, decompress RAR, ZIP and other files downloaded from Internet and create new archives in RAR and ZIP file format.\r\n\r\nWinRAR&#x2019;s main features are very strong general and multimedia compression, solid compression, archive protection from damage, processing of ZIP and other non-RAR archives, scanning archives for viruses, programmable self-extracting archives(SFX), authenticity verification, NTFS and Unicode support, strong AES encryption, support of multivolume archives, command line and graphical interface, drag-and-drop facility, wizard interface, theme support, folder tree panel, multithread support and Windows x64 shell integration","last_updated":"2018-06-06T12:04:29.870Z","parsed":{"xt":"urn:btih:5820e926e22e2a659d4c2e324351ddea8ebf64df","dn":"WinRAR (32/64 bit) 5.60 beta 5 Full With Medicine[BabuPC]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5820e926e22e2a659d4c2e324351ddea8ebf64df","infoHashBuffer":{"type":"Buffer","data":[88,32,233,38,226,46,42,101,157,76,46,50,67,81,221,234,142,191,100,223]},"name":"WinRAR (32/64 bit) 5.60 beta 5 Full With Medicine[BabuPC]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}