{"title":"Inner City Pressure: The Story of Grime by Dan Hancox AZW3","magnet":"magnet:?xt=urn:btih:59a9665de53bb90a4f49a041c43a33b90e245bf2&dn=Inner+City+Pressure%3A+The+Story+of+Grime+by+Dan+Hancox+AZW3&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2332527","seeders":"0","leechers":"0","description":"xx\r\n\r\nInner City Pressure: The Story of Grime by Dan Hancox AZW3\r\n\r\nThe year 2000. As Britain celebrates the new millennium, something fluorescent and futuristic is stirring in the crumbling council estates of inner city London. Making beats on stolen software, spitting lyrics on tower block rooftops and beaming out signals from pirate radio aerials, a group of teenagers raised on UK garage, American hip-hop and Jamaican reggae stumble upon a dazzling new genre.\r\n\r\nAgainst all odds, these young MCs will grow up to become some of the UK&#x2019;s most famous musicians, scoring number one records and dominating British pop culture for years to come. Hip-hop royalty will fawn over them, billion-dollar brands will queue up to beg for their endorsements and, through their determined DIY ethics, they&#x2019;ll turn the music industry&apos;s logic on its head.\r\n\r\nBut getting there won&#x2019;t be easy. Successive governments will attempt to control their music, their behaviour and even their clothes. The media will demonise them, and the police will shut down their clubs. National radio stations and live music venues will ban them. There will be riots, fighting in the streets and even murder. And the inner city landscape that shaped them will be changed beyond all recognition.\r\n\r\nDrawn from over a decade of in-depth interviews and research with all the key MCs, DJs and industry players, in this extraordinary book the UK&#x2019;s greatest grime journalist, Dan Hancox, tells the remarkable story of how a group of outsiders from the margins of urban life went on to create a genre that has become a British institution. Here, for the first time, is the full story of grime.\r\n\r\nxx","last_updated":"2018-05-18T12:04:44.185Z","parsed":{"xt":"urn:btih:59a9665de53bb90a4f49a041c43a33b90e245bf2","dn":"Inner City Pressure: The Story of Grime by Dan Hancox AZW3","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"59a9665de53bb90a4f49a041c43a33b90e245bf2","infoHashBuffer":{"type":"Buffer","data":[89,169,102,93,229,59,185,10,79,73,160,65,196,58,51,185,14,36,91,242]},"name":"Inner City Pressure: The Story of Grime by Dan Hancox AZW3","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}