{"title":"DaddysLilAngel - Tiffany Watson (Fuck My Ass) NEW 15 May 2018","magnet":"magnet:?xt=urn:btih:59b94121e8c02953ef69437b925fb87c324358d9&dn=DaddysLilAngel+-+Tiffany+Watson+%28Fuck+My+Ass%29+NEW+15+May+2018&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"552418048","seeders":"2","leechers":"4","description":"Lusty coed Tiffany Watson wants some, and her stepbrother is her first choice to satisfy her lusty urges. When she&apos;s unsuccessful in seducing her stepbrother with the promise of her perfect tits and her sweet landing strip twat, she tries begging. Tiffany&apos;s ratted her out to her stepdad Tony, who confronts Tiffany in her bedroom. He turns Tiffany over and spanks her while spelling out her punishment, and she offers to do anything if he&apos;ll agree not to take her car away.When Tiffany offers to suck Tony&apos;s cock in exchange for a lenient punishment, he finds that he is weaker-willed than his son. He agrees, and once his stepdaughter&apos;s soft lips are wrapped around his big dick he knows he&apos;s made the right choice. Tiffany is masterful with her mouth, so when she gets on her knees and offers her stepdad the chance to fuck her he can&apos;t resist.Rolling onto her back, Tiffany brings her sock-covered knees up to her chest to open herself so her stepdad can push his hardon deep into her ass. Once they start anal sex, Tiffany is quick to get back on her knees so she can enjoy the penetration from that angle. She finishes herself off by riding Tony&apos;s fuck stick until she achieves an anal climax. Rolling off her stepdad, she sucks him off until he fills her mouth with a salty shot of cum. Now that she&apos;s proved she&apos;s a good girl, Tony decides that Tiffany deserves a reward more than a punishment.\r\nCategories: Shaved Pussy Blonde Petite Camel Toe Anal Sex Girl-Boy Blowjob Handjob Girl Orgasm POV Deep Throat Big Dick Pussy Licking\r\n <a href=\"\nhttp://imgdone.com/image/XtdG1\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/XtdG1</a>\r\n <a href=\"\nhttp://imgdone.com/image/Xt30M\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/Xt30M</a>","last_updated":"2018-05-15T12:08:08.224Z","parsed":{"xt":"urn:btih:59b94121e8c02953ef69437b925fb87c324358d9","dn":"DaddysLilAngel - Tiffany Watson (Fuck My Ass) NEW 15 May 2018","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"59b94121e8c02953ef69437b925fb87c324358d9","infoHashBuffer":{"type":"Buffer","data":[89,185,65,33,232,192,41,83,239,105,67,123,146,95,184,124,50,67,88,217]},"name":"DaddysLilAngel - Tiffany Watson (Fuck My Ass) NEW 15 May 2018","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}