{"title":"The Higherside Chats Plus - Mark Passio - The Occult Cabal, Our","magnet":"magnet:?xt=urn:btih:59da8ca9f7dccf21b2d361075d97f2f070eb0f5c&dn=The+Higherside+Chats+Plus+-+Mark+Passio+-+The+Occult+Cabal%2C+Our&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"roflcopter2110","categoryP":"audio","categoryS":"other","size":"64264904","seeders":"12","leechers":"1","description":"The Higherside Chats Plus - Mark Passio - The Occult Cabal, Our Slave System and Natural Law May 28 2018.mp3 - 2h 10min 64.0 kb/s\r\n <a href=\"\nhttps://extraimage.net/images/2018/06/02/ef5a6ad2138ee389fad5eab10875188b.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://extraimage.net/images/2018/06/02/ef5a6ad2138ee389fad5eab10875188b.jpg</a>\r\n\r\nAlright Higherside Chatters, we have spent years talking about the problems of the world: War, poverty, geo-engineering, fluoride, petrochemicals, environmental destruction, materialism, greed, false flags, &amp; everything in between in this Rockefeller/Rothschild debt based system of rule and sometimes I get a bit concerned that all we do is pat ourselves on the back for another educational circle jerk while we sit and wait for someone else to overthrow the power pyramid and the yolks of oppression we seem so cozy in.\r\n\r\nAnd an uncomfortable truth we must confront is the relationship between slave and master- the cause and effect of following orders, and the &#x201C;don&apos;t rock the boat&#x201D; attitude we take, as long as our cage is a little bit nicer than the next guys.\r\n\r\nYet when one truly examines the world we find ourselves in- you see a multitude of constructs holding us in place that have nothing to do with the natural world:  A never ending framework of legalese that privileges the dark occults in the drivers seat and punishes the people who put their faith in it. - A hypnotic obsession with green paper, thanks to the spellcrafters behind the curtain. - &amp; a system of artificial scarcity aimed at maintaining the illusion that abundance is only a fantasy.\r\n\r\nWell, these are the tenants of today&apos;s guest, and true freedom fighter- the ever-passionate Mark Passio. Mark initially rejected his religious upbringing by becoming a Satanist as an early act of rebellion, and eventually was even offered a position as a priest in the Church of Satan by Anton LaVey himself. But after leaving the dark community of group-think---he forged his path as a true individual- studying the vast and complex depths of metaphysics, occultism, spirituality, symbolism, consciousness and more....and for the last 10 years, has been bringing this knowledge to light through his website, videos, presentations, and weekly radio show which can be found at WhatOnEarthIsHappening.com\r\n\r\nHe&apos;s a passionate advocate of natural law, a committed de-occultist deconstructing the spells of slavery, and the truth-telling torcher of sacred cows &#x2013; long time coming, Mark Passio.\r\n\r\nGeneral           : The Higherside Chats Plus - Mark Passio - The Occult Cabal, Our Slave System and Natural Law May 28 2018.mp3\r\nFormat            : MPEG Audio at 64.0 kb/s\r\nLength            : 61.3 MiB for 2 h 10 min 4 s 940 ms\r\n\r\nAudio #0          : MPEG Audio at 64.0 kb/s\r\nInfos             : 1 channel, 44.1 kHz","last_updated":"2018-06-02T12:09:49.779Z","parsed":{"xt":"urn:btih:59da8ca9f7dccf21b2d361075d97f2f070eb0f5c","dn":"The Higherside Chats Plus - Mark Passio - The Occult Cabal, Our","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"59da8ca9f7dccf21b2d361075d97f2f070eb0f5c","infoHashBuffer":{"type":"Buffer","data":[89,218,140,169,247,220,207,33,178,211,97,7,93,151,242,240,112,235,15,92]},"name":"The Higherside Chats Plus - Mark Passio - The Occult Cabal, Our","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}