{"title":"Jens Peter Jacobsen - Niels Lyhne and other works (5 books)","magnet":"magnet:?xt=urn:btih:5a316d8a4c0dc6e5e5c258ef341acfb0b8187bb8&dn=Jens+Peter+Jacobsen+-+Niels+Lyhne+and+other+works+%285+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"13364281","seeders":"26","leechers":"2","description":"\nJENS PETER JACOBSEN (1847-1885) was a Danish novelist and poet who inaugurated the Naturalist mode of fiction in Denmark and was himself its most famous representative.  Although his canon consists only of two novels, seven short stories, and one posthumous volume of poetry, it was enough to place him among the most influential Danish writers.\n\nHis two great passions in life were science and literature.  He translated into Danish the two monumental works of Charles Darwin, On the Origin of Species and The Descent of Man, and he was the first to write articles explaining these radical new ideas to the general public in Denmark. \n\nHis great historical romance MARIE GRUBBE (1876) is based on the life of an authentic 17th century Danish noblewoman and charts her downfall from a member of the royal family to the wife of a ferryman, as a result of her desire for an independent and satisfying erotic life.  The book was attacked by the conservative press for its crass realism.  Jacobsen&apos;s second novel, NIELS LYHNE (1880), traces the fate of an aspiring poet, torn between romanticism and realism, faith and reason.  Through his relationships with six women &#x2014; including his young widowed aunt, a seductive free spirit, and his passionate cousin who marries his friend &#x2014; his search for purpose becomes a yielding to disillusionment.  It remains one of Danish literature&#x2019;s greatest novels, with nods to Kierkegaard and a protagonist some critics have compared to Hamlet.\n\nHis short stories are collected in MOGENS AND OTHER TALES (1882), including &quot;Mogens&quot;, the tale of a young dreamer and his maturing during love, sorrow and new hope of love; &quot;A Shot in the Fog&quot;, a Poe-inspired tale of the sterility of hatred and revenge; &quot;The Plague at Bergamo&quot;, which shows people clinging to religion even when tempted to be &quot;free men&quot;; and &quot;Mrs Fonss&quot;, a sad story about a widow&apos;s tragic break with her egoistic children when she wants to remarry.\n\nAt the turn of the 20th century, Jacobsen&apos;s writings and exquisite style exerted a spellbinding influence upon a great number of writers both in Denmark and abroad.  Among his most ardent worshipers were such poets as Stefan George and Rainer Maria Rilke, but he also influenced Ibsen, Freud, Mann, Hesse, Zweig, and D. H. Lawrence, all of whom praised his contributions.\n\n\nThe following books are in PDF format unless otherwise noted:\n\n* Marie Grubbe (Boni &amp; LIveright, 1918).  Hanna Astrup Larsen, trans.\n* Mogens and Other Stories (Wildside, 2003).  Anna Grabow, trans.\n* Niels Lyhne (ASF, 1919).  Hanna Astrup Larsen, trans.\n* Niels Lyhne (Fjord, 1990).  Tina Nunnally, trans. (PDF by @Mohamed5438]\n* Niels Lyhne (Penguin, 2006).  Tina Nunnally, trans.; E. Johannesson, intro. -- ePUB\n\n____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-10-11T12:28:45.270Z","parsed":{"xt":"urn:btih:5a316d8a4c0dc6e5e5c258ef341acfb0b8187bb8","dn":"Jens Peter Jacobsen - Niels Lyhne and other works (5 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5a316d8a4c0dc6e5e5c258ef341acfb0b8187bb8","infoHashBuffer":{"type":"Buffer","data":[90,49,109,138,76,13,198,229,229,194,88,239,52,26,207,176,184,24,123,184]},"name":"Jens Peter Jacobsen - Niels Lyhne and other works (5 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}