{"title":"[dream-pop, shoegaze] (2018) Swoone – ","magnet":"magnet:?xt=urn:btih:5a8c0083371cde5f199ab6b5ba519c37db9c001e&dn=%5Bdream-pop%2C+shoegaze%5D+%282018%29+Swoone+%26ndash%3B+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"100.XY","categoryP":"audio","categoryS":"flac","size":"255484562","seeders":"0","leechers":"0","description":"(2018) Swoone &#x2013; Handcuffed Heart\r\n\r\nReview: \r\nFinally, the eagerly awaited debut album from the darkly sophisticated London duo, Swoone. \r\nThis is an album, brimming with quality, depth and heart breaking beauty. Siobhan Demare, who&#x2019;s sensual and exquisite vocals, have been in demand by the likes of guitar legend, Robin Guthrie and 90&#x2019;s chart toppers Mono, finally break free to create a breathtaking album of pure class. Here Siobhan is more in control, more expressive and in the finest song writing form of her career. Fans of her sultry delivery will also be mesmerised by her stunning melodies and poignant lyrics. Her beautiful voice conveys such intimacy it vividly populates a gorgeously rich and cinematic aural landscape. The music is deeply emotional and genuinely felt, not because composer Gary Bruce knows how to write and play this kind of music, indeed, the opposite is true, he has no musical training or knowledge. His keyboard has the notes written on them pencil and he slowly develops guitar chords from scratch! Instead of using musical theory Gary painstakingly creates a musical landscape navigated by feelings alone. It is this probing of the heart that produces music that is refreshingly genuine and instantly arresting. \r\nEvery song is a film in miniature, from a classic thriller, to David Lynch to european cinema. Think Portishead&#x2019;s homage to John Barry with touch of 60&#x2019;s soul and eno-esque colour. Every track is different, suprisingly so, with all the influences two eclectic souls have haunting their psyches. Ideas that have been fermenting for two lifetimes have matured into something sweet and rich. Diverse influences include 90&#x2019;s trip hop, The Carpenters, Billy Holiday, dub, The Ronettes, shoegaze, Nina Simone, Dusty Springfield, Chris Isaac, Donny Hathaway, Al Green and Pink Floyd! There is no following fashion here, just the love of feeling music deeply. Intriguing, yes it is. Can you hear these influences? Yes you can! And with such influences this is an album to cherish, an album that reveals more layers with each listen, an indie classic. \r\nWallow in the sultry vocals, heartfelt words, cavernous guitars, swelling strings and super cool beats. Just listen to to each perfect song to know that each one is a jewel, original and unique in its own right. Shine on Swoone! \r\n\r\nTracklist: \r\n01. This Bullet Never Kills.flac \r\n02. Breaking Down.flac \r\n03. Handcuffed Heart.flac \r\n04. Terminal 3.flac \r\n05. The Sun Has Died.flac \r\n06. Run.flac \r\n07. Pearlesque.flac \r\n08. Set Me Free.flac \r\n09. Strange Love.flac \r\n10. Room 56.flac \r\n11. Empty Buildings.flac \r\n\r\nSummary: \r\nCountry: UK \r\nGenre: dream-pop, shoegaze","last_updated":"2018-09-09T12:22:05.920Z","parsed":{"xt":"urn:btih:5a8c0083371cde5f199ab6b5ba519c37db9c001e","dn":"[dream-pop, shoegaze] (2018) Swoone &ndash; ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5a8c0083371cde5f199ab6b5ba519c37db9c001e","infoHashBuffer":{"type":"Buffer","data":[90,140,0,131,55,28,222,95,25,154,182,181,186,81,156,55,219,156,0,30]},"name":"[dream-pop, shoegaze] (2018) Swoone &ndash; ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}