{"title":"[electronic, post-rock] (2016) All India Radio - The Slow Light ","magnet":"magnet:?xt=urn:btih:5ade1d12a61e82beffcb56a5f73dcb47a411f170&dn=%5Belectronic%2C+post-rock%5D+%282016%29+All+India+Radio+-+The+Slow+Light+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"100.XY","categoryP":"audio","categoryS":"flac","size":"297017111","seeders":"3","leechers":"4","description":"(2016) All India Radio - The Slow Light\r\n\r\nReview: \r\nMartin Kennedy, the masterful, mind-expanding musical mastermind behind All India Radio has once again crafted a masterpiece with his 10th studio album The Slow Light. \r\nKennedy has skillfully and subtly blended the soporific drop of down-tempo trip-hop with the drift of dreamgaze reveries and the shadowside of Western American noir throughout The Slow Light. \r\nThe gently breaking dawn starts with entrancing album-opener &#x201C;Blueshift&#x201D;. Starlight synths transmit delicately spacey waves while languid reverb guitar lines unfurl at a meditative pace. The stage has been set for next number &#x201C;Dark Star&#x201D; to shine in all of its noir splendor. A touch of static, quickly ticking drumsticks, and a steadily shuffling beat are accompanied by reflective, echoed piano notes and a deeper current of synths. The drum tempo shifts into a kinetic rhythm for a brief moment, while shining reverb guitar lines loop out from the marching drum pattern. \r\nA pulsing, bass line-like beat presses persistently through &#x201C;Can You Hear the Sound&#x201D;, as well as the percolation of tapped cymbals and flat-smacked drums. Vibrating guitar reverb slides into a gauzy web of lightly chiming acoustic guitar lines and gently swooping synths. Vocalist Selena Cross materializes from the instrumental ether, softly singing &#x201C;Listen / Can you hear the sound of nothing but the air / and the sky and the Earth / and the stars and the universe?&#x201D; This key lyrics passage pretty much sums up The Slow Light&#x2019;s state of mind and sound. Meanwhile, the transfixing title track floats in the (head)space of a deliberate trip-hop beat, a patina of static, and glowing synth notes. Faintly-heard, knob-twiddling radio frequency notes emerge fleetingly, but are shooed mildly away by the leisurely fall and rise of curving guitar lines and synth drift. \r\nPhased globular notes punctuate the laid-back &#x201C;Sunburst&#x201D; as a slow beat and clacking and shimmering percussion, acoustic guitar gleam, and wordless, echoed hums and sighs from Cross run through the track. &#x201C;Redshift&#x201D; segues into a soul-pop shimmy, dancing along furtively with a burnished, shuffling rhythmic groove and bass line undertow. Little licks of electric-blue guitar are backed by the deeper pulls of symphonic strings, and passionate, yet restrained piano notes. \r\n\r\nTracklist: \r\n1. Blueshift (2:49) \r\n2. Dark Star (4:59) \r\n3. Can You Hear the Sound (4:17) \r\n4. The Slow Light (4:11) \r\n5. Sunburst (4:46) \r\n6. Redshift (5:39) \r\n7. Galaxy of Light (4:42) \r\n8. Twelve (3:49) \r\n9. Time (4:00) \r\n10. The Embers (2:25) \r\n11. Warped Ring Theory (Bonus Track) (5:12) \r\n12. Can You Hear the Sound (Chillwave Mix) (Bonus Track) (4:16) \r\n\r\nSummary: \r\nCountry: USA \r\nGenre: electronic, post-rock","last_updated":"2018-06-30T12:08:04.628Z","parsed":{"xt":"urn:btih:5ade1d12a61e82beffcb56a5f73dcb47a411f170","dn":"[electronic, post-rock] (2016) All India Radio - The Slow Light ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5ade1d12a61e82beffcb56a5f73dcb47a411f170","infoHashBuffer":{"type":"Buffer","data":[90,222,29,18,166,30,130,190,255,203,86,165,247,61,203,71,164,17,241,112]},"name":"[electronic, post-rock] (2016) All India Radio - The Slow Light ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}