{"title":"Love and Ruin by Paula McLain EPUB","magnet":"magnet:?xt=urn:btih:5b2ee12601a410989cdad8bd3f01d166f5499c34&dn=Love+and+Ruin+by+Paula+McLain+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2814475","seeders":"0","leechers":"0","description":"xx\r\n\r\nLove and Ruin by Paula McLain EPUB\r\n\r\nThe best-selling author of The Paris Wife returns to the subject of Ernest Hemingway in a novel about his passionate, stormy marriage to Martha Gellhorn - a fiercely independent, ambitious young woman who would become one of the greatest war correspondents of the 20th century\r\n\r\nIn 1937, 28-year-old Martha Gellhorn travels alone to Madrid to report on the atrocities of the Spanish Civil War and becomes drawn to the stories of ordinary people caught in the devastating conflict. It&apos;s the adventure she&apos;s been looking for and her chance to prove herself a worthy journalist in a field dominated by men. But she also finds herself unexpectedly - and uncontrollably - falling in love with Hemingway, a man on his way to becoming a legend.\r\n\r\nIn the shadow of the impending Second World War, and set against the turbulent backdrops of Madrid and Cuba, Martha and Ernest&apos;s relationship and their professional careers ignite. But when Ernest publishes the biggest literary success of his career, For Whom the Bell Tolls, they are no longer equals, and Martha must make a choice: surrender to the confining demands of being a famous man&apos;s wife or risk losing Ernest by forging a path as her own woman and writer. It is a dilemma that could force her to break his heart, and hers.\r\n\r\nHeralded by Ann Patchett as &quot;the new star of historical fiction&quot;, Paula McLain brings Gellhorn&apos;s story richly to life and captures her as a heroine for the ages: a woman who will risk absolutely everything to find her own voice.\r\n\r\nxx","last_updated":"2018-05-11T12:00:46.328Z","parsed":{"xt":"urn:btih:5b2ee12601a410989cdad8bd3f01d166f5499c34","dn":"Love and Ruin by Paula McLain EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5b2ee12601a410989cdad8bd3f01d166f5499c34","infoHashBuffer":{"type":"Buffer","data":[91,46,225,38,1,164,16,152,156,218,216,189,63,1,209,102,245,73,156,52]},"name":"Love and Ruin by Paula McLain EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}