{"title":"Hunting Charles Manson by Lis Wiehl EPUB","magnet":"magnet:?xt=urn:btih:5c23b7f329b2b6cba1d959a09102793c6f29df7d&dn=Hunting+Charles+Manson+by+Lis+Wiehl+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1479288","seeders":"0","leechers":"1","description":"xx\r\n\r\nHunting Charles Manson by Lis Wiehl EPUB\r\n\r\nNew York Times best-selling author and former federal prosecutor Lis Wiehl uses new research and first-hand interviews to tell the heart-pounding story of Charles Manson&#x2019;s horrific crimes, the painstaking investigation that followed, and the inspired prosecution that put him away.\r\n\r\nIn the late summer of 1969, the nation was transfixed by a series of gruesome murders in the hills of Los Angeles. Newspapers and television programs detailed the brutal slayings of a beautiful actress - 26 years old and eight months pregnant with her first child - as well as a hair stylist, an heiress, a small businessman, and other victims. The City of Angels was plunged into a nightmare of fear and dread. In the weeks and months that followed, law enforcement faced intense pressure to solve crimes that seemed to have no connection.\r\n\r\nFinally, after months of dead-ends, false leads, and near-misses, Charles Manson and members of his &quot;family&quot; were arrested. The bewildering trials that followed once again captured the nation and forever secured Manson as a byword for the evil that men do.\r\n\r\nDrawing upon deep archival research and exclusive personal interviews - including unique access to Manson Family parole hearings - former Fox News legal analyst and best-selling author Lis Wiehl gives readers a propulsive, pause-resisting historical thriller of the crimes and a manhunt that mesmerized the nation. And in the process, she reveals how the social and political context that gave rise to Manson is eerily similar to our own.\r\n\r\nxx","last_updated":"2018-06-11T12:01:11.916Z","parsed":{"xt":"urn:btih:5c23b7f329b2b6cba1d959a09102793c6f29df7d","dn":"Hunting Charles Manson by Lis Wiehl EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5c23b7f329b2b6cba1d959a09102793c6f29df7d","infoHashBuffer":{"type":"Buffer","data":[92,35,183,243,41,178,182,203,161,217,89,160,145,2,121,60,111,41,223,125]},"name":"Hunting Charles Manson by Lis Wiehl EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}