{"title":"They Marched Into Sunlight by David Maraniss EPUB","magnet":"magnet:?xt=urn:btih:5c468a8d70e31c888767d3c11516b561e25b28c1&dn=They+Marched+Into+Sunlight+by+David+Maraniss+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1776229","seeders":"40","leechers":"1","description":"xx\r\n\r\nThey Marched Into Sunlight: War and Peace, Vietnam and America, October 1967 by David Maraniss EPUB\r\n\r\nHere is the epic story of Vietnam and the sixties told through the events of a few tumultuous days in October 1967. With meticulous and captivating detail, They Marched Into Sunlight brings that catastrophic time back to life while examining questions about the meaning of dissent and the official manipulation of truth, issues that are as relevant today as they were decades ago.\r\n\r\nIn the long Nguyen Secret Zone of Vietnam, a renowned battalion of the First Infantry Division is marching into a devastating ambush that will leave sixty-one soldiers dead and an equal number wounded. On the University of Wisconsin campus in Madison, students are staging an obstructive protest at the Commerce Building against recruiters for Dow Chemical Company, makers of napalm and Agent Orange, that ends in a bloody confrontation with club-wielding Madison police. And in Washington, President Lyndon Johnson is dealing with pressures closing in on him from all sides and lamenting to his war council, &quot;How are we ever going to win this war?&quot;\r\n\r\nBased on thousands of primary documents and 180 on-the-record interviews, the story unfolds day by day, hour by hour, and at times minute by minute with a rich cast of characters as they move toward battles that forever shaped their lives and evoked cultural and political conflicts that reverberate still.\r\n\r\nxx","last_updated":"2018-09-22T12:28:58.954Z","parsed":{"xt":"urn:btih:5c468a8d70e31c888767d3c11516b561e25b28c1","dn":"They Marched Into Sunlight by David Maraniss EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5c468a8d70e31c888767d3c11516b561e25b28c1","infoHashBuffer":{"type":"Buffer","data":[92,70,138,141,112,227,28,136,135,103,211,193,21,22,181,97,226,91,40,193]},"name":"They Marched Into Sunlight by David Maraniss EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}