{"title":"Hippies, Indians, .. the Fight for Red Power by S. L. Smith EPUB","magnet":"magnet:?xt=urn:btih:5c65554e9476e612a6e839902e43374bd63dfdcc&dn=Hippies%2C+Indians%2C+..+the+Fight+for+Red+Power+by+S.+L.+Smith+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5111053","seeders":"0","leechers":"0","description":"xx\r\n\r\nHippies, Indians, .. the Fight for Red Power by S. L. Smith EPUB\r\n\r\nThrough much of the 20th century, federal policy toward Indians sought to extinguish all remnants of native life and culture. That policy was dramatically confronted in the late 1960s when a loose coalition of hippies, civil rights advocates, Black Panthers, unions, Mexican-Americans, Quakers and other Christians, celebrities, and others joined with Red Power activists to fight for Indian rights.\r\n\r\nIn Hippies, Indians and the Fight for Red Power, Sherry Smith offers the first full account of this remarkable story. Hippies were among the first non-Indians of the post-World War II generation to seek contact with Native Americans. The counterculture saw Indians as genuine holdouts against conformity, inherently spiritual, ecological, tribal, communal - the original &quot;long hairs&quot;. Searching for authenticity while trying to achieve social and political justice for minorities, progressives of various stripes and colors were soon drawn to the Indian cause. Black Panthers took part in Pacific Northwest fish-ins. Corky Gonzales&apos; Mexican American Crusade for Justice provided supplies and support for the Wounded Knee occupation. Actor Marlon Brando and comedian Dick Gregory spoke about the problems Native Americans faced. For their part, Indians understood they could not achieve political change without help. Non-Indians had to be educated and enlisted. Smith shows how Indians found, among this hodge-podge of dissatisfied Americans, willing recruits to their campaign for recognition of treaty rights; realization of tribal power, sovereignty, and self-determination; and protection of reservations as cultural homelands. The coalition was ephemeral but significant, leading to political reforms that strengthened Indian sovereignty.\r\n\r\nThoroughly researched and vividly written, this book not only illuminates this transformative historical moment but contributes greatly to our understanding about social movements.\r\n\r\nxx","last_updated":"2018-04-12T12:48:08.431Z","parsed":{"xt":"urn:btih:5c65554e9476e612a6e839902e43374bd63dfdcc","dn":"Hippies, Indians, .. the Fight for Red Power by S. L. Smith EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5c65554e9476e612a6e839902e43374bd63dfdcc","infoHashBuffer":{"type":"Buffer","data":[92,101,85,78,148,118,230,18,166,232,57,144,46,67,55,75,214,61,253,204]},"name":"Hippies, Indians, .. the Fight for Red Power by S. L. Smith EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}