{"title":"If We Had Known by Elise Juska EPUB","magnet":"magnet:?xt=urn:btih:5dea5a5ea82be782dd64c908e76c4154a7bddb7a&dn=If+We+Had+Known+by+Elise+Juska+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"548193","seeders":"0","leechers":"0","description":"xx\r\n\r\nIf We Had Known by Elise Juska EPUB\r\n\r\nA literary tour de force from the acclaimed author of The Blessings - a riveting new novel about one of the most urgent crises of our time.\r\n\r\nOne August afternoon, as single mother Maggie Daley prepares to send her only child off to college, their world is shattered by news of a mass shooting at the local mall in rural Maine. As reports and updates about the tragedy begin to roll in, Maggie, an English professor, is further stunned to learn that the gunman had been a student of hers.\r\n\r\nNathan Dugan was an awkward, complicated young man whose quiet presence in her classroom had faded from her memory - but not, it seems, the memories of his classmates. When a viral blog post hints at the existence of a dark, violence-tinged essay Nathan had written during Maggie&apos;s freshman comp seminar, Maggie soon finds herself at the center of a heated national controversy. Could the overlooked essay have offered critical red flags that might have warned of, or even prevented, the murders to come? As the media storm grows around her, Maggie makes a series of desperate choices that threaten to destroy not just the personal and professional lives she&apos;s worked so hard to build, but - more important-the happiness and safety of her sensitive daughter, Anna.\r\n\r\nEngrossing and provocative, combining sharp plot twists with Juska&apos;s award-winning, trademark literary sophistication, If We Had Known is at once an unforgettable mother-daughter journey, an exquisite portrait of a community in turmoil, and a harrowing examination of ethical and moral responsibility in a dangerously interconnected digital world.\r\n\r\nxx","last_updated":"2018-04-23T12:00:40.000Z","parsed":{"xt":"urn:btih:5dea5a5ea82be782dd64c908e76c4154a7bddb7a","dn":"If We Had Known by Elise Juska EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5dea5a5ea82be782dd64c908e76c4154a7bddb7a","infoHashBuffer":{"type":"Buffer","data":[93,234,90,94,168,43,231,130,221,100,201,8,231,108,65,84,167,189,219,122]},"name":"If We Had Known by Elise Juska EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}