{"title":"Paul and Jesus by James D. Tabor (.epub)","magnet":"magnet:?xt=urn:btih:5ee703258625a07c16772d7975245139522d5673&dn=Paul+and+Jesus+by+James+D.+Tabor+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"4096780","seeders":"52","leechers":"5","description":"Paul and Jesus: How the Apostle Transformed Christianity by James D. Tabor\r\n\r\nRequirements: .ePUB reader\r\n\r\nOverview: This fascinating examination of the earliest years of Christianity reveals sharply competing ideas about the significance of Jesus and his teachings and shows how the man we call St. Paul shaped Christianity as we know it today.\r\n\r\nHistorians know almost nothing about the two decades following the crucifixion of Jesus, when his followers regrouped and began to spread his message. During this time the apostle Paul joined the movement and began to preach to the gentiles.\r\n\r\nUsing the oldest Christian documents that we have--the letters of Paul--as well as other early Christian sources, historian and scholar James Tabor reconstructs the origins of Christianity. Tabor reveals that the familiar figures of James, Peter, and Paul sometimes disagreed fiercely over everything from the meaning of Jesus&apos; message to the question of whether converts must first become Jews. Tabor shows how Paul separated himself from Peter and James to introduce his own version of Christianity, which would continue to develop independently of the message that Jesus, James, and Peter preached.\r\n\r\nPaul and Jesus gives us a new and deeper understanding of Paul as it illuminates the fascinating period of history when Christianity was born out of Judaism and became the religion we recognize today.\r\n\r\nGenre: Non-fiction &gt; Faith, Beliefs &amp; Philosophy","last_updated":"2018-10-11T12:15:19.733Z","parsed":{"xt":"urn:btih:5ee703258625a07c16772d7975245139522d5673","dn":"Paul and Jesus by James D. Tabor (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5ee703258625a07c16772d7975245139522d5673","infoHashBuffer":{"type":"Buffer","data":[94,231,3,37,134,37,160,124,22,119,45,121,117,36,81,57,82,45,86,115]},"name":"Paul and Jesus by James D. Tabor (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}