{"title":"My Patients Like Treats by Duncan MacVean EPUB","magnet":"magnet:?xt=urn:btih:5f498b35ee8467ebbe8cd2abf5492cda4cbc9bbf&dn=My+Patients+Like+Treats+by+Duncan+MacVean+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"746945","seeders":"0","leechers":"0","description":"xx\r\n\r\nMy Patients Like Treats: Tales from a House-Call Veterinarian by Duncan MacVean EPUB\r\n\r\nIt&#x2019;s all fun and games until somebody ends up in a cone.\r\n\r\nPhysicians used to make house calls. Today, a few veterinarians still do. Duncan MacVean, DVM, is one such vet. His patients range from cats and dogs to pigs and lizards - each of them a unique personality. Every animal and every home is different, but every owner is the same in their affection for their companions. Without warning, MacVean finds himself in odd situations: stepping into a basement full of free-flying bats or struck speechless by a pig who loves opera so much that she falls into a trance.\r\n\r\nThe hilarious and the heartbreaking come together in this collection of true tales, all gathered from his lifelong career. MacVean finds himself riding backwards atop a potbelly pig that bucks and kicks its way down the hall, knocking over a china cabinet in the process. One woman with terminal cancer earnestly wants to know where pets go when they pass away - will her beloved cat and dog join her in the afterlife? Navigating the finer elements of human and animal interaction isn&#x2019;t easy. Here, MacVean provides a glimpse into his experience with such relationships, always looking for the humor and light of every situation.\r\n\r\nWith never a dull moment, his dedication to the animals of this earth and compassion for their human caretakers drives MacVean onward, from house to house, from patient to patient. This heartwarming collection of stories brings readers along for the ride, getting to know the curious creatures he treats and their perhaps sometimes even more curious humans. My Patients Like Treats is the perfect book for animal lovers or those who simply appreciate a good story.\r\n\r\nxx","last_updated":"2018-07-16T12:01:03.859Z","parsed":{"xt":"urn:btih:5f498b35ee8467ebbe8cd2abf5492cda4cbc9bbf","dn":"My Patients Like Treats by Duncan MacVean EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5f498b35ee8467ebbe8cd2abf5492cda4cbc9bbf","infoHashBuffer":{"type":"Buffer","data":[95,73,139,53,238,132,103,235,190,140,210,171,245,73,44,218,76,188,155,191]},"name":"My Patients Like Treats by Duncan MacVean EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}