{"title":"Conan Exiles-3DM","magnet":"magnet:?xt=urn:btih:5f4bf5928cc1ed8107d762261309927d67926118&dn=Conan+Exiles-3DM&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"HSMMaelstrom","categoryP":"games","categoryS":"pc","size":"51390120570","seeders":"1","leechers":"1","description":"You are an exile, outcast and downtrodden, sentenced to walk in a barbaric wasteland where the weak are crushed and only the strong can live. Here you must fight to survive, build, and dominate the world alone on your own server, or with enemies and allies in online multiplayer.\r\n\r\nJourney through a vast, seamless world filled with the ruins of ancient civilizations and uncover its dark history and buried secrets as you seek to conquer and dominate the exiled lands yourself. Start with nothing but your bare hands and forge the legacy of your clan, from simple tools and weapons to gigantic fortresses and entire cities. Enslave the bandits of the exiled lands to do your bidding by breaking them on the grueling Wheel of Pain. Sacrifice the beating hearts of your enemies on the blood-soiled altars of your god to seize true power and glory. Summon the colossal avatar of your god and see them lay waste to your enemies and their homes.\r\n\r\nConan Exiles is not an empty sandbox. It is a world rich in history where you must discover the knowledge and secrets of ancient civilizations as you struggle to build your own.\r\nSURVIVE THE BARBARIC WASTELAND\r\n\r\nIn the world of Conan the Barbarian, survival is more than being well-fed and hydrated. Here you must weather scouring sandstorms, save your mind from being corrupted and going insane, and fight vicious monsters from the darkest holes of the earth.\r\nBUILD YOUR LEGACY IN A VAST, SEAMLESS WORLD\r\n\r\nJourney through a huge, seamless world filled with danger and opportunity, exploring everything from sand dunes to towering ruins. Harvest resources to craft tools and weapons, then build everything from a small settlement to entire cities.\r\nDISCOVER THE DARK HISTORY OF ANCIENT CIVILIZATIONS\r\n\r\nExplore shadow-haunted ruins of ancient civilizations and discover great treasures and knowledge. Learn about the people who inhabited this world before and what led to their demise through inscriptions, wandering NPCs, and the environment itself.\r\nCALL UPON THE POWER OF THE GODS\r\n\r\nCut out the hearts of your enemies and sacrifice it upon the altars of your god to earn their blessing. Summon and take direct control of huge, towering avatars and wreak havoc on your enemies as you crush their homes and drive them from their lands.\r\nDEFEND YOUR LAND WITH AN ARMY OF SLAVES\r\n\r\nEnslave the criminals of the exiled lands and force them to join your cause and defend your territory. Put them through the grueling Wheel of Pain to break their will, then turn them into archers, crafters, entertainers, and more. Find rare thralls for the greatest rewards!\r\n\r\n\r\n 1.  Extract.\r\n 2.  Wait for crack.\r\n 3.  Play game.\r\n 4.  Have fun ^^","last_updated":"2018-05-08T12:10:58.122Z","parsed":{"xt":"urn:btih:5f4bf5928cc1ed8107d762261309927d67926118","dn":"Conan Exiles-3DM","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5f4bf5928cc1ed8107d762261309927d67926118","infoHashBuffer":{"type":"Buffer","data":[95,75,245,146,140,193,237,129,7,215,98,38,19,9,146,125,103,146,97,24]},"name":"Conan Exiles-3DM","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}