{"title":"A Girl's Guide to Missiles by Karen Piper (.epub)","magnet":"magnet:?xt=urn:btih:5fbe3ab9279a6edc8677a76e72038c23640e41de&dn=A+Girl%27s+Guide+to+Missiles+by+Karen+Piper+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"14880172","seeders":"1","leechers":"1","description":"A Girl&apos;s Guide to Missiles: Growing Up in America&apos;s Secret Desert by Karen Piper\r\n \r\nRequirements: .ePUB, .AZW3 Reader\r\n\r\nOverview: The China Lake missile range is located in a huge stretch of the Mojave Desert, about the size of the state of Delaware. It was created during the Second World War, and has always been shrouded in secrecy. But people who make missiles and other weapons are regular working people, with domestic routines and everyday dilemmas, and four of them were Karen Piper&apos;s parents, her sister, and&#x2014;when she needed summer jobs&#x2014;herself. Her dad designed the Sidewinder, which was ultimately used catastrophically in Vietnam. When her mom got tired of being a stay-at-home mom, she went to work on the Tomahawk. Once, when a missile nose needed to be taken offsite for final testing, her mother loaded it into the trunk of the family car, and set off down a Los Angeles freeway. Traffic was heavy, and so she stopped off at the mall, leaving the missile in the parking lot. \r\n\r\nPiper sketches in the belief systems&#x2014;from Amway&apos;s get-rich schemes to propaganda in The Rocketeer to evangelism, along with fears of a Lemurian takeover and Charles Manson&#x2014;that governed their lives. Her memoir is also a search for the truth of the past and what really brought her parents to China Lake with two young daughters, a story that reaches back to her father&apos;s World War II flights with contraband across Europe. Finally, it recounts the crossroads moment in a young woman&apos;s life when she finally found a way out of a culture of secrets and fear, and out of the desert. \r\n\r\nGenre: Non-Fiction &gt; Biographies &amp; Memoirs","last_updated":"2018-09-22T12:05:34.363Z","parsed":{"xt":"urn:btih:5fbe3ab9279a6edc8677a76e72038c23640e41de","dn":"A Girl's Guide to Missiles by Karen Piper (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5fbe3ab9279a6edc8677a76e72038c23640e41de","infoHashBuffer":{"type":"Buffer","data":[95,190,58,185,39,154,110,220,134,119,167,110,114,3,140,35,100,14,65,222]},"name":"A Girl's Guide to Missiles by Karen Piper (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}