{"title":"You All Grow Up and Leave Me by Piper Weiss EPUB","magnet":"magnet:?xt=urn:btih:605cf1062dbd7043db4aaaeef00959670ed1822f&dn=You+All+Grow+Up+and+Leave+Me+by+Piper+Weiss+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4788232","seeders":"0","leechers":"0","description":"xx\r\n\r\nYou All Grow Up and Leave Me by Piper Weiss EPUB\r\n\r\nA highly unsettling blend of true crime and coming-of-age memoir - The Stranger Beside Me meets Prep - that presents an intimate and thought-provoking portrait of girlhood within Manhattan&#x2019;s exclusive prep-school scene in the early 1990s, and a thoughtful meditation on adolescent obsession and the vulnerability of youth.\r\n\r\nPiper Weiss was 14 years old when her middle-aged tennis coach, Gary Wilensky, one of New York City&#x2019;s most prestigious private instructors, killed himself after a failed attempt to kidnap one of his teenage students. In the aftermath, authorities discovered that this well-known figure among the Upper East Side tennis crowd was actually a frightening child predator who had built a secret torture chamber - a &quot;Cabin of Horrors&quot; - in his secluded rental in the Adirondacks.\r\n\r\nBefore the shocking scandal broke, Piper had been thrilled to be one of &quot;Gary&#x2019;s Girls.&quot; &quot;Grandpa Gary&quot;, as he was known among his students, was different from other adults - he treated Piper like a grown-up, taking her to dinners, engaging in long intimate conversations with her, and sending her special valentines. As reporters swarmed her private community in the wake of Wilensky&#x2019;s death, Piper learned that her mentor was a predator with a sordid history of child stalking and sexual fetish. But why did she still feel protective of Gary, and why was she disappointed that he hadn&#x2019;t chosen her?\r\n\r\nNow, 20 years later, Piper examines the event as both a teenage eyewitness and a dispassionate investigative reporter, hoping to understand and exorcise the childhood memories that haunt her to this day. Combining research, interviews, and personal records, You All Grow Up and Leave Me explores the psychological manipulation by child predators - their ability to charm their way into seemingly protected worlds - and the far-reaching effects their actions have on those who trust them most.\r\n\r\nxx","last_updated":"2018-04-23T12:00:42.292Z","parsed":{"xt":"urn:btih:605cf1062dbd7043db4aaaeef00959670ed1822f","dn":"You All Grow Up and Leave Me by Piper Weiss EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"605cf1062dbd7043db4aaaeef00959670ed1822f","infoHashBuffer":{"type":"Buffer","data":[96,92,241,6,45,189,112,67,219,74,170,238,240,9,89,103,14,209,130,47]},"name":"You All Grow Up and Leave Me by Piper Weiss EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}