{"title":"America Aflame by David Goldfield EPUB","magnet":"magnet:?xt=urn:btih:62341cec1dfb196b5e8f02636235de9a83721628&dn=America+Aflame+by+David+Goldfield+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3746007","seeders":"1","leechers":"1","description":"xx\r\n\r\nAmerica Aflame by David Goldfield EPUB\r\n\r\nIn this spellbinding new history, David Goldfield offers the first major new interpretation of the Civil War era since James M. McPherson&apos;s Battle Cry of Freedom. Where past scholars have interpreted the war as a triumph of freedom, Goldfield sees it as America&apos;s greatest failure: the result of a breakdown caused by the infusion of evangelical religion into the public sphere. As the Second Great Awakening surged through America, political questions became matters of good and evil to be fought to the death. The price of that failure was horrific, but the carnage accomplished what statesmen could not: it made the United States one nation and eliminated slavery as a divisive force in the Union. The victorious North became synonymous with America as a land of innovation and industrialization, whose teeming cities offered squalor and opportunity in equal measure. Religion was supplanted by science and a gospel of progress, and the South was left behind. Goldfield&apos;s panoramic narrative, sweeping from the 1840s to the end of Reconstruction, is studded with memorable details and luminaries such as Harriet Beecher Stowe, Frederick Douglass, and Walt Whitman. There are lesser known yet equally compelling characters, too, including Carl Schurz---a German immigrant, war hero, and post-war reformer---and Alexander Stephens, the urbane and intellectual vice president of the Confederacy. America Aflame is a vivid portrait of the &quot;fiery trial&quot; that transformed the country we live in.\r\n\r\nxx","last_updated":"2018-06-16T12:04:03.171Z","parsed":{"xt":"urn:btih:62341cec1dfb196b5e8f02636235de9a83721628","dn":"America Aflame by David Goldfield EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"62341cec1dfb196b5e8f02636235de9a83721628","infoHashBuffer":{"type":"Buffer","data":[98,52,28,236,29,251,25,107,94,143,2,99,98,53,222,154,131,114,22,40]},"name":"America Aflame by David Goldfield EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}