{"title":"Redeployment by Phil Klay EPUB","magnet":"magnet:?xt=urn:btih:635079f459abd87cbbb762e6c9e28cb6d7143d4d&dn=Redeployment+by+Phil+Klay+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"861169","seeders":"22","leechers":"4","description":"xx\r\n\r\nRedeployment by Phil Klay EPUB\r\n\r\nPhil Klay&apos;s Redeployment takes readers to the frontlines of the wars in Iraq and Afghanistan, asking us to understand what happened there, and what happened to the soldiers who returned. Interwoven with themes of brutality and faith, guilt and fear, helplessness and survival, the characters in these stories struggle to make meaning out of chaos.\r\n\r\nIn Redeployment, a soldier who has had to shoot dogs because they were eating human corpses must learn what it is like to return to domestic life in suburbia, surrounded by people &quot;who have no idea where Fallujah is, where three members of your platoon died.&quot; In &quot;After Action Report&quot;, a Lance Corporal seeks expiation for a killing he didn&apos;t commit, in order that his best friend will be unburdened.\r\n\r\nA Morturary Affairs Marine tells about his experiences collecting remains - of U.S. and Iraqi soldiers both. A chaplain sees his understanding of Christianity, and his ability to provide solace through religion, tested by the actions of a ferocious Colonel. And in the darkly comic &quot;Money as a Weapons System&quot;, a young Foreign Service Officer is given the absurd task of helping Iraqis improve their lives by teaching them to play baseball. These stories reveal the intricate combination of monotony, bureaucracy, comradeship and violence that make up a soldier&apos;s daily life at war, and the isolation, remorse, and despair that can accompany a soldier&apos;s homecoming.\r\n\r\nRedeployment is poised to become a classic in the tradition of war writing. Across nations and continents, Klay sets in devastating relief the two worlds a soldier inhabits: one of extremes and one of loss. Written with a hard-eyed realism and stunning emotional depth, this work marks Phil Klay as one of the most talented new voices of his generation.\r\n\r\nxx","last_updated":"2018-09-24T12:53:12.101Z","parsed":{"xt":"urn:btih:635079f459abd87cbbb762e6c9e28cb6d7143d4d","dn":"Redeployment by Phil Klay EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"635079f459abd87cbbb762e6c9e28cb6d7143d4d","infoHashBuffer":{"type":"Buffer","data":[99,80,121,244,89,171,216,124,187,183,98,230,201,226,140,182,215,20,61,77]},"name":"Redeployment by Phil Klay EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}