{"title":"Interior States: Essays by Meghan O'Gieblyn (.epub)+","magnet":"magnet:?xt=urn:btih:637c14f680014657800a255b8afdf225bd8f0877&dn=Interior+States%3A+Essays+by+Meghan+O%27Gieblyn+%28.epub%29%2B&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"2840544","seeders":"18","leechers":"4","description":"Interior States: Essays by Meghan O&apos;Gieblyn\r\n\r\nRequirements: .ePUB .MOBI .AZW3 Reader\r\n\r\nOverview: A fresh, acute, and even profound collection that centers around two core (and related) issues of American identity: faith, in general and the specific forms Christianity takes in particular; and the challenges of living in the Midwest when culture is felt to be elsewhere.\r\n\r\nWhat does it mean to be a believing Christian and a Midwesterner in an increasingly secular America where the cultural capital is retreating to both coasts? The critic and essayist Meghan O&apos;Gieblyn was born into an evangelical family, attended the famed Moody Bible Institute in Chicago for a time before she had a crisis of belief, and still lives in the Midwest, aka &quot;Flyover Country.&quot; She writes of her &quot;existential dizziness, a sense that the rest of the world is moving while you remain still,&quot; and that rich sense of ambivalence and internal division inform the fifteen superbly thoughtful and ironic essays in this collection. The subjects of these essays range from the rebranding (as it were) of Hell in contemporary Christian culture (&quot;Hell&quot;), a theme park devoted to the concept of intelligent design (&quot;Species of Origin&quot;), the paradoxes of Christian Rock (&quot;Sniffing Glue&quot;), Henry Ford&apos;s reconstructed pioneer town of Greenfield Village and its mixed messages (&quot;Midwest World&quot;), and the strange convergences of Christian eschatology and the digital so-called Singularity (&quot;Ghosts in the Cloud&quot;). Meghan O&apos;Gieblyn stands in relation to her native Midwest as Joan Didion stands in relation to California - which is to say a whole-hearted lover, albeit one riven with ambivalence at the same time.\r\n\r\nGenre: Non-Fiction &gt; Essays","last_updated":"2018-11-25T12:15:39.236Z","parsed":{"xt":"urn:btih:637c14f680014657800a255b8afdf225bd8f0877","dn":"Interior States: Essays by Meghan O'Gieblyn (.epub) ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"637c14f680014657800a255b8afdf225bd8f0877","infoHashBuffer":{"type":"Buffer","data":[99,124,20,246,128,1,70,87,128,10,37,91,138,253,242,37,189,143,8,119]},"name":"Interior States: Essays by Meghan O'Gieblyn (.epub) ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}