{"title":"Glory over Everything by Kathleen Grissom EPUB","magnet":"magnet:?xt=urn:btih:6394d2681185a2be6656b8bde436938b8ebea075&dn=Glory+over+Everything+by+Kathleen+Grissom+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7325755","seeders":"23","leechers":"0","description":"xx\r\n\r\nGlory over Everything by Kathleen Grissom EPUB\r\n\r\nThe author of the New York Times best seller and beloved book club favorite The Kitchen House continues the story of Jamie Pyke, son of both a slave and master of Tall Oakes, whose deadly secret compels him to take a treacherous journey through the Underground Railroad.\r\n\r\nPublished in 2010, The Kitchen House became a grassroots best seller. Fans connected so deeply to the book&apos;s characters that the author, Kathleen Grissom, found herself being asked over and over, &quot;What happens next?&quot; The wait is finally over.\r\n\r\nThis new standalone novel opens in 1830, and Jamie, who fled from the Virginian plantation he once called home, is passing in Philadelphia society as a wealthy white silversmith. After many years of striving, Jamie has achieved acclaim and security, only to discover that his aristocratic lover, Caroline, is pregnant. Before he can reveal his real identity to her, he learns that his beloved servant, Pan, has been captured and sold into slavery in the South. Pan&apos;s father, to whom Jamie owes a great debt, pleads for Jamie&apos;s help, and Jamie agrees, knowing the journey will take him perilously close to Tall Oakes and the ruthless slave hunter who is still searching for him. Meanwhile Caroline&apos;s father learns and exposes Jamie&apos;s secret, and Jamie loses his home, his business, and finally Caroline.\r\n\r\nHeartbroken and with nothing to lose, Jamie embarks on a trip to a North Carolina plantation where Pan is being held with a former Tall Oakes slave named Sukey, who is intent on getting Pan to the Underground Railroad. Soon the three of them are running through the Great Dismal Swamp, the notoriously deadly hiding place for escaped slaves. Though they have help from those in the Underground Railroad, not all of them will make it out alive.\r\n\r\nxx","last_updated":"2018-01-31T12:06:38.578Z","parsed":{"xt":"urn:btih:6394d2681185a2be6656b8bde436938b8ebea075","dn":"Glory over Everything by Kathleen Grissom EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6394d2681185a2be6656b8bde436938b8ebea075","infoHashBuffer":{"type":"Buffer","data":[99,148,210,104,17,133,162,190,102,86,184,189,228,54,147,139,142,190,160,117]},"name":"Glory over Everything by Kathleen Grissom EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}