{"title":"Stinger by Robert R. McCammon EPUB","magnet":"magnet:?xt=urn:btih:63f13170b05aed22e5dad8cff7a088eff4ae14bf&dn=Stinger+by+Robert+R.+McCammon+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"536835","seeders":"0","leechers":"0","description":"xx\r\n\r\nStinger by Robert R. McCammon EPUB\r\n\r\nA relentless alien bounty hunter encloses a Texas town under a dome to isolate, hunt, and kill its prey in &quot;the ultimate horror novel&quot; (The Philadelphia Inquirer).\r\n\r\nEver since the copper mine closed, the West Texas desert hellholes of Inferno and Bordertown have been slowly dying. Snake River isn&apos;t the only thing that divides them. Racism, gang wars, and anti-Mexican sentiment have turned the sun-scorched flatlands into a powder keg. If anything can unite them for now, at least in awe and wonder, it&apos;s the UFO that comes soaring out of the clouds like a flaming locomotive.\r\n\r\nIn the wake of the crash, a young alien named Daufin has arrived, too. A fugitive who has taken the form of a human, she knows the terror that awaits the inhabitants of this planet - because it is looking for her.\r\n\r\nWhen Stinger, the monstrous alien bounty hunter, arrives, it&apos;s with a destructive fury and a devious plan to find Daufin - by entombing the residents in an impenetrable and inescapable dome. A relentless killing machine, Stinger has an infinite capacity for death and destruction. And over the next twenty-four hours, this town is going to bleed and burn. Now, the few remaining survivors must come together to protect Daufin, themselves, and the world beyond from total annihilation.\r\n\r\nFrom the New York Times best-selling and Bram Stoker Award-winning author of Swan Song, Stingerwas called &quot;one of the best suspense novels of recent years&quot; by the Science Fiction Chronicle.\r\n\r\nxx","last_updated":"2018-06-01T12:00:49.295Z","parsed":{"xt":"urn:btih:63f13170b05aed22e5dad8cff7a088eff4ae14bf","dn":"Stinger by Robert R. McCammon EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"63f13170b05aed22e5dad8cff7a088eff4ae14bf","infoHashBuffer":{"type":"Buffer","data":[99,241,49,112,176,90,237,34,229,218,216,207,247,160,136,239,244,174,20,191]},"name":"Stinger by Robert R. McCammon EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}