{"title":"The Lightless Sky by Gulwali Passarlay EPUB","magnet":"magnet:?xt=urn:btih:63f9d85a4c5cb439afd782a08c3c2fcaf51efead&dn=The+Lightless+Sky+by+Gulwali+Passarlay+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1358325","seeders":"14","leechers":"10","description":"xx\r\n\r\nThe Lightless Sky by Gulwali Passarlay EPUB\r\n\r\nA gripping, inspiring, and eye-opening memoir of fortitude and survival - of a 12-year-old boy&apos;s traumatic flight from Afghanistan to the West - that puts a face to one of the most shocking and devastating humanitarian crises of our time.\r\n\r\n&quot;To risk my life had to mean something. Otherwise what was it all for?&quot;\r\n\r\nIn 2006, after his father was killed, Gulwali Passarlay was caught between the Taliban, who wanted to recruit him, and the Americans, who wanted to use him. To protect her son, Gulwali&apos;s mother sent him away. The search for safety would lead the 12-year-old across eight countries, from the mountains of Eastern Afghanistan through Iran and Europe to Britain. Over the course of 12 harrowing months, Gulwali endured imprisonment, hunger, cruelty, brutality, loneliness, and terror - and nearly drowned crossing the Mediterranean Sea. Eventually granted asylum in England, Gulwali was sent to a good school, learned English, won a place at a top university, and was chosen to help carry the Olympic torch in the 2012 London Games.\r\n\r\nIn The Lightless Sky, Gulwali recalls his remarkable experience and offers a firsthand look at one of the most pressing issues of our time: the modern refugee crisis - the worst displacement of millions of men, women, and children in generations. Few, like Gulwali, make it to a country that offers the chance of freedom and opportunity. A celebration of courage and determination, The Lightless Sky is a poignant account of an exceptional human being who is today an ardent advocate of democracy - and a reminder of our responsibilities to those caught in terrifying and often deadly circumstances beyond their control.\r\n\r\nxx","last_updated":"2018-01-18T18:59:38.635Z","parsed":{"xt":"urn:btih:63f9d85a4c5cb439afd782a08c3c2fcaf51efead","dn":"The Lightless Sky by Gulwali Passarlay EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"63f9d85a4c5cb439afd782a08c3c2fcaf51efead","infoHashBuffer":{"type":"Buffer","data":[99,249,216,90,76,92,180,57,175,215,130,160,140,60,47,202,245,30,254,173]},"name":"The Lightless Sky by Gulwali Passarlay EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}