{"title":"Aquarium by David Vann EPUB","magnet":"magnet:?xt=urn:btih:640f70ee752144050a95f6e05bd8c46d3dbc3a25&dn=Aquarium+by+David+Vann+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"890191","seeders":"0","leechers":"0","description":"xx\r\n\r\nAquarium by David Vann EPUB\r\n\r\nDavid Vann&apos;s dazzling debut Legend of a Suicide was reviewed in over a 150 major global publications, won 11 prizes worldwide, was on 40 &quot;best books of the year&quot; lists, and established its author as a literary master. Since then, Vann has delivered an exceptional body of work, receiving, among others, best foreign novel in France and Spain, a California Book Award, and the mid-career St. Francis College Literary Prize. Aquarium, his implosive new book, will take Vann to a wider audience than ever before.\r\n\r\nTwelve-year-old Caitlin lives alone with her mother - a docker at the local container port - in subsidized housing next to an airport in Seattle. Each day, while she waits to be picked up after school, Caitlin visits the local aquarium to study the fish. Gazing at the creatures within the watery depths, Caitlin accesses a shimmering universe beyond her own. When she befriends an old man at the tanks one day, who seems as enamored of the fish as she, Caitlin cracks open a dark family secret and propels her once-blissful relationship with her mother toward a precipice of terrifying consequence.\r\n\r\nIn crystalline, chiseled, yet graceful prose, Aquarium takes us into the heart of a brave young girl whose longing for love and capacity for forgiveness transforms the damaged people around her. Relentless and heartbreaking, primal and redemptive, Aquarium is a transporting story from one of the best American writers of our time.\r\n\r\nxx","last_updated":"2018-04-16T12:15:04.332Z","parsed":{"xt":"urn:btih:640f70ee752144050a95f6e05bd8c46d3dbc3a25","dn":"Aquarium by David Vann EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"640f70ee752144050a95f6e05bd8c46d3dbc3a25","infoHashBuffer":{"type":"Buffer","data":[100,15,112,238,117,33,68,5,10,149,246,224,91,216,196,109,61,188,58,37]},"name":"Aquarium by David Vann EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}