{"title":"The Mathematics of India: Concepts, Methods, Connections 2018 eP","magnet":"magnet:?xt=urn:btih:642c510b792788daf585758368e415a51a344633&dn=The+Mathematics+of+India%3A+Concepts%2C+Methods%2C+Connections+2018+eP&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Horisarte","categoryP":"other","categoryS":"e_books","size":"4524230","seeders":"0","leechers":"0","description":"The Mathematics of India: Concepts, Methods, Connections (Sources and Studies in the History of Mathematics and Physical Sciences) 2018, P. P. Divakaran, PDF\r\n\r\nThis book identifies three of the exceptionally fruitful periods of the millennia-long history of the mathematical tradition of India: the very beginning of that tradition in the construction of the now-universal system of decimal numeration and of a framework for planar geometry; a classical period inaugurated by Aryabhata&#x2019;s invention of trigonometry and his enunciation of the principles of discrete calculus as applied to trigonometric functions; and a final phase that produced, in the work of Madhava, a rigorous infinitesimal calculus of such functions.\r\n\r\nThe main highlight of this book is a detailed examination of these critical phases and their interconnectedness, primarily in mathematical terms but also in relation to their intellectual, cultural and historical contexts.\r\n\r\nRecent decades have seen a renewal of interest in this history, as manifested in the publication of an increasing number of critical editions and translations of texts, as well as in an informed analytic interpretation of their content by the scholarly community. The result has been the emergence of a more accurate and balanced view of the subject, and the book has attempted to take an account of these nascent insights. As part of an endeavour to promote the new awareness, a special attention has been given to the presentation of proofs of all significant propositions in modern terminology and notation, either directly transcribed from the original texts or by collecting together material from several texts.\r\n <a href=\"\nhttps://www.springer.com/us/book/9789811317736\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.springer.com/us/book/9789811317736</a>","last_updated":"2018-09-21T12:01:49.143Z","parsed":{"xt":"urn:btih:642c510b792788daf585758368e415a51a344633","dn":"The Mathematics of India: Concepts, Methods, Connections 2018 eP","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"642c510b792788daf585758368e415a51a344633","infoHashBuffer":{"type":"Buffer","data":[100,44,81,11,121,39,136,218,245,133,117,131,104,228,21,165,26,52,70,51]},"name":"The Mathematics of India: Concepts, Methods, Connections 2018 eP","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}