{"title":"Gulag Boss.A Soviet Memoir","magnet":"magnet:?xt=urn:btih:64ff255c4023a81224b315923fa6b158c4603ba6&dn=Gulag+Boss.A+Soviet+Memoir&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"1628584","seeders":"32","leechers":"5","description":"The searing accounts of Aleksandr Solzhenitsyn, Evgeniia Ginsberg and Varlam Shalamov opened the world&apos;s eyes to the terrors of the Soviet Gulag. But not until now has there been a memoir of life inside the camps written from the perspective of an actual employee of the Secret police.\r\n\r\nIn this riveting memoir, superbly translated by Deborah Kaple, Fyodor Mochulsky describes being sent to work as a boss at the forced labor camp of Pechorlag in the frozen tundra north of the Arctic Circle. Only twenty-two years old, he had but a vague idea of the true nature of the Gulag. What he discovered was a world of unimaginable suffering and death, a world where men were starved, beaten, worked to death, or simply executed. Mochulsky details the horrific conditions in the camps and the challenges facing all those involved, from prisoners to guards. He depicts the power struggles within the camps between the secret police and the communist party, between the political prisoners (most of whom had been arrested for the generic crime of &quot;counter-revolutionary activities&quot;) and the criminal convicts. And because Mochulsky writes of what he witnessed with the detachment of the engineer that he was, readers can easily understand how a system that destroyed millions of lives could be run by ordinary Soviet citizens who believed they were advancing the cause of socialism.\r\n\r\nMochulsky remained a communist party member his entire life--he would later become a diplomat--but was deeply troubled by the gap between socialist theory and the Soviet reality of slave labor and mass murder. This unprecedented memoir takes readers into that reality and sheds new light on one of the most harrowing tragedies of the 20th century","last_updated":"2018-03-15T12:16:51.109Z","parsed":{"xt":"urn:btih:64ff255c4023a81224b315923fa6b158c4603ba6","dn":"Gulag Boss.A Soviet Memoir","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"64ff255c4023a81224b315923fa6b158c4603ba6","infoHashBuffer":{"type":"Buffer","data":[100,255,37,92,64,35,168,18,36,179,21,146,63,166,177,88,196,96,59,166]},"name":"Gulag Boss.A Soviet Memoir","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}