{"title":"Neurotheology by Andrew Newberg (.epub)","magnet":"magnet:?xt=urn:btih:650e626b056f530e0ab4ba263d8a97546005877a&dn=Neurotheology+by+Andrew+Newberg+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"2873423","seeders":"41","leechers":"10","description":"Neurotheology: How Science Can Enlighten Us About Spirituality by Andrew Newberg\r\n\r\nRequirements: .ePUB reader, 2.7MB\r\n\r\nGenre: Non-Fiction &gt; General\r\n\r\nOverview: \r\n\r\nReligion is often cast in opposition to science. Yet both are deeply rooted in the inner workings of the human brain. With the advent of the modern cognitive neurosciences, the scientific study of religious and spiritual phenomena has become far more sophisticated and wide-ranging. What might brain scans of people in prayer, in meditation, or under the influence of psychoactive substances, for instance, show us about religious and spiritual beliefs? Are religious and spiritual phenomena reducible to brain processes? Or might there be aspects of religion and spirituality that, at least for now, appear to transcend scientific claims? \r\n\r\nIn this book, Andrew Newberg explores the latest findings of neurotheology, the multidisciplinary field linking neuroscience with religious and spiritual phenomena. He investigates some of the most controversial&#x2014;and potentially transformative&#x2014;implications of a neurotheological approach for the truth claims of religion and our understanding of minds and brains. Newberg leads readers on a tour through key intersections of neuroscience and theology, including the potential evolutionary basis of religion; the psychology of religion, including mental-health and brain pathology; the neuroscience of myths, rituals, and mystical experiences; how studies of altered states of consciousness shed new light on the mind-brain relationship; what neurotheology can tell us about free will; and the limitations of what science can say about our religious and spiritual experience of reality. When brain science and religious experience are considered together in an integrated approach, Newberg shows, we might come closer to a fuller understanding of the deepest questions","last_updated":"2018-08-25T12:14:22.843Z","parsed":{"xt":"urn:btih:650e626b056f530e0ab4ba263d8a97546005877a","dn":"Neurotheology by Andrew Newberg (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"650e626b056f530e0ab4ba263d8a97546005877a","infoHashBuffer":{"type":"Buffer","data":[101,14,98,107,5,111,83,14,10,180,186,38,61,138,151,84,96,5,135,122]},"name":"Neurotheology by Andrew Newberg (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}