{"title":"Hart Crane -Complete Poems, Selected Letters and Prose (8 books)","magnet":"magnet:?xt=urn:btih:655bd1a750ba279a9111e2a072bb6ae2be3751b2&dn=Hart+Crane+-Complete+Poems%2C+Selected+Letters+and+Prose+%288+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"68591158","seeders":"4","leechers":"10","description":"\nHART CRANE (1899-1932) was an American poet who celebrated the richness of life &#x2014; including the life of the industrial age &#x2014; in lyrics of visionary intensity.  He is considered a pivotal, even prophetic, figure in American literature, a Romantic in the decades of high Modernism, whose version of American Romanticism extended back through Walt Whitman to Ralph Waldo Emerson.\n\nIn his haunted, brief life, Crane fashioned a distinctively modern idiom that fused the ornate rhetoric of the Elizabethans, the ecstatic enigmas of Rimbaud, and the prophetic utterances and cosmic sympathy of Whitman, in a quest for wholeness and healing in what he called &quot;the broken world.&quot;  His first published book, WHITE BUILDINGS (1926), contains many of Crane&apos;s best lyrics, including &quot;Voyages&quot;, a powerful sequence of erotic poems, and &quot;For the Marriage of Faustus and Helen&quot;, written as a response to what Crane considered the cultural despair in T. S. Eliot&apos;s &quot;The Waste Land&quot;.  The latter work, he said, was characterized by a refusal to see &quot;certain spiritual events and possibilities&quot;, and his self-appointed work would be to bring those spiritual events and possibilities to poetic life, and so create &quot;a mystical synthesis of America.&quot;\n\nIn his most ambitious work, THE BRIDGE (1930), Crane sought to create an epic myth of the American experience that expressed a more optimistic view of modern, urban culture than the one he found in Eliot&apos;s work.  The Brooklyn Bridge is both the poem&apos;s central symbol and its poetic starting point.  As a coherent epic it was deemed a failure, but many of its individual lyrics are judged to be among the best American poems of the 20th century.\n\nHis COLLECTED POEMS appeared in 1933 but was superseded by THE COMPLETE POEMS AND SELECTED LETTERS AND PROSE (1966), which incorporated some of his previously uncollected writings.  His correspondence offers an intriguing glimpse into his complicated personality, as well as his tempestuous relationships with family, lovers, and writers such as Allen Tate, Waldo Frank, Yvor Winters, Jean Toomer, Marianne Moore, E. E. Cummings, William Carlos Williams, and Katherine Anne Porter.\n\n\nThe following books are in ePUB and/or PDF format as indicated:\n\n\n                                 == POETRY ==\n\n* Bridge, The: An Annotated Edition (Fordham, 2011).  Lawrence Kramer, ed. -- PDF\n\n* Collected Poems (Liveright, 1946).  Waldo Frank, ed. -- PDF\n\n* Complete Poems &amp; Selected Letters and Prose (Anchor, 1966). Brom Weber, ed. -- PDF (by @Mohamed5438)\n\n* Selected Poems (Faber, 2010).  Maurice Riordan, ed. -- ePUB\n\n\n                                 == LETTERS ==\n\n* Hart Crane and Yvor Winters: Their Literary Correspondence [Thomas Parkinson] (California, 1978) -- PDF\n\n* Letters of Hart Crane, 1916-1932 (California, 1965).  Brom Weber, ed. -- PDF (by @Mohamed5438)\n\n* O My Land, My Friends: Selected Letters (Four Walls, 1997).  Langdon Hammer &amp; Brom Weber, eds. -- ePUB + PDF (by @Mohamed5438)\n\n* Robber Rocks: Letters &amp; Memories of Hart Crane, 1923-1932 [Susan Brown] (Wesleyan, 1969) -- PDF\n\n____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-10-12T12:15:55.155Z","parsed":{"xt":"urn:btih:655bd1a750ba279a9111e2a072bb6ae2be3751b2","dn":"Hart Crane -Complete Poems, Selected Letters and Prose (8 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"655bd1a750ba279a9111e2a072bb6ae2be3751b2","infoHashBuffer":{"type":"Buffer","data":[101,91,209,167,80,186,39,154,145,17,226,160,114,187,106,226,190,55,81,178]},"name":"Hart Crane -Complete Poems, Selected Letters and Prose (8 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}