{"title":"Swansong 1945 by Walter Kempowski EPUB","magnet":"magnet:?xt=urn:btih:65be5f2b56a2186504f7481ffe9ea8527f748a1d&dn=Swansong+1945+by+Walter+Kempowski+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1333699","seeders":"59","leechers":"9","description":"xx\r\n\r\nSwansong 1945: A Collective Diary of the Last Days of the Third Reich by Walter Kempowski EPUB\r\n\r\nA monumental work of history that captures the last days of the Third Reich as never before. Swansong 1945 chronicles the end of Nazi Germany and World War II in Europe through hundreds of letters, diaries, and autobiographical accounts covering four days that fateful spring: Hitler&apos;s birthday on April 20, American and Soviet troops meeting at the Elbe on April 25, Hitler&apos;s suicide on April 30, and finally the German surrender on May 8. Side by side, we encounter vivid, first-person accounts of civilians fleeing Berlin, ordinary German soldiers determined to fight to the bitter end, American POWs dreaming of home, concentration camp survivors&apos; first descriptions of their horrific experiences, as well as the intimate thoughts of figures such as Eisenhower, Churchill, Stalin, Joseph Goebbels, and Hitler himself. These firsthand accounts, painstakingly collected and organized by renowned German author Walter Kempowski, provide the raw material of history and present a panoramic view of those tumultuous days. The more than 1,000 extracts include a British soldier writing to his parents to tell them there are no baths, but plenty of eggs and chocolate; an American soldier describing &quot;the tremendous burst of lilacs&quot; as he approaches the Elbe; Mussolini wishing Hitler a happy birthday; Eva Braun bragging to a girlfriend about what a &quot;crack shot&quot; she&apos;s become; and much more. An extraordinary account of suffering and survival, Swansong 1945 brings to life the end of Nazi Germany and the war in Europe.\r\n\r\nxx","last_updated":"2018-07-01T12:12:41.298Z","parsed":{"xt":"urn:btih:65be5f2b56a2186504f7481ffe9ea8527f748a1d","dn":"Swansong 1945 by Walter Kempowski EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"65be5f2b56a2186504f7481ffe9ea8527f748a1d","infoHashBuffer":{"type":"Buffer","data":[101,190,95,43,86,162,24,101,4,247,72,31,254,158,168,82,127,116,138,29]},"name":"Swansong 1945 by Walter Kempowski EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}