{"title":"This Is Not a Love Story by Judy Brown EPUB","magnet":"magnet:?xt=urn:btih:67686f37882bbe10950110898cba54d5f3d2a25a&dn=This+Is+Not+a+Love+Story+by+Judy+Brown+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"519430","seeders":"1","leechers":"0","description":"xx\r\n\r\nThis Is Not a Love Story by Judy Brown EPUB\r\n\r\nA razor-sharp, hilarious, and poignant memoir about growing up in the closed world of the ultraorthodox Jewish community.\r\n\r\nThe third of six children in a family that harks back to a gloried Hassidic dynasty, Judy Brown grew up with the legacy of centuries of religious teaching and the faith and lore that sustained her people for generations.\r\n\r\nBut her carefully constructed world begins to crumble when her &quot;crazy&quot; brother, Nachum, returns home after a year in Israel living with relatives. Though supposedly &quot;cured&quot;, he is still prone to retreating into his own mind or erupting in wordless rages. The adults&apos; inability to make him better - or even to give his affliction a name - forces Judy to ask larger questions: If God could perform miracles for her sainted ancestors, why can&apos;t he cure Nachum? And what of the other stories her family treasured?\r\n\r\nJudy starts to negotiate with God, swinging from holy tenets to absurdly hilarious conclusions faster than a Talmudic scholar: She goes on a fast to nab coveted earrings; she fights with her siblings at the dinner table for the ultimate badge of honor (&quot;Who will survive the next Holocaust?&quot;); and she adamantly defends her family&apos;s reputation when, scandalously, her parents are accused of having fallen in love - which is absolutely not what pious people do.\r\n\r\nFor all its brutal honesty about this insular community, This Is Not a Love Story is ultimately a story of a family like so many others, whose fierce love for each other and devotion to their faith pulled them through the darkest time in their lives.\r\n\r\nxx","last_updated":"2018-05-07T12:05:51.265Z","parsed":{"xt":"urn:btih:67686f37882bbe10950110898cba54d5f3d2a25a","dn":"This Is Not a Love Story by Judy Brown EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"67686f37882bbe10950110898cba54d5f3d2a25a","infoHashBuffer":{"type":"Buffer","data":[103,104,111,55,136,43,190,16,149,1,16,137,140,186,84,213,243,210,162,90]},"name":"This Is Not a Love Story by Judy Brown EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}