{"title":"Vital Signs by Gregg Levoy EPUB","magnet":"magnet:?xt=urn:btih:67bd3fade81dbef9293523aa597bd6f3cacb384d&dn=Vital+Signs+by+Gregg+Levoy+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1998228","seeders":"0","leechers":"0","description":"xx\r\n\r\nVital Signs by Gregg Levoy EPUB\r\n\r\nDiscover - or rediscover - your passion for life.\r\n\r\nWhat inspires passion in your life? And what defeats it? How do you lose it and how do you get it back? In this exuberant and compelling book, Gregg Levoy, best-selling author of Callings, explores how you can cultivate not just a specific passion, but passion as a mindset - a stance - that helps bring vitality to all your engagements, from work and relationships to creativity and spiritual life.\r\n\r\nVital Signs examines the endless, yet endlessly fruitful, tug-of-war between passion and security in our lives, the wild in us and the tame, our natural selves and our conditioned selves, and shows us how to stay engaged with the world and resist the downward-pulling forces that can drain our aliveness. Vital Signs also encourages courageous inquiry into our dis-passion - where we&apos;re numb, depressed, stuck and bored in our lives - so that we can rework these tendencies in ourselves and claim our rightful inheritance of vitality. What you&apos;ll learn:\r\n\r\nPassion can be cultivated. Turned on as well as turned off. And this happens most readily at the level of the gesture and the moment, not the five-year plan.\r\n\r\nPassion is in the risk. In the willingness to step from the sidelines onto the playing field.\r\n\r\nPassion breeds passion and disinterest breeds disinterest. If you lack passion in your life, your other relationships - your partnerships, friendships, communities, classrooms, corporations and congregations - will be denied that energy.\r\n\r\nPassion is more than exuberance; it&apos;s endurance. It&apos;s sometimes shoulder-to-the-wheel stamina and patience on the order of years.\r\n\r\nPassion is intimately related to health. To the degree that passion is vitality, honoring your passions enhances your vitality.\r\n\r\nDrawing from centuries of history, art, science, psychology and philosophy, as well as in-depth interviews with people who rediscovered and reignited passion in their own lives, Vital Signs offers an expansive menu of possibilities for how to claim and reclaim your passion, and will help you maintain a keen awareness of where the pulse is and a determination to plug into that place.\r\n\r\nxx","last_updated":"2018-03-24T12:02:12.581Z","parsed":{"xt":"urn:btih:67bd3fade81dbef9293523aa597bd6f3cacb384d","dn":"Vital Signs by Gregg Levoy EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"67bd3fade81dbef9293523aa597bd6f3cacb384d","infoHashBuffer":{"type":"Buffer","data":[103,189,63,173,232,29,190,249,41,53,35,170,89,123,214,243,202,203,56,77]},"name":"Vital Signs by Gregg Levoy EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}