{"title":"Supreme City by Donald L. Miller EPUB","magnet":"magnet:?xt=urn:btih:67e407aa821849f0de9a73d528f08edc925bf4ea&dn=Supreme+City+by+Donald+L.+Miller+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"17109617","seeders":"10","leechers":"5","description":"xx\r\n\r\nSupreme City by Donald L. Miller EPUB\r\n\r\nWhile F. Scott Fitzgerald wrote, Manhattan was transformed by jazz, night clubs, radio, skyscrapers, movies, and the ferocious energy of the 1920s, as this illuminating cultural history brilliantly demonstrates.\r\n\r\nIn four words - &quot;the capital of everything&quot; - Duke Ellington captured Manhattan during one of the most exciting and celebrated eras in our history: The Jazz Age. Radio, tabloid newspapers, and movies with sound appeared. The silver screen took over Times Square as Broadway became America&apos;s movie mecca. Tremendous new skyscrapers were built in Midtown in one of the greatest building booms in history.\r\n\r\nSupreme City is the story of Manhattan&apos;s growth and transformation in the 1920s and the brilliant people behind it. Nearly all of the makers of modern Manhattan came from elsewhere: Walter Chrysler from the Kansas prairie; entertainment entrepreneur Florenz Ziegfeld from Chicago. William Paley, founder of the CBS radio network, was from Philadelphia, while his rival David Sarnoff, founder of NBC, was a Russian immigrant. Cosmetics queen Elizabeth Arden was Canadian and her rival, Helena Rubenstein, Polish. All of them had in common vaulting ambition and a desire to fulfill their dreams in New York. As mass communication emerged, the city moved from downtown to midtown through a series of engineering triumphs - Grand Central Terminal and the new and newly chic Park Avenue it created, the Holland Tunnel, and the modern skyscraper. In less than ten years Manhattan became the social, cultural, and commercial hub of the country. The 1920s was the Age of Jazz and the Age of Ambition.\r\n\r\nOriginal in concept, deeply researched, and utterly fascinating, Supreme City transports readers to that time and to the city which outsiders embraced, in E.B. White&apos; s words, &quot;with the intense excitement of first love.&quot;\r\n\r\nxx","last_updated":"2018-02-05T12:03:03.988Z","parsed":{"xt":"urn:btih:67e407aa821849f0de9a73d528f08edc925bf4ea","dn":"Supreme City by Donald L. Miller EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"67e407aa821849f0de9a73d528f08edc925bf4ea","infoHashBuffer":{"type":"Buffer","data":[103,228,7,170,130,24,73,240,222,154,115,213,40,240,142,220,146,91,244,234]},"name":"Supreme City by Donald L. Miller EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}