{"title":"The Pope's Last Crusade by Peter Eisner EPUB","magnet":"magnet:?xt=urn:btih:68245aaf29300097c2c26b13381b8bf07d91687a&dn=The+Pope%27s+Last+Crusade+by+Peter+Eisner+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2682552","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Pope&apos;s Last Crusade by Peter Eisner EPUB\r\n\r\nA conspiracy within the Vatican - to stop an outspoken Pope\r\n\r\nIn 1938, Pope Pius XI was the world&apos;s most prominent critic of Hitler and his rhetoric of ethnic &quot;purity.&quot; To make his voice heard, Pius called upon a relatively unknown American Jesuit whose writing about racism in America had caught the Pope&apos;s attention. Pius enlisted John LaFarge to write a papal encyclical - the Vatican&apos;s strongest decree - publicly condemning Hitler, Mussolini, and their murderous Nazi campaign against the Jews.\r\n\r\nAt the same time conservative members of the Vatican&apos;s innermost circle were working in secret to suppress the document. Chief among them was Cardinal Eugenio Pacelli, whose appeasement of the Germans underlay a deep-running web of conspiracy. Pacelli, who would become Pope Pius XII, was joined by Wlodimir Led&#xF3;chowski, leader of the Jesuit order, to keep the finished encyclical from reaching the increasingly ill Pope.\r\n\r\nPeter Eisner, award-winning reporter and author of the critically acclaimed The Freedom Line, combines shocking new evidence (released only recently from Vatican archives) and eyewitness testimony to create a compelling journey into the heart of the Vatican and a little-known story of an American&apos;s partnership with the head of the Catholic Church. A truly essential work, it brings staggering new light to one of the most critical junctures in modern history.\r\n\r\nxx","last_updated":"2018-06-08T12:00:59.738Z","parsed":{"xt":"urn:btih:68245aaf29300097c2c26b13381b8bf07d91687a","dn":"The Pope's Last Crusade by Peter Eisner EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"68245aaf29300097c2c26b13381b8bf07d91687a","infoHashBuffer":{"type":"Buffer","data":[104,36,90,175,41,48,0,151,194,194,107,19,56,27,139,240,125,145,104,122]},"name":"The Pope's Last Crusade by Peter Eisner EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}