{"title":"The Poison Squad by Deborah Blum (.epub)","magnet":"magnet:?xt=urn:btih:6941cadc26564a31cf792ddfe1570e66e33b8b63&dn=The+Poison+Squad+by+Deborah+Blum+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"30018046","seeders":"18","leechers":"4","description":"\r\nThe Poison Squad: One Chemist&apos;s Single-Minded Crusade for Food Safety at the Turn of the Twentieth Century by Deborah Blum\r\n\r\nRequirements: .ePUB reader\r\n\r\nOverview: From Pulitzer Prize winner and New York Times-bestselling author Deborah Blum, the dramatic true story of how food was made safe in the United States and the heroes, led by the inimitable Dr. Harvey Washington Wiley, who fought for change \r\n\r\nBy the end of nineteenth century, food was dangerous. Lethal, even. &quot;Milk&quot; might contain formaldehyde, most often used to embalm corpses. Decaying meat was preserved with both salicylic acid, a pharmaceutical chemical, and borax, a compound first identified as a cleaning product. This was not by accident; food manufacturers had rushed to embrace the rise of industrial chemistry, and were knowingly selling harmful products. Unchecked by government regulation, basic safety, or even labelling requirements, they put profit before the health of their customers. By some estimates, in New York City alone, thousands of children were killed by &quot;embalmed milk&quot; every year. Citizens&#x2013;activists, journalists, scientists, and women&apos;s groups&#x2013;began agitating for change. But even as protective measures were enacted in Europe, American corporations blocked even modest regulations. Then, in 1883, Dr. Harvey Washington Wiley, a chemistry professor from Purdue University, was named chief chemist of the agriculture department, and the agency began methodically investigating food and drink fraud, even conducting shocking human tests on groups of young men who came to be known as, &quot;The Poison Squad.&quot;\r\n\r\nGenre: Non-Fiction &gt; Health, Fitness &amp; Medical","last_updated":"2018-09-25T12:17:04.064Z","parsed":{"xt":"urn:btih:6941cadc26564a31cf792ddfe1570e66e33b8b63","dn":"The Poison Squad by Deborah Blum (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6941cadc26564a31cf792ddfe1570e66e33b8b63","infoHashBuffer":{"type":"Buffer","data":[105,65,202,220,38,86,74,49,207,121,45,223,225,87,14,102,227,59,139,99]},"name":"The Poison Squad by Deborah Blum (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}