{"title":"The Girl from Berlin by Ronald H. Balson EPUB","magnet":"magnet:?xt=urn:btih:6ca6c8698be082da84c08d2133f3e4f36f99835a&dn=The+Girl+from+Berlin+by+Ronald+H.+Balson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3588865","seeders":"17","leechers":"5","description":"xx \r\n\r\nThe Girl from Berlin by Ronald H. Balson EPUB \r\n\r\nIn the newest book from internationally best-selling author Ronald H. Balson, Liam and Catherine come to the aid of an old friend and are drawn into a property dispute in Tuscany that unearths long-buried secrets. \r\n\r\nAn old friend calls Catherine Lockhart and Liam Taggart to his famous Italian restaurant to enlist their help. His aunt is being evicted from her home in the Tuscan hills by a powerful corporation claiming they own the deeds, even though she can produce her own set of deeds to her land. Catherine and Liam&#x2019;s only clue is a bound, handwritten manuscript, entirely in German, and hidden in its pages is a story long-forgotten....\r\n\r\nAda Baumgarten was born in Berlin in 1918, at the end of the war. The daughter of an accomplished first-chair violinist in the prestigious Berlin Philharmonic and herself a violin prodigy, Ada&#x2019;s life was full of the rich culture of Berlin&#x2019;s interwar society. She formed a deep attachment to her childhood friend Kurt, but they were torn apart by the growing unrest as her Jewish family came under suspicion. As the tides of history turned, it was her extraordinary talent that would carry her through an unraveling society turned to war and make her a target even as it saved her, allowing her to move to Bologna - though Italy was not the haven her family had hoped, and further heartache awaited. \r\n\r\nWhat became of Ada? How is she connected to the conflicting land deeds of a small Italian villa? As they dig through the layers of lies, corruption, and human evil, Catherine and Liam uncover an unfinished story of heart, redemption, and hope - the ending of which is yet to be written. \r\n\r\nxx","last_updated":"2018-10-13T12:27:22.587Z","parsed":{"xt":"urn:btih:6ca6c8698be082da84c08d2133f3e4f36f99835a","dn":"The Girl from Berlin by Ronald H. Balson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6ca6c8698be082da84c08d2133f3e4f36f99835a","infoHashBuffer":{"type":"Buffer","data":[108,166,200,105,139,224,130,218,132,192,141,33,51,243,228,243,111,153,131,90]},"name":"The Girl from Berlin by Ronald H. Balson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}