{"title":"Servando Gonzalez - I Dare Call It Treason: The Council on Forei","magnet":"magnet:?xt=urn:btih:6d7bd13e5f266785d6ec747b4d5bf25fdc4b2142&dn=Servando+Gonzalez+-+I+Dare+Call+It+Treason%3A+The+Council+on+Forei&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"roflcopter2110","categoryP":"other","categoryS":"e_books","size":"1207527","seeders":"32","leechers":"1","description":"Servando Gonzalez - I Dare Call It Treason: The Council on Foreign Relations and the Betrayal of America (2013) pdf\r\n <a href=\"\nhttps://extraimage.net/images/2018/08/18/d20d3f276d22a80f713c7e3e03628c8e.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://extraimage.net/images/2018/08/18/d20d3f276d22a80f713c7e3e03628c8e.jpg</a>\r\n\r\nGenre: History, Politics &amp; Government, United States, National\r\nPublisher: Spooks Books\r\nLanguage: English\r\nISBN-10: 0932367240\r\nISBN-13: 978-0932367242\r\nFormat: PDF\r\n\r\nThe Council on Foreign Relations (CFR) describes itself as a sort of social club where the rich and powerful get together to discuss national and international politics from a rational, non-partisan, patriotic perspective. But, really, what is the Council on Foreign Relations? The CFR is many things. It is a millionaires club, a communo-fascist party in power, an intelligence agency, a think tank, a criminal gang, an association of assassins and mass murderers, a cabal of sociopaths and psychopaths, a sect involved in the occult and a pirates&#x2019; den.\r\nMoreover, the CFR is the visible head of the Secret Government of the United States. Its core nucleus is composed of international bankers, oil magnates and CEOs of transnational corporations. But, most importantly, the CFR is the true axis of evil in the world. The CFR&#x2019;s main enemy is the people of the world, particularly the American people. This explains why, behind every single act of treason against the American people, you can always find, hiding in the shadows, one or more members of the Council on Foreign Relations.\r\nThe CFR&#x2019;s true, secret goal, is the elimination of 85 percent of the world&#x2019;s population as the first step in establishing a New World Order &#x2014; a communo-fascist totalitarian dictatorship with just two social classes: the all-powerful masters, living in opulence, and the other 99 percent of the population, made up of oppressed serfs, with no rights at all, living in the most abject economic and moral poverty under a total surveillance police state.\r\nIs it time to overthrow the Invisible Government of the United States? Read this book and reach your own conclusions","last_updated":"2018-08-18T12:12:04.774Z","parsed":{"xt":"urn:btih:6d7bd13e5f266785d6ec747b4d5bf25fdc4b2142","dn":"Servando Gonzalez - I Dare Call It Treason: The Council on Forei","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6d7bd13e5f266785d6ec747b4d5bf25fdc4b2142","infoHashBuffer":{"type":"Buffer","data":[109,123,209,62,95,38,103,133,214,236,116,123,77,91,242,95,220,75,33,66]},"name":"Servando Gonzalez - I Dare Call It Treason: The Council on Forei","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}