{"title":"There There by Tommy Orange EPUB","magnet":"magnet:?xt=urn:btih:6dc7637bbc76a2a7f908a071db5073f385afab89&dn=There+There+by+Tommy+Orange+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6023499","seeders":"0","leechers":"0","description":"xx\r\n\r\nThere There by Tommy Orange EPUB\r\n\r\nNot since Sherman Alexie&apos;s The Lone Ranger and Tonto Fistfight in Heaven and Louise Erdrich&apos;s Love Medicine has such a powerful and urgent Native American voice exploded onto the landscape of contemporary fiction. Tommy Orange&apos;s There There introduces a brilliant new author at the start of a major career.\r\n\r\n&quot;We all came to the powwow for different reasons. The messy, dangling threads of our lives got pulled into a braid - tied to the back of everything we&apos;d been doing all along to get us here. There will be death and playing dead, there will be screams and unbearable silences, forever-silences, and a kind of time-travel, at the moment the gunshots start, when we look around and see ourselves as we are, in our regalia, and something in our blood will recoil then boil hot enough to burn through time and place and memory. We&apos;ll go back to where we came from, when we were people running from bullets at the end of that old world. The tragedy of it all will be unspeakable, that we&apos;ve been fighting for decades to be recognized as a present-tense people, modern and relevant, only to die in the grass wearing feathers.&quot;\r\n\r\nJacquie Red Feather is newly sober and trying to make it back to the family she left behind in shame in Oakland. Dene Oxendene is pulling his life together after his uncle&apos;s death and has come to work the powwow and to honor his uncle&apos;s memory. Edwin Black has come to find his true father. Thomas Frank has come to drum the Grand Entry. Opal Viola Victoria Bear Shield has come to watch her nephew Orvil Red Feather; Orvil has taught himself Indian dance through YouTube videos, and he has come to the Big Oakland Powwow to dance in public for the very first time. Tony Loneman is a young Native American boy whose future seems destined to be as bleak as his past, and he has come to the Powwow with darker intentions - intentions that will destroy the lives of everyone in his path.\r\n\r\n..\r\n\r\nxx","last_updated":"2018-06-06T12:04:12.898Z","parsed":{"xt":"urn:btih:6dc7637bbc76a2a7f908a071db5073f385afab89","dn":"There There by Tommy Orange EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6dc7637bbc76a2a7f908a071db5073f385afab89","infoHashBuffer":{"type":"Buffer","data":[109,199,99,123,188,118,162,167,249,8,160,113,219,80,115,243,133,175,171,137]},"name":"There There by Tommy Orange EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}