{"title":"Sleep Over_ Oral History of the Apocalypse by H. G. Bells EPUB","magnet":"magnet:?xt=urn:btih:6e6220dd2bd719caf4519279ff5c2614f43168b3&dn=Sleep+Over_+Oral+History+of+the+Apocalypse+by+H.+G.+Bells+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"889953","seeders":"25","leechers":"10","description":"xx\r\n\r\nSleep Over_ Oral History of the Apocalypse by H. G. Bells EPUB\r\n\r\nFor fans of the oral history genre phenomenon World War Z, a worldwide plague of insomnia creates a devastating new apocalypse.\r\n\r\nRemember what it&apos;s like to last an entire night without sleep? That dull but constant headache. The feeling of your brain on edge. How easily irritated you were. How difficult it was to concentrate, even on seemingly menial tasks. It was just a single restless night, but everything felt just a little bit harder to do, and the only real comfort was knowing your head would finally hit the pillow at the end of the day, and when you awoke the next morning everything would return to normal.\r\n\r\nBut what if sleep didn&apos;t come the next night? Or the night after? What might happen if you, your friends and family, your coworkers, the strangers you pass on the street, all slowly began to realize that rest might not ever come again?\r\n\r\nHow slowly might the world fall apart? How long would it take for a society without sleep to descend into chaos?\r\n\r\nSleep Over is collection of waking nightmares, a scrapbook of the haunting and poignant stories from those trapped in a world where the pillars of society are crumbling, and madness is slowly descending on a planet without rest.\r\n\r\nOnline vigilantism turns social media into a deadly gamble.\r\n\r\nA freelance journalist grapples with the ethics of turning in footage of mass suicide.\r\n\r\nA kidnapped hypnotist is held hostage by those at wit&apos;s end for a cure.\r\n\r\nIn Sleep Over, these stories are just the beginning. Before the Longest Day, the world record was eleven days without sleep. It turns out most of us can go much longer.\r\n\r\nxx","last_updated":"2018-01-18T19:01:00.305Z","parsed":{"xt":"urn:btih:6e6220dd2bd719caf4519279ff5c2614f43168b3","dn":"Sleep Over_ Oral History of the Apocalypse by H. G. Bells EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6e6220dd2bd719caf4519279ff5c2614f43168b3","infoHashBuffer":{"type":"Buffer","data":[110,98,32,221,43,215,25,202,244,81,146,121,255,92,38,20,244,49,104,179]},"name":"Sleep Over_ Oral History of the Apocalypse by H. G. Bells EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}