{"title":"How Far She's Come by Holly Brown EPUB","magnet":"magnet:?xt=urn:btih:6ebd0df9c848851fb1ac2bd82531e0ed3fb29aa8&dn=How+Far+She%27s+Come+by+Holly+Brown+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"688087","seeders":"0","leechers":"0","description":"xx\r\n\r\nHow Far She&apos;s Come by Holly Brown EPUB\r\n\r\nFrom the highly acclaimed author of Don&#x2019;t Try to Find Me and This is Not Over comes the unforgettable, harrowing story of a young broadcast journalist who discovers a mysterious diary from a female broadcaster in 1991 featuring startling - and frightening - parallels to her own life.\r\n\r\nYou might be wondering what a diary from 1991 has to do with you. You&apos;re about to find out. Those who don&apos;t learn from the past are doomed to repeat it....\r\n\r\nTwenty-four-year-old Cheyenne Florian has just received her dream job offer. On the strength of a few vlogs, she&#x2019;s recruited to be the new correspondent on the recently hatched Independent News Network, INN.\r\n\r\nWith the slogan &#x201C;Because independent thinking is the only way out&#x201D;, INN has branded itself as innovative. Yet once Cheyenne joins the INN team, she finds age-old dynamics in play. Some of the female staff resent her meteoric rise, while a number of the men are only too happy to welcome her. Then there&#x2019;s the diary left for her anonymously, written in 1991 by a female broadcaster named Elyse Rohrbach. The mysterious diary is accompanied by a note, urging Cheyenne to learn from the past. She wants to believe it&#x2019;s intended as inspiration and friendly advice, or at most, a warning. But as disturbing - and increasingly dangerous - parallels begin to emerge, she starts to wonder if something more sinister is at work.\r\n\r\nIt&#x2019;s almost as if someone is engineering the similarities in Cheyenne&#x2019;s life to match those from Elyse&#x2019;s past, like she&#x2019;s a pawn in a very twisted game. But Cheyenne is determined to rewrite the rules and play her own game. Though they&#x2019;re separated by more than 25 years, Elyse and Cheyenne are forced to learn the same lesson: Nothing is more threatening than a woman who doesn&#x2019;t yet know her own power....\r\n\r\nxx","last_updated":"2018-05-23T12:01:18.458Z","parsed":{"xt":"urn:btih:6ebd0df9c848851fb1ac2bd82531e0ed3fb29aa8","dn":"How Far She's Come by Holly Brown EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6ebd0df9c848851fb1ac2bd82531e0ed3fb29aa8","infoHashBuffer":{"type":"Buffer","data":[110,189,13,249,200,72,133,31,177,172,43,216,37,49,224,237,63,178,154,168]},"name":"How Far She's Come by Holly Brown EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}