{"title":"The Cosmic Cocktail by Katherine Freese EPUB","magnet":"magnet:?xt=urn:btih:6edb6d3175a173cfbb95a106c0434060ce57bf59&dn=The+Cosmic+Cocktail+by+Katherine+Freese+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"8976251","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Cosmic Cocktail: Three Parts Dark Matter by Katherine Freese EPUB\r\n\r\nThe ordinary atoms that make up the known universe - from our bodies and the air we breathe to the planets and stars - constitute only 5 percent of all matter and energy in the cosmos. The rest is known as dark matter and dark energy, because their precise identities are unknown. The Cosmic Cocktail is the inside story of the epic quest to solve one of the most compelling enigmas of modern science - what is the universe made of? - told by one of today&#x2019;s foremost pioneers in the study of dark matter.\r\n\r\nBlending cutting-edge science with her own behind-the-scenes insights as a leading researcher in the field, acclaimed theoretical physicist Katherine Freese recounts the hunt for dark matter, from the discoveries of visionary scientists like Fritz Zwicky - the Swiss astronomer who coined the term &#x201C;dark matter&#x201D; in 1933 - to the deluge of data today from underground laboratories, satellites in space, and the Large Hadron Collider. Theorists contend that dark matter consists of fundamental particles known as WIMPs, or weakly interacting massive particles. Billions of them pass through our bodies every second without us even realizing it, yet their gravitational pull is capable of whirling stars and gas at breakneck speeds around the centers of galaxies, and bending light from distant bright objects. Freese describes the larger-than-life characters and clashing personalities behind the race to identify these elusive particles.\r\n\r\nMany cosmologists believe we are on the verge of solving the mystery. The Cosmic Cocktail provides the foundation needed to fully fathom this epochal moment in humankind&#x2019;s quest to understand the universe.\r\n\r\nxx","last_updated":"2018-11-24T12:01:24.264Z","parsed":{"xt":"urn:btih:6edb6d3175a173cfbb95a106c0434060ce57bf59","dn":"The Cosmic Cocktail by Katherine Freese EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6edb6d3175a173cfbb95a106c0434060ce57bf59","infoHashBuffer":{"type":"Buffer","data":[110,219,109,49,117,161,115,207,187,149,161,6,192,67,64,96,206,87,191,89]},"name":"The Cosmic Cocktail by Katherine Freese EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}