{"title":"The Devil Inside the Beltway by Michael J. Daugherty EPUB","magnet":"magnet:?xt=urn:btih:709f491eefa537f55b6a077036e13908e5cded46&dn=The+Devil+Inside+the+Beltway+by+Michael+J.+Daugherty+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"509913","seeders":"48","leechers":"5","description":"xx\r\n\r\nThe Devil Inside the Beltway by Michael J. Daugherty EPUB\r\n\r\nSmall business owner Michael J. Daugherty is fighting back against US Government&apos;s sinister surveillance tactics in his book, The Devil Inside the Beltway: The Shocking Expose of the US Government&apos;s Surveillance and Overreach into Cybersecurity, Medicine, and Small Business. During the past decade the US Government has teamed with private enterprise and academia to attack American small business by surveilling networks and picking up Americans&apos; files they considered to be &quot;shared&quot; and &quot;vulnerable.&quot;\r\n\r\nThey used that information to expand and grow more than one government agency. Michael J. Daugherty, the small business owner who created LabMD, a cancer detection center in Atlanta, Georgia, became a victim of these governmental practices. What began with the unauthorized but government-funded procurement of medical data for 9000+ patients from his medical laboratory turned into a government supported, financially draining, extortion attempt.\r\n\r\nTaking you inside his five-year journey of government power grabs and intimidation tactics, Daugherty backs his riveting true story with engaging detail, including Congressional testimony, press releases, e-mails, letters and FOIA documents. But for the fact that everything in the book really happened, it&apos;s like a brilliant political thriller. The cronies, lawyers, politicians and bullies...they are all right here in this stinging indictment.\r\n\r\nxx","last_updated":"2018-06-16T12:11:44.112Z","parsed":{"xt":"urn:btih:709f491eefa537f55b6a077036e13908e5cded46","dn":"The Devil Inside the Beltway by Michael J. Daugherty EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"709f491eefa537f55b6a077036e13908e5cded46","infoHashBuffer":{"type":"Buffer","data":[112,159,73,30,239,165,55,245,91,106,7,112,54,225,57,8,229,205,237,70]},"name":"The Devil Inside the Beltway by Michael J. Daugherty EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}