{"title":"Bingkun Hu - The Complete Wild Goose Qigong Series 9DVDs","magnet":"magnet:?xt=urn:btih:70c21b181f5d217b65b279d959f433737d55f665&dn=+Bingkun+Hu+-+The+Complete+Wild+Goose+Qigong+Series+9DVDs&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"acer47x","categoryP":"other","categoryS":"other","size":"8102220250","seeders":"6","leechers":"6","description":" Wild Goose 1 Qigong is well known for its lovely and graceful movements, which are suggestive of the image of an innocent and carefree wild goose. Learning Wild Goose Qigong usually needs a gradual deepening process. It starts with the sheer joy of doing the delightful Wild Goose movements. As they become automatic, you feel your whole body is involved with the movements. Finally, you gradually are aware of the body and mind integration. In order to learn a new set of Wild Goose Qigong, you probably need to review each of the previous learned sets several times. This is because the more you understand the inner functioning of your body, the more youll feel the flowing of qi. And the more you can feel the flowing of Qi inside your body, the more you like to practice the this and all the other Wild Goose Qigongs again and again. Rather than charming you with exotic locations and scenery, these videos make every effort to focus on teaching the movements, body control and background necessary to learn this beautiful form of Qigong. Dr. Hu does not wear a special costume or clothing and promotes the idea that Qigong can be practiced anytime, anyplace and in any clothes. Also known as Dayan Qigong, these movements are a great addition to Tai Chi, Yoga, Pilates, Acupressure and all martial arts practices. This video incorporates medical Qigong and acupressure. Dr. Hu is a medical Qigong master and therapist providing Qigong workshops worldwide. Practicing Wild Goose Qigong can: Improve blood circulation. Develop breathing and movement coordination. Increase body and mind flexibility. Cultivate awareness of Qi in and around our bodies. Wild Goose II offers one of the most important basic trainings in the Wild Goose system. As a perfect example of yin-yang balance, it trains us not only on how to disperse the dirty Qi, but also how to receive the fresh Qi. WG-2 can also develop our physical strength and agility. Through the simple turning over of the palms, and the natural left and right turn of the body, this delightful Qigong trains our upper and lower body coordination and how to shift body weight in an effortless way. Contrary to Bagua steps for self-defense, walking the circle steps in Kunlun Bagua is meditative and self-fulfilling. Together with the coiling of the wrists, it balances the yin and yang aspects of our bodies and promotes self-healing. It opens up the Conception and Governing vessels, and nourishes our internal organs. Tripod Spiral Qigong is one of those rare jewels which can be enjoyed by both Qigong beginners and advanced practitioners alike. Tripod Spiral Qigong is unique in providing a variety of training within one set of Qigong movements: ranging from postures, relaxation, stretching, the free flow of Qi, and finally achieving the microcosmic orbit. This is one of the easiest Wild Goose Qigong sets to learn and is often taught before Wild Goose Qigong 1 for beginners. Practicing this Qigong will have multiple health benefits, which include: Boosting ones immune system Improving ones cognitive functions Building up ones inner strength Alleviating common aches and pains","last_updated":"2018-11-04T12:37:12.164Z","parsed":{"xt":"urn:btih:70c21b181f5d217b65b279d959f433737d55f665","dn":" Bingkun Hu - The Complete Wild Goose Qigong Series 9DVDs","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"70c21b181f5d217b65b279d959f433737d55f665","infoHashBuffer":{"type":"Buffer","data":[112,194,27,24,31,93,33,123,101,178,121,217,89,244,51,115,125,85,246,101]},"name":" Bingkun Hu - The Complete Wild Goose Qigong Series 9DVDs","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}