{"title":"Isabella: The Warrior Queen by Kirstin Downey MOBI","magnet":"magnet:?xt=urn:btih:72ee8d425536eede704f94af2da58059721bf01f&dn=Isabella%3A+The+Warrior+Queen+by+Kirstin+Downey+MOBI&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6882819","seeders":"28","leechers":"5","description":"xx \r\n\r\nIsabella: The Warrior Queen by Kirstin Downey MOBI \r\n\r\nAn engrossing and revolutionary biography of Isabella of Castile, the controversial Queen of Spain who sponsored Christopher Columbus&apos;s journey to the New World, established the Spanish Inquisition, and became one of the most influential female rulers in history. \r\n\r\nBorn at a time when Christianity was dying out and the Ottoman Empire was aggressively expanding, Isabella was inspired in her youth by tales of Joan of Arc, a devout young woman who unified her people and led them to victory against foreign invaders. In 1474, when most women were almost powerless, 23-year-old Isabella defied a hostile brother and a mercurial husband to seize control of Castile and Le&#xF3;n. Her subsequent feats were legendary. She ended a 24-generation struggle between Muslims and Christians, forcing North African invaders back over the Mediterranean Sea. She laid the foundation for a unified Spain. She sponsored Columbus&apos;s trip to the Indies and negotiated Spanish control over much of the New World with the help of Rodrigo Borgia, the infamous Pope Alexander VI. She also annihilated all who stood against her by establishing a bloody religious Inquisition that would darken Spain&apos;s reputation for centuries. \r\n\r\nWhether saintly or satanic, no female leader has done more to shape our modern world, in which millions of people in two hemispheres speak Spanish and practice Catholicism. Yet history has all but forgotten Isabella&apos;s influence, due to hundreds of years of misreporting that often attributed her accomplishments to Ferdinand, the bold and philandering husband she adored. Using new scholarship, Downey&apos;s luminous biography tells the story of this brilliant, fervent, forgotten woman, the faith that propelled her through life, and the land of ancient conflicts and intrigue she brought under her command. \r\n\r\nxx","last_updated":"2018-09-08T12:27:50.242Z","parsed":{"xt":"urn:btih:72ee8d425536eede704f94af2da58059721bf01f","dn":"Isabella: The Warrior Queen by Kirstin Downey MOBI","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"72ee8d425536eede704f94af2da58059721bf01f","infoHashBuffer":{"type":"Buffer","data":[114,238,141,66,85,54,238,222,112,79,148,175,45,165,128,89,114,27,240,31]},"name":"Isabella: The Warrior Queen by Kirstin Downey MOBI","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}