{"title":"A Significant Life by Todd May (.epub)(.azw3)(.mobi)","magnet":"magnet:?xt=urn:btih:730ecfbfcde3a1226fecdf40c9b9f5d100334506&dn=A+Significant+Life+by+Todd+May+%28.epub%29%28.azw3%29%28.mobi%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"1797173","seeders":"0","leechers":"0","description":"A Significant Life: Human Meaning in a Silent Universe by Todd May\r\n\r\nRequirements: .ePUB, .MOBI, .AZW3 Reader\r\n\r\nOverview: What makes for a good life, or a beautiful one, or, perhaps most important, a meaningful one? Throughout history most of us have looked to our faith, our relationships, or our deeds for the answer. But in A Significant Life, philosopher Todd May offers an exhilarating new way of thinking about these questions, one deeply attuned to life as it actually is: a work in progress, a journey&#x2014;and often a narrative. Offering moving accounts of his own life and memories alongside rich engagements with philosophers from Aristotle to Heidegger, he shows us where to find the significance of our lives: in the way we live them. \r\n\r\nMay starts by looking at the fundamental fact that life unfolds over time, and as it does so, it begins to develop certain qualities, certain themes. Our lives can be marked by intensity, curiosity, perseverance, or many other qualities that become guiding narrative values. These values lend meanings to our lives that are distinct from&#x2014;but also interact with&#x2014;the universal values we are taught to cultivate, such as goodness or happiness. Offering a fascinating examination of a broad range of figures&#x2014;from music icon Jimi Hendrix to civil rights leader Fannie Lou Hamer, from cyclist Lance Armstrong to The Portrait of a Lady&#x2019;s Ralph Touchett to Claus von Stauffenberg, a German officer who tried to assassinate Hitler&#x2014;May shows that narrative values offer a rich variety of criteria by which to assess a life, specific to each of us and yet widely available. They offer us a way of reading ourselves, who we are, and who we might like to be. \r\n\r\nGenre: Non-Fiction &gt; Philosophy","last_updated":"2018-10-06T12:03:31.742Z","parsed":{"xt":"urn:btih:730ecfbfcde3a1226fecdf40c9b9f5d100334506","dn":"A Significant Life by Todd May (.epub)(.azw3)(.mobi)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"730ecfbfcde3a1226fecdf40c9b9f5d100334506","infoHashBuffer":{"type":"Buffer","data":[115,14,207,191,205,227,161,34,111,236,223,64,201,185,245,209,0,51,69,6]},"name":"A Significant Life by Todd May (.epub)(.azw3)(.mobi)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}