{"title":"Touching the Dragon by James Hatch (MOBI, EPUB, PDF)","magnet":"magnet:?xt=urn:btih:73272d598c5ff1585a763aeb4dae7c567d8ba7e3&dn=Touching+the+Dragon+by+James+Hatch+%28MOBI%2C+EPUB%2C+PDF%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"mwsfan","categoryP":"other","categoryS":"e_books","size":"22975539","seeders":"23","leechers":"12","description":"From former special ops Navy SEAL senior chief; master naval parachutist (four Bronze Stars with Valor, Navy and Marine Corps Medal recipient, etc.); fighter in 150 missions (Iraq, Afghanistan, Bosnia, Africa); expert military dog trainer and handler whose SEAL dogs were partners and medal winners--a fierce, moving tale of a return from hell, being badly wounded on a special ops mission that ended his two-decades-long military career, his searing recovery, and the struggle to live life off the speeding train of war.\r\n\r\nIn Touching the Dragon, James Hatch, Naval Special Warfare Operator, expert commando, tactical master in deadly operations, twenty-four years in service to his country (he enlisted in the Army National Guard at age seventeen), writes of his years of military service, from joining the Navy at eighteen, becoming a SEAL, to his joining the Naval Special Warfare Development group (&quot;If I died in a gunfight, it would be doing something I loved&quot;). He writes of the harrowing secret missions (Iraq, Bosnia, Africa); and of the fateful final mission (Afghanistan), that left him badly shot (a bullet exploding through his femur and out the back of his leg) as Hatch and his SEAL team crew were attempting to rescue a rogue soldier--Pvt. Bowe Bergdahl, who deserted his post, was captured by Al Qaida and Taliban militants, and was set to be smuggled to a part of the world where Americans could never reach him.\r\n     Hatch writes of the horrific wound to his leg; of having no choice but to end his military career; of coming home to the country he&apos;d spent his life defending; of the ordeal of getting well physically (eighteen surgeries; twelve months of recovery; learning to walk again); of having to find out who he was as a man apart from the chaotic world of special operations missions; of days and months of despair, alcoholism, the pull toward suicide; and of finally, through love of family, friends, soldiers, and his specially trained military dogs, touching the dragon, of going through the fear of feeling unfit for society, of finding a purpose and a way back to life","last_updated":"2018-07-02T12:13:31.956Z","parsed":{"xt":"urn:btih:73272d598c5ff1585a763aeb4dae7c567d8ba7e3","dn":"Touching the Dragon by James Hatch (MOBI, EPUB, PDF)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"73272d598c5ff1585a763aeb4dae7c567d8ba7e3","infoHashBuffer":{"type":"Buffer","data":[115,39,45,89,140,95,241,88,90,118,58,235,77,174,124,86,125,139,167,227]},"name":"Touching the Dragon by James Hatch (MOBI, EPUB, PDF)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}