{"title":"Hell to Pay by D. M. Giangreco EPUB","magnet":"magnet:?xt=urn:btih:738704b9230ed0cc9a531bfe80e925337e19df98&dn=Hell+to+Pay+by+D.+M.+Giangreco+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3842500","seeders":"7","leechers":"6","description":"xx\r\n\r\nHell to Pay by D. M. Giangreco EPUB\r\n\r\nHell to Pay is a comprehensive and compelling examination of the many complex issues that encompassed the strategic plans for the proposed American invasion of Japan. U.S. planning for the invasion and military occupation of Imperial Japan began in 1943, two years before the dropping of atom bombs on Hiroshima and Nagasaki.\r\n\r\nIn its final form, Operation Downfall called for a massive Allied invasion - on a scale dwarfing D-Day - to be carried out in two stages. In the first stage, Operation Olympic, the U.S. Sixth Army would lead the southernmost assault on the Home Island of Kyushu preceded by the dropping of as many as nine atom bombs behind the landing beaches and troop concentrations inland. Sixth Army would secure airfields and anchorages needed to launch the second stage, Operation Coronet, five hundred miles to the north in 1946. The decisive Coronet invasion of the industrial heartland of Japan through the Tokyo Plain would be led by the Eighth Army, as well as the First Army, which had previously pummeled its way across France and Germany to defeat the Nazis.\r\n\r\nThese facts are well known and have been recounted - with varying degrees of accuracy - in a variety of books and articles. A common theme in these works is their reliance on a relatively few declassified high-level planning documents. In contrast, Hell to Pay examines the invasion of Japan in light of the large body of Japanese and American operational and tactical planning documents unearthed by the author in both familiar and obscure archives, as well as postwar interrogations and reports that senior Japanese commanders and their staffs were ordered to produce for General MacArthur&apos;s headquarters.\r\n\r\nHell to Pay brings to light the political and military ramifications of the enormous casualties and loss of material projected by both sides in the climatic struggle to bring the Pacific War to a conclusion through a brutal series of battles on Japanese soil.\r\n\r\nxx","last_updated":"2018-01-28T12:03:49.758Z","parsed":{"xt":"urn:btih:738704b9230ed0cc9a531bfe80e925337e19df98","dn":"Hell to Pay by D. M. Giangreco EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"738704b9230ed0cc9a531bfe80e925337e19df98","infoHashBuffer":{"type":"Buffer","data":[115,135,4,185,35,14,208,204,154,83,27,254,128,233,37,51,126,25,223,152]},"name":"Hell to Pay by D. M. Giangreco EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}