{"title":"Inside the Tudor Court: Henry VIII and His Six Wives Through...","magnet":"magnet:?xt=urn:btih:741ed2114c6b8b640c8844b7fd72bc6971fc95ca&dn=Inside+the+Tudor+Court%3A+Henry+VIII+and+His+Six+Wives+Through...&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"1525666","seeders":"53","leechers":"3","description":"Inside the Tudor Court: Henry VIII and His Six Wives Through the Writings of the Spanish Ambassador Eustace Chapuys - Lauren Mackay [epub]\r\n\r\nThe reports and despatches of Eustace Chapuys, Spanish Ambassador to Henry VIII&apos;s court from 1529 to 1545, have been instrumental in shaping our modern interpretations of Henry VIII and his wives. As a result of his personal relationships with several of Henry&apos;s queens, and Henry himself, his writings were filled with colourful anecdotes, salacious gossip, and personal and insightful observations of the key players at court, thus offering the single most continuous portrait of the central decades of Henry&apos;s reign.\r\n\r\nBeginning with Chapuys&apos; arrival in England, in the middle of Henry VIII&apos;s divorce from Katherine of Aragon, this book progresses through the episodic reigns of each of Henry&apos;s queens. Chapuys tirelessly defended Katherine and later her daughter, Mary Tudor, the future Mary I. He remained as ambassador through the rise and fall of Anne Boleyn, and reported on each and every one of Henry&apos;s subsequent wives - Jane Seymour, Anne of Cleves, Catherine Howard, and Katharine Parr - as well as that most notorious of ministers Thomas Cromwell. He retired in 1545, close to the end of Henry VIII&apos;s reign.\r\n\r\nIn approaching the period through Chapuys&apos; letters, Lauren Mackay provides a fresh perspective on Henry, his court and the Tudor period in general.\r\n\r\nHardcover: 288 pages\r\nPublisher: Amberley Publishing (February 15, 2014)","last_updated":"2018-09-22T12:36:20.478Z","parsed":{"xt":"urn:btih:741ed2114c6b8b640c8844b7fd72bc6971fc95ca","dn":"Inside the Tudor Court: Henry VIII and His Six Wives Through...","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"741ed2114c6b8b640c8844b7fd72bc6971fc95ca","infoHashBuffer":{"type":"Buffer","data":[116,30,210,17,76,107,139,100,12,136,68,183,253,114,188,105,113,252,149,202]},"name":"Inside the Tudor Court: Henry VIII and His Six Wives Through...","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}