{"title":"Orderly and Humane.The Expulsions of the Germans after the war","magnet":"magnet:?xt=urn:btih:74457eb381e4376b102f1bed04eac3a8e175b6ec&dn=Orderly+and+Humane.The+Expulsions+of+the+Germans+after+the+war&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Xiadxico","categoryP":"other","categoryS":"e_books","size":"17780647","seeders":"1","leechers":"0","description":"Immediately after the Second World War, the victorious Allies authorized and helped to carry out the forced relocation of German speakers from their homes across central and southern Europe to Germany. The numbers were almost unimaginable&#x2014;between 12,000,000 and 14,000,000 civilians, most of them women and children&#x2014;and the losses horrifying&#x2014;at least 500,000 people, and perhaps many more, died while detained in former concentration camps, while locked in trains en route, or after arriving in Germany exhausted, malnourished, and homeless. This book is the first in any language to tell the full story of this immense man-made catastrophe.\r\n\r\nBased mainly on archival records of the countries that carried out the forced migrations and of the international humanitarian organizations that tried but failed to prevent the disastrous results, Orderly and Humane: The Expulsion of the Germans after the Second World War is an authoritative and objective account. It examines an aspect of European history that few have wished to confront, exploring how the expulsions were conceived, planned, and executed and how their legacy reverberates throughout central Europe today. The book is an important study of the largest recorded episode of what we now call &quot;ethnic cleansing,&quot; and it may also be the most significant untold story of the Second World War","last_updated":"2018-03-20T12:02:02.065Z","parsed":{"xt":"urn:btih:74457eb381e4376b102f1bed04eac3a8e175b6ec","dn":"Orderly and Humane.The Expulsions of the Germans after the war","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"74457eb381e4376b102f1bed04eac3a8e175b6ec","infoHashBuffer":{"type":"Buffer","data":[116,69,126,179,129,228,55,107,16,47,27,237,4,234,195,168,225,117,182,236]},"name":"Orderly and Humane.The Expulsions of the Germans after the war","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}