{"title":"A Tokyo Romance by Ian Buruma EPUB","magnet":"magnet:?xt=urn:btih:7498e8c6e450c957ad69931a805832a7dc8f9bfc&dn=A+Tokyo+Romance+by+Ian+Buruma+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"11983404","seeders":"0","leechers":"0","description":"xx\r\n\r\nA Tokyo Romance by Ian Buruma EPUB\r\n\r\nA classic memoir of self-invention in a strange land: Ian Buruma&apos;s unflinching account of his amazing journey into the heart of Tokyo&apos;s underground culture as a young man in the 1970s\r\n\r\nWhen Ian Buruma arrived in Tokyo in 1975, Japan was little more than an idea in his mind, a fantasy of a distant land. A sensitive misfit in the world of his upper middle class youth, what he longed for wasn&apos;t so much the exotic as the raw, unfiltered humanity he had experienced in Japanese theater performances and films, witnessed in Amsterdam and Paris. One particular theater troupe, directed by a poet of runaways, outsiders, and eccentrics, was especially alluring, more than a little frightening, and completely unforgettable. If Tokyo was anything like his plays, Buruma knew that he had to join the circus as soon as possible.\r\n\r\nTokyo was an astonishment. Callow and unformed, Buruma found a feverish and surreal metropolis where nothing was understated and everything shouted for attention - neon lights, crimson lanterns, Japanese pop, advertising jingles, cabarets, and PA systems. He encountered a city in the midst of an economic boom where everything seemed new, aside from the isolated temple or shrine that had survived the firestorms and earthquakes that had leveled the city during the past century. History remained in fragments: the shapes of wounded World War Two veterans in white kimonos, murky old bars that Mishima had cruised in, and the narrow alleys where street girls had once flitted. \r\n\r\nBuruma&apos;s Tokyo, though, was a city engaged in a radical transformation. And through his adventures in the world of avant-garde theater, his encounters with carnival acts, fashion photographers, and moments on set with Akira Kurosawa, Buruma underwent a radical transformation of his own. For an outsider, unattached to the cultural burdens placed on the Japanese, this was a place to be truly free.  \r\n\r\nA Tokyo Romance is a portrait of a young artist and the fantastical city that shaped him. With his signature acuity, Ian Buruma brilliantly captures the historical tensions between East and West, the clash of conflicting cultures, and the dilemma of the gaijin in Japanese society, constantly free yet always on the outside. The result is a timeless story about the desire to transgress boundaries: cultural, artistic, and sexual.\r\n\r\nxx","last_updated":"2018-03-26T12:01:05.723Z","parsed":{"xt":"urn:btih:7498e8c6e450c957ad69931a805832a7dc8f9bfc","dn":"A Tokyo Romance by Ian Buruma EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7498e8c6e450c957ad69931a805832a7dc8f9bfc","infoHashBuffer":{"type":"Buffer","data":[116,152,232,198,228,80,201,87,173,105,147,26,128,88,50,167,220,143,155,252]},"name":"A Tokyo Romance by Ian Buruma EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}