{"title":"Never Love a Stranger by Harold Robbins EPUB","magnet":"magnet:?xt=urn:btih:7655a17b9c71a6b63e542e77827473dcdb8d1eeb&dn=Never+Love+a+Stranger+by+Harold+Robbins+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"600588","seeders":"33","leechers":"3","description":"xx\r\n\r\nNever Love a Stranger by Harold Robbins EPUB\r\n\r\nBased on a $100 bet with his boss that he couldn&apos;t write a novel, Harold Robbins penned his first book, Never Love a Stranger. Not only did Robbins win the bet, the novel became a best seller, was adapted into the classic noir gangster film of the same name starring John Barrymore and Steve McQueen, and launched the career of one of the world&apos;s best-selling authors of all time.\r\n\r\nNever Love a Stranger, still considered one of Robbins&apos; most powerful books, tells the story of Francis &quot;Frankie&quot; Kane, an orphan growing up in the dirty world of New York&apos;s Hell&apos;s Kitchen. After being kicked out of a Catholic orphanage when it is discovered that he is of Jewish descent, a confused and deeply distraught Frankie turns to a life of crime, the only life he knows, and he&apos;s good at it. Frankie quickly makes a name for himself and becomes one of New York&apos;s most dangerous men, ruling the city with an iron fist and indulging in his passion for sex, power, and the best things life has to offer - regardless of whether they&apos;re for sale. But Frankie&apos;s childhood friend, Jerry, grows to become an ambitious, tough-as-nails district attorney - determined to bring Frankie down.\r\n\r\nIn Robbins&apos; writing debut, he takes an unflinching look at the menacing New York of a bygone era when the syndicate ruled without mercy - and the world was introduced to a writer who would influence pop culture worldwide for decades to come. More than 25 New York Times best sellers later - many, like his most famous novel, The Carpetbaggers, reaching the number-one spot - and with over 750 million copies sold to date, Robbins became one of the most successful authors of all time. This is the novel that started it all - giving the world its first taste of Robbins&apos; world of sex, corruption, and intrigue.\r\n\r\nxx","last_updated":"2018-07-02T12:13:18.511Z","parsed":{"xt":"urn:btih:7655a17b9c71a6b63e542e77827473dcdb8d1eeb","dn":"Never Love a Stranger by Harold Robbins EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7655a17b9c71a6b63e542e77827473dcdb8d1eeb","infoHashBuffer":{"type":"Buffer","data":[118,85,161,123,156,113,166,182,62,84,46,119,130,116,115,220,219,141,30,235]},"name":"Never Love a Stranger by Harold Robbins EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}