{"title":"Lincoln's Last Trial by Dan Abrams, David Fisher EPUB","magnet":"magnet:?xt=urn:btih:766a593636afc2ef52e27069e8618fbae4d8dc83&dn=Lincoln%27s+Last+Trial+by+Dan+Abrams%2C+David+Fisher+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7136053","seeders":"28","leechers":"3","description":"xx\r\n\r\nLincoln&apos;s Last Trial by Dan Abrams, David Fisher EPUB\r\n\r\nThe true story of Abraham Lincoln&#x2019;s last murder trial, a case in which he had a deep personal involvement - and which played out in the nation&#x2019;s newspapers as he began his presidential campaign\r\n\r\nAt the end of the summer of 1859, 22-year-old Peachy Quinn Harrison went on trial for murder in Springfield, Illinois. Abraham Lincoln, who had been involved in more than 3,000 cases - including more than 25 murder trials - during his two-decades-long career, was hired to defend him. This was to be his last great case as a lawyer.\r\n\r\nWhat normally would have been a local case took on momentous meaning. Lincoln&#x2019;s debates with Senator Stephen Douglas the previous fall had gained him a national following, transforming the little-known, self-taught lawyer into a respected politician. He was being urged to make a dark-horse run for the presidency in 1860. Taking this case involved great risk. His reputation was untarnished, but should he lose this trial, should Harrison be convicted of murder, the spotlight now focused so brightly on him might be dimmed. He had won his most recent murder trial with a daring and dramatic maneuver that had become a local legend, but another had ended with his client dangling from the end of a rope.\r\n\r\nThe case posed painful personal challenges for Lincoln. The murder victim had trained for the law in his office, and Lincoln had been his friend and his mentor. His accused killer, the young man Lincoln would defend, was the son of a close friend and loyal supporter. And to win this trial he would have to form an unholy allegiance with a longtime enemy, a revivalist preacher he had twice run against for political office - and who had bitterly slandered Lincoln as an &#x201C;infidel...too lacking in faith&#x201D; to be elected.\r\n\r\n..\r\n\r\nxx","last_updated":"2018-06-13T12:12:40.939Z","parsed":{"xt":"urn:btih:766a593636afc2ef52e27069e8618fbae4d8dc83","dn":"Lincoln's Last Trial by Dan Abrams, David Fisher EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"766a593636afc2ef52e27069e8618fbae4d8dc83","infoHashBuffer":{"type":"Buffer","data":[118,106,89,54,54,175,194,239,82,226,112,105,232,97,143,186,228,216,220,131]},"name":"Lincoln's Last Trial by Dan Abrams, David Fisher EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}