{"title":"8051 Microcontroller – Embedded C and Assembly Language","magnet":"magnet:?xt=urn:btih:76710efb8b5e2d63d5b8a8d331ff6a5db08a818d&dn=8051+Microcontroller+%26ndash%3B+Embedded+C+and+Assembly+Language&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"tuts756","categoryP":"other","categoryS":"other","size":"1354255692","seeders":"12","leechers":"30","description":"Description\r\n\r\nThis course is intended to give you complete details of hardware and software requirement of 8051 microcontroller programming. This course will help you to understand the working of I/O ports, timer, counter, interrupt and serial communication (UART) in microcontroller. You will be able to program 8051 microcontroller using assembly and embedded c language. Course will explain the interfacing of LED, switch, LCD, 7 segment with 8051 microcontroller. This course will also help you to understand process of burning the program into 8051 microcontroller and related terms hence will make you ready to create your own application project using 8051 microcontroller. At the end of course you will be doing two application project on 8051, one is generation of PWM wave to control speed of DC motor and second is wireless control of device using your smartphone and 8051.\r\nThe course makes it so easy to learn 8051 microcontroller programming, you will be building and testing out you own programs in no time. The course is delivered in such a way that anyone who takes the course will have absolutely no problem in understanding all the topics discussed. This course is packed full of practical step by step examples so that you are coding 8051 from day one. Same practical example is discussed in both Embedded C and Assembly language.\r\n\r\nWho is the target audience?\r\n\r\n    Anyone who want to learn 8051 microcontroller programming\r\n\r\nRequirements\r\n\r\n    Basic of Digital Electronics, Basic of C programming language","last_updated":"2018-05-23T12:07:57.244Z","parsed":{"xt":"urn:btih:76710efb8b5e2d63d5b8a8d331ff6a5db08a818d","dn":"8051 Microcontroller &ndash; Embedded C and Assembly Language","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"76710efb8b5e2d63d5b8a8d331ff6a5db08a818d","infoHashBuffer":{"type":"Buffer","data":[118,113,14,251,139,94,45,99,213,184,168,211,49,255,106,93,176,138,129,141]},"name":"8051 Microcontroller &ndash; Embedded C and Assembly Language","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}