{"title":"The Hills Have Spies by Mercedes Lackey EPUB","magnet":"magnet:?xt=urn:btih:76fa6e9bea5ec5e5d4dea17435aba8ce32186b89&dn=The+Hills+Have+Spies+by+Mercedes+Lackey+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1469291","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Hills Have Spies by Mercedes Lackey EPUB\r\n\r\nIn this new series, set in the best-selling world of Valdemar, Heralds Mags and Amily must continue to protect the realm of Valdemar while raising their children and preparing them to follow in their footsteps. \r\n\r\nMags, Herald Spy of Valdemar, and his wife, Amily, are happily married with three kids. The oldest, Justyn, has the Gift of animal Mindspeech - he can talk to animals and persuade them to act as he wishes. Justyn&apos;s dream is to follow in his father&apos;s footsteps as a Herald Spy, but has yet to be Chosen by his horse companion. \r\n\r\nMags is more than happy to teach Justyn all he knows. He regularly trains his children, including Justyn, with tests and exercises, preparing them for the complicated and dangerous lives they will likely lead. Justyn has already held positions in the Royal Palace as a runner and in the kitchen, useful places from which he can learn to listen. As the next stage of Justyn&apos;s training, Mags proposes that Justyn joins a group of traveling players and musicians, to get experience away from home and out in the world. Justyn joins the troupe, and he starts collecting information for his father. And the patterns he finds are unsettling.... \r\n\r\nDuring the troupe&apos;s travels, Justyn witnesses growing rural unrest about an indigenous community of Valdemar, known as Hawkbrothers. When the troupe settles for a season at a fortified manor of a local lord, Justyn watches the unrest grow increasingly hostile. The manor lord dismisses Hawkbrothers as inhuman - and has a local militia to back up his hatred. When a child goes missing, the locals immediately blame Hawkbrothers, and Justyn finds himself in a dangerous position. \r\n\r\nHe enlists the help of a local stray dog, who knows a lot about the town&apos;s goings-on, despite being a bit...odd. Justyn must find the missing child and warn the Hawkbrothers community of the trouble headed their way - before tensions turn deadly.\r\n\r\nxx","last_updated":"2018-06-06T12:01:00.277Z","parsed":{"xt":"urn:btih:76fa6e9bea5ec5e5d4dea17435aba8ce32186b89","dn":"The Hills Have Spies by Mercedes Lackey EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"76fa6e9bea5ec5e5d4dea17435aba8ce32186b89","infoHashBuffer":{"type":"Buffer","data":[118,250,110,155,234,94,197,229,212,222,161,116,53,171,168,206,50,24,107,137]},"name":"The Hills Have Spies by Mercedes Lackey EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}