{"title":"Finish Forty and Home by Phil Scearce EPUB","magnet":"magnet:?xt=urn:btih:76ff5d1f50bfce2d32906693ac7d00f2a5e0dd49&dn=Finish+Forty+and+Home+by+Phil+Scearce+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1507728","seeders":"0","leechers":"0","description":"xx\r\n\r\nFinish Forty and Home by Phil Scearce EPUB\r\n\r\nDuring the early years of World War II in the Pacific theatre, against overwhelming odds, young American airmen flew the longest and most perilous bombing missions of the war. They faced determined Japanese fighters without fighter escort, relentless anti-aircraft fire with no deviations from target, and thousands of miles of over-water flying with no alternative landing sites.\r\n\r\nFinish Forty and Home, by Phil Scearce, is the true story of the men and missions of the 11th Bombardment Group as it fought alone and unheralded in the South Central Pacific, while America had its eyes on the war in Europe. The book opens with Sgt. Herman Scearce, the author&apos;s father, lying about his age to join the Army Air Corps at 16. The narrative follows Scearce through training and into combat with his new crewmates, including pilot Lt. Joe Deasy, whose last-minute transfer from training duty thrusts the new crew into the squadron commander&apos;s role. Inexperienced crews are pressed into combat with navigational training inadequate for the great distances flown over Pacific routes, and losses mount. Finish Forty and Home takes the reader into combat with B-24 Liberator bomber crews facing the perils of long missions against tiny Japanese-held island targets. After new crews assembled into a squadron on Hawaii, they are sent on a mission to bomb Nauru. Soon the squadron moves on to bomb Wake Island, Tarawa, and finally Iwo Jima. These missions bring American forces closer and closer to the Japanese home islands and precede the critical American invasions of Tarawa and Iwo Jima. The 42nd Squadron&apos;s losses through 1943 were staggering: 50 out of 110 airmen killed. Phil Scearce explores the context of the war and sets the stage for these daring missions, revealing the motivations of the men who flew them: to finish forty combat missions and make it home again.\r\n\r\nxx","last_updated":"2018-01-28T12:04:36.560Z","parsed":{"xt":"urn:btih:76ff5d1f50bfce2d32906693ac7d00f2a5e0dd49","dn":"Finish Forty and Home by Phil Scearce EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"76ff5d1f50bfce2d32906693ac7d00f2a5e0dd49","infoHashBuffer":{"type":"Buffer","data":[118,255,93,31,80,191,206,45,50,144,102,147,172,125,0,242,165,224,221,73]},"name":"Finish Forty and Home by Phil Scearce EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}