{"title":"Getting Off by Erica Garza EPUB","magnet":"magnet:?xt=urn:btih:772a94d1757441d1c7c9ff3268eeabb752639ddc&dn=Getting+Off+by+Erica+Garza+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"856930","seeders":"0","leechers":"0","description":"xx\r\n\r\nGetting Off by Erica Garza EPUB\r\n\r\nA courageous account of one woman&apos;s unflinching and ultimately hopeful journey through sex and porn addiction.\r\n\r\nA fixation on porn and orgasm, strings of failed relationships and serial hook-ups with strangers, inevitable blackouts to blunt the shame - these are not things we often hear women share publicly, and not with the candor, eloquence and introspection Erica Garza brings to Getting Off.\r\n\r\nWhat sets this courageous and riveting account apart from your typical misery memoir is the absence of any precipitating trauma beyond the garden variety of hurt we&apos;ve all had to endure in simply becoming a person - reckoning with family, learning to be social, integrating what it means to be sexual. Whatever tenor of violence or abuse Erica&apos;s life took on through her behavior was of her own making, fueled by fear, guilt, self-loathing, self-pity, loneliness, and the hopelessness those feelings brought on as she runs from one side of the world to the other in an effort to break her habits - from East Los Angeles to Hawaii and Southeast Asia, through the brothels of Bangkok and the yoga studios of Bali to disappointing stabs at therapy and 12-steps back home.\r\n\r\nIn this remarkable book, Garza draws an evocative, studied portrait of the anxiety that fuels her obsessions as well as the exhilaration and hope she begins to feel when she suspects she might be free of them. And yet there is no false or prepackaged sense of redemption here. Even her relationship with the man she will ultimately marry seems credibly, painfully rocky as it finds its legs with several false starts. Erica&apos;s increasing sense of self-acceptance and peace by journey&apos;s end feels utterly earned and absent of recovery platitudes.\r\n\r\nIn exploring the cultural taboos surrounding sex and porn from a female perspective, Garza offers a brave and necessary voice to our evolving conversations about addiction and the impact that Internet culture has had on us all.\r\n\r\nxx","last_updated":"2018-03-20T12:02:44.279Z","parsed":{"xt":"urn:btih:772a94d1757441d1c7c9ff3268eeabb752639ddc","dn":"Getting Off by Erica Garza EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"772a94d1757441d1c7c9ff3268eeabb752639ddc","infoHashBuffer":{"type":"Buffer","data":[119,42,148,209,117,116,65,209,199,201,255,50,104,238,171,183,82,99,157,220]},"name":"Getting Off by Erica Garza EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}