{"title":"Fishing Barents Sea","magnet":"magnet:?xt=urn:btih:77b497036247fe002333bb82bc214b01692093e6&dn=Fishing+Barents+Sea&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"freedisk","categoryP":"games","categoryS":"pc","size":"3371853924","seeders":"0","leechers":"0","description":"Take the helm of your very own fishing boat in Fishing: Barents Sea and explore the vastness of the Norwegian sea in search for the best fishing zones. Start with the little boat inherited from your grandfather, catch fish and earn money for upgrades as well as bigger and better boats. Enjoy the beautiful Barents Sea and make your fishing industry dreams come true.\r\n\r\nLearn how to catch different kinds of fish with various fishing equipment on several different boats. Every method is easy to learn, but hard to master &#x2013; time to show what you are made of!\r\n\r\nUse officially licensed Scanmar equipment like door sensors and the TrawlEye to have complete control over your trawl. Upgrade it to make sure you get the biggest catch! But be sure to stay under your yearly fishing quotas, every step and every fishing run needs to be planned. 20 years of weather data recreate a realistic environment for the schools of fish in the Barents Sea, which move according to season and water temperature. It&apos;s up to you to keep track of everything.\r\n\r\nVisit the harbor pub to hire crew members or accept missions. At the port you are also able to repair or upgrade your ships, get a loan from the bank or buy supplies and bait at the shop.\r\n\r\nFreely explore an open world environment which recreates the stunning landscapes of northern Norway. Look for the best fishing zones with the help of your sonar, radar and GPS and catch yourself the biggest profit.\r\n\r\nFeatures:\r\n\r\nUnreal&#x2122; 4 Engine for a beautiful open world environment\r\nA huge map based on real landscapes in Norway\r\nDynamic day, night and moon cycles\r\nSeasonal time effects and shifting weather\r\nSix playable ships\r\nSemi-realistic fishing methods - easy to learn, hard to master\r\nAdvanced fish AI that influences your prey&#x2019;s behavior\r\nIncludes licensed Catch Control Systems by Scanmar and officially licensed Hermes trawler\r\nInventory system to store knives, hooks and binoculars\r\nBeautiful and lively environment with AI ships and fishing boats","last_updated":"2018-10-06T12:08:06.297Z","parsed":{"xt":"urn:btih:77b497036247fe002333bb82bc214b01692093e6","dn":"Fishing Barents Sea","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"77b497036247fe002333bb82bc214b01692093e6","infoHashBuffer":{"type":"Buffer","data":[119,180,151,3,98,71,254,0,35,51,187,130,188,33,75,1,105,32,147,230]},"name":"Fishing Barents Sea","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}