{"title":"I Love Dick - Chris Kraus Epub","magnet":"magnet:?xt=urn:btih:77fbe17422d527be7ee9a072759ba71015bb12c3&dn=I+Love+Dick+-+Chris+Kraus+Epub&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"wormword216","categoryP":"other","categoryS":"e_books","size":"392007","seeders":"18","leechers":"5","description":"I Love Dick - Chris Kraus\r\n\r\n\r\nIn I Love Dick, Chris Kraus, author of Aliens &amp; Anorexia, Torpor, and Video Green, boldly tears away the veil that separates fiction from reality and privacy from self-expression. It&apos;s no wonder that upon its publication in 1997, I Love Dick instantly elicited violent controversies and attracted a host of passionate admirers. The story is gripping enough: in 1994 a married failed independent filmmaker who is about to turn forty falls in love with a well-known art and culture theorist named Dick and endeavors to seduce him with the help of her husband, a defiantly unconventional French academic with whom she hasn&apos;t had sex in a very long time.\r\n\r\nBut when the theorist refuses to answer her letters, husband and wife continue the correspondence for each other instead, imagining the fling the wife wishes to have with Dick. What follows is a breathless pursuit that takes the woman across America and away from her husband and far beyond her original infatuation into a discovery of the transformative power of first-person narrative.\r\n\r\nI Love Dick is a manifesto for a new kind of feminist who isn&apos;t afraid to burn through her own narcissism in order to assume responsibility for herself and for the injustice in the world, and it&apos;s a book you won&apos;t put down until the author&apos;s final, heroic acts of self-revelation and transformation","last_updated":"2018-07-01T12:14:43.890Z","parsed":{"xt":"urn:btih:77fbe17422d527be7ee9a072759ba71015bb12c3","dn":"I Love Dick - Chris Kraus Epub","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"77fbe17422d527be7ee9a072759ba71015bb12c3","infoHashBuffer":{"type":"Buffer","data":[119,251,225,116,34,213,39,190,126,233,160,114,117,155,167,16,21,187,18,195]},"name":"I Love Dick - Chris Kraus Epub","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}