{"title":"Women in Sunlight by Frances Mayes EPUB","magnet":"magnet:?xt=urn:btih:78929fe4b57c209bb96f4c35514b3d70b42626d8&dn=Women+in+Sunlight+by+Frances+Mayes+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"8693737","seeders":"30","leechers":"8","description":"xx\r\n\r\nWomen in Sunlight by Frances Mayes EPUB\r\n\r\nBy the best-selling author of Under the Tuscan Sun, and written with Frances Mayes&#x2019;s trademark warmth, heart, and delicious descriptions of place, food, and friendship, Women in Sunlight is the story of four American strangers who bond in Italy and change their lives over the course of an exceptional year.\r\n\r\nShe watches from her terrazza as the three American women carry their luggage into the stone villa down the hill. Who are they, and what brings them to this Tuscan village so far from home? An expat herself and with her own unfinished story, she can&#x2019;t help but question: will they find what they came for?\r\n\r\nKit Raine, an American writer living in Tuscany, is working on a biography of her close friend, a complex woman who continues to cast a shadow on Kit&#x2019;s own life. Her work is waylaid by the arrival of three women - Julia, Camille, and Susan - all of whom have launched a recent and spontaneous friendship that will uproot them completely and redirect their lives. Susan, the most adventurous of the three, has enticed them to subvert expectations of staid retirement by taking a lease on a big, beautiful house in Tuscany. Though novices in a foreign culture, their renewed sense of adventure imbues each of them with a bright sense of bravery, a gusto for life, and a fierce determination to thrive. But how? With Kit&#x2019;s friendship and guidance, the three friends launch themselves into Italian life, pursuing passions long-forgotten - and with drastic and unforeseeable results.\r\n\r\nxx","last_updated":"2018-04-10T17:26:49.580Z","parsed":{"xt":"urn:btih:78929fe4b57c209bb96f4c35514b3d70b42626d8","dn":"Women in Sunlight by Frances Mayes EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"78929fe4b57c209bb96f4c35514b3d70b42626d8","infoHashBuffer":{"type":"Buffer","data":[120,146,159,228,181,124,32,155,185,111,76,53,81,75,61,112,180,38,38,216]},"name":"Women in Sunlight by Frances Mayes EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}