{"title":"The Black Market by Kiki Swinson EPUB","magnet":"magnet:?xt=urn:btih:78e05ec2f3e69a49f907935729473c5239e0160e&dn=The+Black+Market+by+Kiki+Swinson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"726331","seeders":"18","leechers":"1","description":"xx\r\n\r\nThe Black Market by Kiki Swinson EPUB\r\n\r\nKiki Swinson&apos;s best-selling &quot;tension-packed&quot; (Library Journal) and &quot;unrelenting&quot; (Publishers Weekly) novels burn with extraordinary characters, triple-down twists - and a raw portrait of Southern life only she can deliver. Now she turns up the heat as a young woman cashes in on a sure thing - only to find some addictions are always killer.\r\n\r\nBreak the rules: At first, med student Misty Heiress just wants to help. With her cousin Jillian in constant pain, and the doctor refusing to prescribe, Misty steals opioids from the Virginia Beach pharmacy where she works. But when Jillian starts reselling them to local dealers and gets big money, Misty grabs an unbelievable opportunity to get out of crushing debt - and fulfill all of her and Jillian&apos;s dreams.\r\n\r\nLive the dream: Soon Misty&apos;s boss, Sanjay, learns the truth and wants in. In no time, their illegal business dominates the street - and racks up a fortune. But when demand quickly outstrips supply, Sanjay way overplays his hand - and the Feds come calling.\r\n\r\nPay the price: Now Sanjay is out to pin everything on Misty and walk away scot-free. Jillian is cracking under the strain of drug addiction. And as ruthless competition aims to take Misty and her accomplices out for good, deception, betrayal, and killer secrets may not be enough to keep them all from paying the ultimate price.\r\n\r\nxx","last_updated":"2018-11-28T12:17:13.227Z","parsed":{"xt":"urn:btih:78e05ec2f3e69a49f907935729473c5239e0160e","dn":"The Black Market by Kiki Swinson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"78e05ec2f3e69a49f907935729473c5239e0160e","infoHashBuffer":{"type":"Buffer","data":[120,224,94,194,243,230,154,73,249,7,147,87,41,71,60,82,57,224,22,14]},"name":"The Black Market by Kiki Swinson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}