{"title":"Sifted by Wayne Cordeiro EPUB","magnet":"magnet:?xt=urn:btih:78e2ea3f07c2e8ec232495f2f02b92245be5de70&dn=Sifted+by+Wayne+Cordeiro+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2063387","seeders":"20","leechers":"0","description":"xx\r\n\r\nSifted: Pursuing Growth through Trials, Challenges, and Disappointments by Wayne Cordeiro EPUB\r\n\r\nPlanting and leading a new church is not easy. There are the inevtiable setbacks and challenges that come with launching anything new. And the process will test and try a leader&#x2019;s faith, as they face discouragment, loneliness, and failure. In this book, pastor and seasoned chuch leader Wayne Cordeiro speaks the truth in love, offering wisdom and insight to prepare leaders as they face the difficulties and hardships of church planting, while providing encouragement and inspiration for the journey.\r\n\r\nSifted is based on Jesus&#x2019; encouragement to Peter in Luke 22 to keep his faith and minister to others from his weakness. An experienced practitioner, Wayne shares the things he wishes he&#x2019;d known when he was starting a new church. With additional stories from other prominent, seasoned leaders, each chapter includes a thought-provoking challenge question to develop a heart that is surrendered to God, focused on &#x201C;being and becoming&#x201D; versus &#x201C;doing and accomplishing.&#x201D; Wayne writes about a healthy integration and balance of personal care and leadership amidst the difficulties of the church-planting journey.\r\n\r\nLoneliness and discouragement are normal in church planting, but God cares more about our journey of faith and who we are becoming than our worldly accomplishments and the churches we build. Church planting is an ongoing process of surrender, personal growth, and character development.\r\n\r\n..\r\n\r\nxx","last_updated":"2018-09-22T12:38:42.481Z","parsed":{"xt":"urn:btih:78e2ea3f07c2e8ec232495f2f02b92245be5de70","dn":"Sifted by Wayne Cordeiro EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"78e2ea3f07c2e8ec232495f2f02b92245be5de70","infoHashBuffer":{"type":"Buffer","data":[120,226,234,63,7,194,232,236,35,36,149,242,240,43,146,36,91,229,222,112]},"name":"Sifted by Wayne Cordeiro EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}