{"title":"The Dichotomy of Leadership by Jocko Willink, Leif Babin EPUB","magnet":"magnet:?xt=urn:btih:79433ca81175ae15a0695110181ae317cce25256&dn=The+Dichotomy+of+Leadership+by+Jocko+Willink%2C+Leif+Babin+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"18038748","seeders":"40","leechers":"5","description":"xx\r\n\r\nThe Dichotomy of Leadership by Jocko Willink, Leif Babin EPUB\r\n\r\nThe importance of balance as a leader by the number-one New York Times best-selling authors of Extreme Ownership.  \r\n\r\nEvery leader must be ready and willing to take charge, to make hard, crucial calls for the good of the team and the mission. Something much more difficult to understand is that in order to be a good leader, one must also be a good follower. This is a dichotomy - a Dichotomy of Leadership. It is, as authors Jocko Willink and Leif Babin explained in their best-selling first book, Extreme Ownership, &#x201C;Simple, Not Easy&#x201D;.\r\n\r\nNow, in The Dichotomy of Leadership, the authors explain the power inherent in the recognition of the fine line that leaders must walk, balancing between two seemingly opposite inclinations. It is with the knowledge and understanding of this balance that a leader can most effectively lead, accomplish the mission, and achieve the goal of every leader and every team: victory. \r\n\r\nUsing examples from the authors&apos; combat and training experience in the SEAL Teams and then showing how each lesson applies to business and in life, Willink and Babin reveal how the use of seemingly opposite principles - leading and following, focusing and detaching, being both aggressive and prudent - require skill, awareness, understanding, and dexterity, all attributes that can be honed. These dichotomies are inherent in many of the concepts introduced in Extreme Ownership and integral to their proper implementation and effectiveness. Dichotomy is essential reading for anyone looking to lead and win.\r\n\r\nxx","last_updated":"2018-09-27T12:29:55.486Z","parsed":{"xt":"urn:btih:79433ca81175ae15a0695110181ae317cce25256","dn":"The Dichotomy of Leadership by Jocko Willink, Leif Babin EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"79433ca81175ae15a0695110181ae317cce25256","infoHashBuffer":{"type":"Buffer","data":[121,67,60,168,17,117,174,21,160,105,81,16,24,26,227,23,204,226,82,86]},"name":"The Dichotomy of Leadership by Jocko Willink, Leif Babin EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}