{"title":"Building the Great Society by Joshua Zeitz EPUB","magnet":"magnet:?xt=urn:btih:79dc1923b187dc9791e030197255bdac0b55d5dc&dn=Building+the+Great+Society+by+Joshua+Zeitz+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1096537","seeders":"0","leechers":"0","description":"xx\r\n\r\nBuilding the Great Society by Joshua Zeitz EPUB\r\n\r\nThe author of Lincoln&apos;s Boys takes us inside Lyndon Johnson&apos;s White House to show how the legendary Great Society programs were actually put into practice: Team of Rivals for LBJ. The personalities behind every burst of 1960s liberal reform - from civil rights and immigration reform, to Medicare and Head Start - and what we&apos;ll lose if those programs are dismantled.\r\n\r\nLBJ&apos;s towering political skills and his ambitious slate of liberal legislation are the stuff of legend: the Civil Rights Act of 1964, the Voting Rights Act of 1965, Medicare, Medicaid, Head Start, and environmental reform. But what happened after the bills passed? One man could not and did not go it alone. Joshua Zeitz reanimates the creative and contentious atmosphere inside Johnson&apos;s White House as a talented and energetic group of advisers made LBJ&apos;s vision a reality. They desegregated public and private institutions throughout one third of the United States; built Medicare and Medicaid from the ground up in one year; launched federal funding for public education; provided food support for millions of poor children and adults; and launched public television and radio, all in the space of five years, even as Vietnam strained the administration&apos;s credibility and budget.\r\n\r\nBill Moyers, Jack Valenti, Joe Califano, Harry McPherson and the other staff members who comprised LBJ&apos;s inner circle were men as pragmatic and ambitious as Johnson, equally skilled in the art of accumulating power or throwing a sharp elbow. Building the Great Society is the story of how one of the most competent White House staffs in American history - serving one of the most complicated presidents ever to occupy the Oval Office - fundamentally changed everyday life for millions of citizens and forged a legacy of compassionate and interventionist government.\r\n\r\nxx","last_updated":"2018-05-15T12:03:32.850Z","parsed":{"xt":"urn:btih:79dc1923b187dc9791e030197255bdac0b55d5dc","dn":"Building the Great Society by Joshua Zeitz EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"79dc1923b187dc9791e030197255bdac0b55d5dc","infoHashBuffer":{"type":"Buffer","data":[121,220,25,35,177,135,220,151,145,224,48,25,114,85,189,172,11,85,213,220]},"name":"Building the Great Society by Joshua Zeitz EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}