{"title":"Love, Marilyn (2012) 720p X.264 HDTV (moviesbyrizzo upload)","magnet":"magnet:?xt=urn:btih:7ac3610be7ff25bf240fd00325c15fae9074e957&dn=Love%2C+Marilyn+%282012%29+720p+X.264+HDTV+%28moviesbyrizzo+upload%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"moviesbyrizzo","categoryP":"video","categoryS":"hd___tv_shows","size":"2256462822","seeders":"7","leechers":"4","description":" <a href=\"https://www.imdb.com/title/tt2077747/\" rel=\"nofollow\" target=\"_NEW\">https://www.imdb.com/title/tt2077747/</a>\r\n\r\n1280 X 720 H.264 video (with added chapters file from DVD disc)\r\n384k 6ch Dolby AC3 audio (extracted from DVD disc to replace original 224k AAC)\r\n\r\nThis video aired on Ontario&apos;s (Canada) TVO channel and premiered \r\non HBO in USA\r\n\r\nLove, Marilyn is a documentary of sorts on the life and career of beautiful\r\nMs. Marilyn Monroe in The good old United states of America which has also \r\nyielded us such beautiful and charming spirits along the way as the likes of \r\nMs. Melanie Griffith, Jessica Lange, Michelle Pfeiffer and Leann rimes. (Not \r\nto mention Hillary Clinton especially in years gone by along with even Martha\r\nStewart too, in spirit I would say of these exceptional types in our midst too)\r\n\r\nNot many remaining on the planet today have their spirit, a few &quot;actors&quot; are used in this documentary video to mimic &quot;Marilyn Monroe&quot; and others mentioned in her diaries which they read from in sections of the video for some perception of\r\nperforming equally in the minds of some viewers perhaps. What a monumental farce.\r\n\r\nThe world will never be worth existing in for men of merit I say, if women of the spirit of these sort of gals I mention (supreme examples on the planet and all\r\nfrom the US in days gone by it seems sadly right now) aren&apos;t rejuvenated in being\r\ndominant once more on the public stage and in our minds and dreams - forever more.\r\n\r\nIt is noted in the video that Marilyn was &quot;taken&quot; by the unworthy (it would\r\nappear) Hugh Heffner at Playboy magazine who launched his magazine and fortune\r\non her back without giving her a dime, or even so much as a &quot;thank you&apos; we are told. How shameful. Gals of such precious spirit should never be taken advantage\r\nof in this respect - as they are in fact what true decency on the planet is all\r\nabout I fear to add, yet without hesitation evermore.\r\n\r\nKindly seed this video about this dear gal even if its just for the scenes \r\nfeaturing her and no one else that&apos;s shown.\r\n\r\nMichael Rizzo Chessman\r\n(moviesbyrizzo documentaries uploads)","last_updated":"2018-10-03T12:15:25.608Z","parsed":{"xt":"urn:btih:7ac3610be7ff25bf240fd00325c15fae9074e957","dn":"Love, Marilyn (2012) 720p X.264 HDTV (moviesbyrizzo upload)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7ac3610be7ff25bf240fd00325c15fae9074e957","infoHashBuffer":{"type":"Buffer","data":[122,195,97,11,231,255,37,191,36,15,208,3,37,193,95,174,144,116,233,87]},"name":"Love, Marilyn (2012) 720p X.264 HDTV (moviesbyrizzo upload)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}