{"title":"A Guide to the Good Life by William B. Irvine EPUB","magnet":"magnet:?xt=urn:btih:7ae97d71ebb036300c960849cabdd130a29bf7d6&dn=A+Guide+to+the+Good+Life+by+William+B.+Irvine+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"516416","seeders":"34","leechers":"7","description":"xx\r\n\r\nA Guide to the Good Life by William B. Irvine EPUB\r\n\r\nOne of the great fears many of us face is that despite all our effort and striving, we will discover at the end that we have wasted our life. In A Guide to the Good Life, William B. Irvine plumbs the wisdom of Stoic philosophy, one of the most popular and successful schools of thought in ancient Rome, and shows how its insight and advice are still remarkably applicable to modern lives. In A Guide to the Good Life, Irvine offers a refreshing presentation of Stoicism, showing how this ancient philosophy can still direct us toward a better life.\r\n\r\nUsing the psychological insights and the practical techniques of the Stoics, Irvine offers a roadmap for anyone seeking to avoid the feelings of chronic dissatisfaction that plague so many of us. Irvine looks at various Stoic techniques for attaining tranquility and shows how to put these techniques to work in our own life. As he does so, he describes his own experiences practicing Stoicism and offers valuable first-hand advice for anyone wishing to live better by following in the footsteps of these ancient philosophers. Readers learn how to minimize worry, how to let go of the past and focus our efforts on the things we can control, and how to deal with insults, grief, old age, and the distracting temptations of fame and fortune. We learn from Marcus Aurelius the importance of prizing only things of true value, and from Epictetus we learn how to be more content with what we have.\r\n\r\nFinally, A Guide to the Good Life shows readers how to become thoughtful observers of their own lives. If we watch ourselves as we go about our daily business and later reflect on what we saw, we can better identify the sources of distress and eventually avoid that pain in our life. By doing this, the Stoics thought, we can hope to attain a truly joyful life.\r\n\r\nxx","last_updated":"2018-01-26T12:05:09.066Z","parsed":{"xt":"urn:btih:7ae97d71ebb036300c960849cabdd130a29bf7d6","dn":"A Guide to the Good Life by William B. Irvine EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7ae97d71ebb036300c960849cabdd130a29bf7d6","infoHashBuffer":{"type":"Buffer","data":[122,233,125,113,235,176,54,48,12,150,8,73,202,189,209,48,162,155,247,214]},"name":"A Guide to the Good Life by William B. Irvine EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}