{"title":"Http Master Pro 3.9.6","magnet":"magnet:?xt=urn:btih:7bbf95de908c7263f78ee0d1fcba51f88682aa0d&dn=Http+Master+Pro+3.9.6&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"krzysx","categoryP":"applications","categoryS":"windows","size":"6328813","seeders":"0","leechers":"0","description":"A useful application for the web developers who need to automate the web applications testing by requesting multiple resources from a specified website It&apos;s only natural for professional web developers to need advanced testing tools for their applications, whether we are talking about a website or a web-based application. With a feature-rich feature set, HttpMaster Professional Edition aims to meet the requirements of many as far as application testing is concerned.\r\nHttpMaster project\r\nWhen working with HttpMaster, you will most of the time manage HttpMaster project properties and properties of the request items contained inside the project. Project properties offer global options to customize internet requests that will be executed; changes to this properties affect all project request items.\r\nHttpMaster project can be saved to disk as a file with &apos;hmpr&apos; extension for later reuse. Project file is stored internally in XML format.\r\n\r\nBroad set of http properties\r\nHttpMaster project contains a lot of options which can be used to fine-tune generated http requests. These include request encoding, global URL and query string, global http request headers, and couple of advanced properties like URL encoding and ability to completely disable execution data storing which can be useful if you want executions to be completed as fast as possible without collecting any data.\r\n\r\nParameters\r\nIn project properties you can also define parameters of different data types and different generation types. Parameters enable you to include dynamic data with the request items; this can be useful to generate multiple requests based on the parameter data or to create global reusable values.\r\nAll defined parameters can be used with request item properties, for example, with URL of the request item.\r\n\r\nResponse data validation\r\nBy default HttpMaster validates each executed request with default system validation. Default system validation monitors returned http status codes and determines execution result according to this status code. However, you can define custom validations in project properties and then use this project validations to define custom validation logical expression for each request item. There are different types of custom validations available; majority of them perform some validation on the response body","last_updated":"2018-05-21T12:03:09.633Z","parsed":{"xt":"urn:btih:7bbf95de908c7263f78ee0d1fcba51f88682aa0d","dn":"Http Master Pro 3.9.6","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7bbf95de908c7263f78ee0d1fcba51f88682aa0d","infoHashBuffer":{"type":"Buffer","data":[123,191,149,222,144,140,114,99,247,142,224,209,252,186,81,248,134,130,170,13]},"name":"Http Master Pro 3.9.6","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}