{"title":"The Personality Brokers: The Strange History of Myers-Briggs and","magnet":"magnet:?xt=urn:btih:7c001aef1a2cba84319212743f0764db7fe13748&dn=The+Personality+Brokers%3A+The+Strange+History+of+Myers-Briggs+and&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Horisarte","categoryP":"other","categoryS":"e_books","size":"9316281","seeders":"0","leechers":"0","description":"The Personality Brokers: The Strange History of Myers-Briggs and the Birth of Personality Testing, epub, 2018\r\n\r\nThe Myers-Briggs Type Indicator is the most popular personality test in the world. It is used regularly by Fortune 500 companies, universities, hospitals, churches, and the military. Its language of personality types--extraversion and introversion, sensing and intuiting, thinking and feeling, judging and perceiving--has inspired television shows, online dating platforms, and Buzzfeed quizzes. Yet despite the test&apos;s widespread adoption, experts in the field of psychometric testing, a $2 billion industry, have struggled to validate its results--no less account for its success. How did Myers-Briggs, a homegrown multiple choice questionnaire, infiltrate our workplaces, our relationships, our Internet, our lives?\r\n\r\nFirst conceived in the 1920s by the mother-daughter team of Katherine Briggs and Isabel Briggs Myers, a pair of devoted homemakers, novelists, and amateur psychoanalysts, Myers-Briggs was designed to bring the gospel of Carl Jung to the masses. But it would take on a life entirely its own, reaching from the smoke-filled boardrooms of mid-century New York to Berkeley, California, where it was administered to some of the twentieth century&apos;s greatest creative minds. It would travel across the world to London, Zurich, Cape Town, Melbourne, and Tokyo, until it could be found just as easily in elementary schools, nunneries, and wellness retreats as in shadowy political consultancies and on social networks.\r\n\r\nDrawing from original reporting and never-before-published documents, The Personality Brokers takes a critical look at the personality indicator that became a cultural icon. Along the way it examines nothing less than the definition of the self--our attempts to grasp, categorize, and quantify our personalities. Surprising and absorbing, the book, like the test at its heart, considers the timeless question: What makes you, you?\r\n <a href=\"\nhttps://www.amazon.co.uk/Personality-Brokers-Strange-History-Myers-Briggs/dp/0385541902\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.amazon.co.uk/Personality-Brokers-Strange-History-Myers-Briggs/dp/0385541902</a>","last_updated":"2018-09-21T12:01:33.446Z","parsed":{"xt":"urn:btih:7c001aef1a2cba84319212743f0764db7fe13748","dn":"The Personality Brokers: The Strange History of Myers-Briggs and","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7c001aef1a2cba84319212743f0764db7fe13748","infoHashBuffer":{"type":"Buffer","data":[124,0,26,239,26,44,186,132,49,146,18,116,63,7,100,219,127,225,55,72]},"name":"The Personality Brokers: The Strange History of Myers-Briggs and","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}