{"title":"Liberty's First Crisis by Charles Slack EPUB","magnet":"magnet:?xt=urn:btih:7c21f34b3cdb1e26b2cc1d8f38d2a9d12b928d04&dn=Liberty%27s+First+Crisis+by+Charles+Slack+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"870486","seeders":"0","leechers":"0","description":"xx\r\n\r\nLiberty&apos;s First Crisis by Charles Slack EPUB\r\n\r\nWhen the United States government passed the Bill of Rights in 1791, its uncompromising protection of speech and of the press were unlike anything the world had ever seen before. But by 1798, the once-dazzling young republic of the United States was on the verge of collapse: partisanship gripped the weak federal government, British seizures threatened American goods and men on the high seas, and war with France seemed imminent as its own democratic revolution deteriorated into terror. Suddenly, the First Amendment, which protected harsh commentary of the weak government, no longer seemed as practical. So that July, President John Adams and the Federalists in control of Congress passed an extreme piece of legislation that made criticism of the government and its leaders a crime punishable by heavy fines and jail time. In Liberty&apos;s First Crisis, writer Charles Slack tells the story of the 1798 Sedition Act, the crucial moment when high ideals met real-world politics and the country&apos;s future hung in the balance.\r\n\r\nFrom a loudmouth in a bar to a firebrand politician to Benjamin Franklin&apos;s own grandson, those victimized by the Sedition Act were as varied as the country&apos;s citizenry. But Americans refused to let their freedoms be so easily dismissed: they penned fiery editorials, signed petitions, and raised &quot;liberty poles,&quot; while Vice President Thomas Jefferson and James Madison drew up the infamous Kentucky and Virginia Resolutions, arguing that the Federalist government had gone one step too far. Liberty&apos;s First Crisis vividly unfolds these pivotal events in the early life of the republic, as the Founding Fathers struggled to define America off the page and preserve the freedoms they had fought so hard to create.\r\n\r\nxx","last_updated":"2018-01-26T12:00:55.160Z","parsed":{"xt":"urn:btih:7c21f34b3cdb1e26b2cc1d8f38d2a9d12b928d04","dn":"Liberty's First Crisis by Charles Slack EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7c21f34b3cdb1e26b2cc1d8f38d2a9d12b928d04","infoHashBuffer":{"type":"Buffer","data":[124,33,243,75,60,219,30,38,178,204,29,143,56,210,169,209,43,146,141,4]},"name":"Liberty's First Crisis by Charles Slack EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}