{"title":"Michel Houellebecq - Novels, Poetry and Non-Fiction (10 books)","magnet":"magnet:?xt=urn:btih:7c267efb7c5b80c34e53412d8a46a56895718d30&dn=Michel+Houellebecq+-+Novels%2C+Poetry+and+Non-Fiction+%2810+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"29790563","seeders":"17","leechers":"7","description":"\nMICHEL HOUELLEBECQ (b. 1956) is a French writer, satirist, and provocateur.  He is one of the best-known, if not always best-loved, French novelists of the early 21st century.  A number of critics have labeled his work as &quot;vulgar,&quot; &quot;pamphlet literature&quot; and &quot;pornography&quot;; he has been accused of obscenity, racism, misogyny and Islamophobia.\n\nHouellebecq gained international attention with the publication of THE ELEMENTARY PARTICLES / ATOMISED (1998), which became an instant &quot;nihilistic classic&quot;.  In it he presented two half brothers who were abandoned by their parents in childhood.  Bruno is driven by an insatiable sexual appetite, while Michel, a scientist, avoids the issue of any attachment whatsoever by focusing his attention on the cloning of human life.  The book&#x2019;s combination of reactionary political views and pornographic passages, as well as its misogynistic plot and scathing indictment of the 1960s &quot;free love&#x201D; generation that produced these unhealthy human specimens, made it the source of much controversy.  New York Times critic Michiko Kakutani considered it &quot;a deeply repugnant read,&#x201D; but it won the 2002 IMPAC Dublin Literary Award.\n\nHis subsequent novels include LANZAROTE (2000), an attack on the European vacation practices; PLATFORM (2001), a consideration of sex tourism in which he drew a spiteful and savage portrait of his mother, and was accused of inciting racial and religious hatred; and THE POSSIBILITY OF AN ISLAND (2005), a bleak futuristic tale about the implications and possibilities of reproduction by cloning.  THE MAP AND THE TERRITORY (2010), which features a character by the name of Houellebecq, won the 2010 Prix Goncourt.  His most recent novel, SUBMISSION (2015), is a dystopian work of speculative fiction in which France has become an Islamic state.  It was an instant bestseller in Europe, in part because, by a macabre coincidence, it was released on the day of the Charlie Hebdo shooting.\n\nUNRECONCILED (2017), a selection of poems chosen from four collections, shines a fresh light on Houellebecq and emphasises the radical singularity of his work.  Drawing on similar themes as his novels, the collection is a journey into the depths of individual experience and universal passions.  PUBLIC ENEMIES (2008) documented a freewheeling exchange of opinions&#x2014;via e-mail&#x2014;between Houellebecq and French public intellectual Bernard-Henri L&#xE9;vy on a variety of subjects, including what they considered undeserved criticism.\n\n\nThe following books are in ePUB format unless otherwise noted:\n\n\n                                == FICTION ==\n\n* Atomised (Vintage, 2001).  Frank Wynne, trans. -- PDF (by @Mohamed5438)\n* Elementary Particles, The (Knopf, 2000).  Frank Wynne, trans.\n* Lanzarote (Vintage, 2004).  Frank Wynne, trans.\n* Map and the Territory, The (Knopf, 2012).  Gavin Bowd, trans.\n* Platform (Knopf, 2003).  Frank Wynne, trans. -- ePUB + PDF (by @Mohamed5438)\n* Possibility of an Island, The (Knopf, 2006).   Gavin Bowd, trans.\n* Submission (Heinemann, 2015).  Lorin Stein, trans.\n* Whatever (Serpents Tail, 1998). Hammond, trans. -- ePUB + PDF (by @Mohamed5438)\n\n\n                                 == POETRY ==\n\n* Unreconciled: Poems 1991-2013 (Heinemann, 2017).  Bilingual ed.  Gavin Bowd, trans.\n\n\n                               == NON-FICTION ==\n\n* Public Enemies [with B.-Henri L&#xE9;vy] (Random, 2011).  Frendo &amp; Wynne, trans.\n\n____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-10-16T12:20:10.035Z","parsed":{"xt":"urn:btih:7c267efb7c5b80c34e53412d8a46a56895718d30","dn":"Michel Houellebecq - Novels, Poetry and Non-Fiction (10 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7c267efb7c5b80c34e53412d8a46a56895718d30","infoHashBuffer":{"type":"Buffer","data":[124,38,126,251,124,91,128,195,78,83,65,45,138,70,165,104,149,113,141,48]},"name":"Michel Houellebecq - Novels, Poetry and Non-Fiction (10 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}