{"title":"The Death of Cancer by Vincent T. DeVita Jr. EPUB","magnet":"magnet:?xt=urn:btih:7c792e143f62742c79a0f3cd580e577c705fd198&dn=The+Death+of+Cancer+by+Vincent+T.+DeVita+Jr.+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3700795","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Death of Cancer by Vincent T. DeVita Jr. EPUB\r\n\r\nAter 50 years on the front lines of medicine, a pioneering oncologist reveals why the war on cancer is winnable - and how we can get there.\r\n\r\nCancer touches everybody&apos;s life in one way or another. But most of us know very little about how the disease works, why we treat it the way we do, and the personalities whose dedication got us where we are today. For 50 years, Dr. Vincent T. DeVita, Jr., has been one of those key players: He has held just about every major position in the field, and he developed the first successful chemotherapy treatment for Hodgkin&apos;s lymphoma, a breakthrough the American Society of Clinical Oncologists has called the top research advance in half a century of chemotherapy.\r\n\r\nAs one of oncology&apos;s leading figures, DeVita knows what cancer looks like from the lab bench and the bedside. The Death of Cancer is his illuminating and deeply personal look at the science and the history of one of the world&apos;s most formidable diseases. In DeVita&apos;s hands, even the most complex medical concepts are comprehensible.\r\n\r\nCowritten with DeVita&apos;s daughter, the science writer Elizabeth DeVita-Raeburn, The Death of Cancer is also a personal tale about the false starts and major breakthroughs, the strong-willed oncologists who clashed with conservative administrators (and one another), and the courageous patients whose willingness to test cutting-edge research helped those oncologists find potential treatments. An emotionally compelling and informative read, The Death of Cancer is also a call to arms. DeVita believes that we&apos;re well on our way to curing cancer, but there are things we need to change in order to get there. Mortality rates are declining, but America&apos;s cancer patients are still being shortchanged - by timid doctors, by misguided national agendas, by compromised bureaucracies, and by a lack of access to information about the strengths and weaknesses of the nation&apos;s cancer centers.\r\n\r\nxx","last_updated":"2018-03-13T12:04:14.784Z","parsed":{"xt":"urn:btih:7c792e143f62742c79a0f3cd580e577c705fd198","dn":"The Death of Cancer by Vincent T. DeVita Jr. EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7c792e143f62742c79a0f3cd580e577c705fd198","infoHashBuffer":{"type":"Buffer","data":[124,121,46,20,63,98,116,44,121,160,243,205,88,14,87,124,112,95,209,152]},"name":"The Death of Cancer by Vincent T. DeVita Jr. EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}