{"title":"GingerPatch - Ava Little (Banging Your Sons Redhead Friend) NEW ","magnet":"magnet:?xt=urn:btih:7ceabc37d864b28fc8192200fdc25d62555b698a&dn=GingerPatch+-+Ava+Little+%28Banging+Your+Sons+Redhead+Friend%29+NEW+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"270437040","seeders":"0","leechers":"0","description":"Ava Little is a fiery redhead, using a dating app to hunt down a good fuck. She connects with a dude named John and agrees to come over. While looking around his house, she comes across a photo of Johns son and recognizes him from school. Turns out they were in the same class, and that puts their age difference into perspective for Ava. He could literally be her father and that thought just gets her tight, teen pussy juicy and moist. One day afterschool, Ava comes over to Johns house while his son is out and hes home alone. He s his pants and she s to her knees, her eyes taking in his big dick before taking it down her throat. They lose all their clothes and never even make it to the bedroom. Ava is getting fucked good from behind and struggling to keep herself from moaning too loud. Shes so into it, the sudden loud knock at the door really startles her. His son is home! John opens the door a crack to answer his son, but Ava stays out of sight. Shes so turned on by thought of him opening the door and her getting fucked by a father-son tag team, that she gets on her knees behind the door and starts sucking his cock. She can taste herself on his dick and she loves it. John is so turned on after he shuts the door and his son is gone, he takes his rock hard cock and gives Ava the very best fuck of her life before blowing his load all over her fair skin.\r\nTags: Blowjob, Deepthroat, Doggystyle, Facial, Fingering, Hardcore, Redhead, Short Hair, Slutty, Straight, Teen\r\n <a href=\"\nhttp://imgdone.com/image/XisUJ\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/XisUJ</a>\r\n <a href=\"\nhttp://imgdone.com/image/XyXTL\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/XyXTL</a>","last_updated":"2018-05-22T12:06:37.473Z","parsed":{"xt":"urn:btih:7ceabc37d864b28fc8192200fdc25d62555b698a","dn":"GingerPatch - Ava Little (Banging Your Sons Redhead Friend) NEW ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7ceabc37d864b28fc8192200fdc25d62555b698a","infoHashBuffer":{"type":"Buffer","data":[124,234,188,55,216,100,178,143,200,25,34,0,253,194,93,98,85,91,105,138]},"name":"GingerPatch - Ava Little (Banging Your Sons Redhead Friend) NEW ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}