{"title":"Obeying Evil by Ryan Green EPUB","magnet":"magnet:?xt=urn:btih:7da9651cecd042c9970683303e351362a9d3c493&dn=Obeying+Evil+by+Ryan+Green+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"275761","seeders":"0","leechers":"0","description":"xx\r\n\r\nObeying Evil by Ryan Green EPUB\r\n\r\nObeying Evil presents the shocking true story of Ronald Gene Simmons and the most disturbing family killing spree in the United States. Over the course of a week in 1987, he murdered 14 members of his own family, a former co-worker, and a stranger.\r\n\r\nIn 1979, Simmons retired as an Air Force Master Sergeant following 20 years of service. The instability that followed his military days exacerbated his desire for control over his family. Simmons used intimidation, humiliation, and violence to assert dominance over all but one of his family members. He allowed a softer side to surface for his favorite daughter, Shelia, whom he forced into an incestuous relationship, and eventually fathered her child.\r\n\r\nHis need for total control led to isolation within his family and an inability to hold down a job. His frustration grew to untold levels when Sheila left the family home and married another man. With his plans in ruin and his grip softening, Simmons surprisingly supported his family&apos;s desire for a big Christmas celebration. The stage was set for a heartwarming reunion, but he had laid a very different set of plans.\r\n\r\nObeying Evil portrays the Mockingbird Hill Massacre from the perspective of Ronald Gene Simmons. It&apos;s a shocking true story about dominance, intimidation, and extreme violence.\r\n\r\nIf you are especially sensitive to accounts of the suffering of children, it might be advisable not to read any further.\r\n\r\nIf, however, you seek to understand the darker side of human nature by coming face to face with it, then this book is written for you.\r\n\r\nxx","last_updated":"2018-01-18T18:58:41.289Z","parsed":{"xt":"urn:btih:7da9651cecd042c9970683303e351362a9d3c493","dn":"Obeying Evil by Ryan Green EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7da9651cecd042c9970683303e351362a9d3c493","infoHashBuffer":{"type":"Buffer","data":[125,169,101,28,236,208,66,201,151,6,131,48,62,53,19,98,169,211,196,147]},"name":"Obeying Evil by Ryan Green EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}