{"title":"Lullaby Road by James Anderson EPUB","magnet":"magnet:?xt=urn:btih:7df1d37ee851de61c9373fcce815e2a6ff81cb8f&dn=Lullaby+Road+by+James+Anderson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1820246","seeders":"28","leechers":"3","description":"xx\r\n\r\nLullaby Road by James Anderson EPUB\r\n\r\nBen Jones, protagonist of the glowingly reviewed Never-Open Desert Diner, returns in a devastatingly powerful literary crime novel about parenthood, loss, and the desert in winter. Winter has come to Highway 117, a remote road through the Utah desert trafficked only by oddballs, fugitives, and those looking to escape the world. So when local truck driver Ben Jones finds an abandoned, mute Hispanic child at a lonely gas station along his route, far from any semblance of proper civilization, he knows something has gone terribly awry. With the help of his eccentric neighbors, Ben sets out to help the kid and learn the truth. In the process he makes new friends and loses old ones, finds himself in mortal danger, and uncovers buried secrets far more painful than he could have imagined.\r\n\r\nAuthor bio: James Anderson was born in Seattle, Washington, and grew up in the Pacific Northwest. He is a graduate of Reed College and received his MFA in creative writing from Pine Manor College. His first novel was The Never-Open Desert Diner. His short fiction, poetry, essays, and reviews have appeared in many magazines, including The Bloomsbury Review, New Letters, Solstice, Northwest Review, Southern Humanities Review, and others, and he previously served as the publisher and editor in chief of Breitenbush Books. He currently divides his time between Colorado and Oregon.\r\n\r\nxx","last_updated":"2018-01-18T19:01:02.159Z","parsed":{"xt":"urn:btih:7df1d37ee851de61c9373fcce815e2a6ff81cb8f","dn":"Lullaby Road by James Anderson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7df1d37ee851de61c9373fcce815e2a6ff81cb8f","infoHashBuffer":{"type":"Buffer","data":[125,241,211,126,232,81,222,97,201,55,63,204,232,21,226,166,255,129,203,143]},"name":"Lullaby Road by James Anderson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}