{"title":"Sir Thomas Malory: The Critical Heritage","magnet":"magnet:?xt=urn:btih:7dffb140c1c97cd6fb21e39721e1e409a72ed8d3&dn=Sir+Thomas+Malory%3A+The+Critical+Heritage&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"2436843","seeders":"0","leechers":"5","description":"Sir Thomas Malory: The Critical Heritage - Marylyn Parins [epub]\r\n\r\nWhether it is considered as a single unified work or as a collection of several loosely connected romances, Sir Thomas Malory&apos;s Morte Darthur has exerted a unique shaping influence on other literary works and on the popular consciousness. That influence is with us today in the classroom, in films, in best-selling novels, in recreations of medieval jousts, even perhaps in the modern quest for the historical Arthur.\r\n\r\nIt is not the purpose of the present volume, however, to provide evidence of the far-reaching and pervasive influence of the Morte Darthur by tracing every allusion to it over five centuries, nor to assess the degree and nature of its influence on the numerous poets, novelists, and playwrights who have turned for inspiration to its pages. While influence and popularity are aspects of the literary reputation here considered, particularly in its early stages, the bulk of the record presented here is drawn from nineteenth-century critical assessments of the Morte Darthur itself. It is to the nineteenth century that we owe the Arthurian revival, with its demonstrable effects on Malory scholarship, as well as the very editions of the Morte Darthur through which many a twentiethcentury critic was first introduced to Malory. In addition, the nineteenth-century material anticipates the concerns of twentiethcentury critics in its discussion of style, structure and unity, characterization, theme, and sources.\r\n\r\nThe Critical Heritage gathers together a large body of critical sources on major figures in literature. Each volume presents contemporary responses to a writer&apos;s work, enabling student and researcher to read the material themselves.\r\n\r\nPaperback: 424 pages\r\nPublisher: Routledge; 1st edition (May 5, 2013)","last_updated":"2018-09-24T12:24:11.380Z","parsed":{"xt":"urn:btih:7dffb140c1c97cd6fb21e39721e1e409a72ed8d3","dn":"Sir Thomas Malory: The Critical Heritage","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7dffb140c1c97cd6fb21e39721e1e409a72ed8d3","infoHashBuffer":{"type":"Buffer","data":[125,255,177,64,193,201,124,214,251,33,227,151,33,225,228,9,167,46,216,211]},"name":"Sir Thomas Malory: The Critical Heritage","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}