{"title":"The Science and Practice of Lithium Therapy  (epub)","magnet":"magnet:?xt=urn:btih:7f3bea09aa95f90dc316408639b7a99da20b95ec&dn=+The+Science+and+Practice+of+Lithium+Therapy++%28epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"propbay2","categoryP":"other","categoryS":"e_books","size":"1786996","seeders":"20","leechers":"4","description":"The Science and Practice of Lithium Therapy 1st ed. 2017 Edition\r\nby Gin S. Malhi (Editor), Marc Masson (Editor), Frank Bellivier (Editor) \r\n\r\n\r\nThis book provides a clear and comprehensive guide to the clinical prescription of lithium that draws upon evidence-based knowledge of its mechanisms of action. The book is divided into two parts, on the science of lithium and the practice of lithium therapy. The former covers aspects such as the properties of the lithium ion, pharmacokinetics and pharmacodynamics, impact on neurotransmission, and gene expression modulation. The section on practice includes discussion of variability in response to lithium, use of lithium in the treatment of bipolar disorders, its value in suicide prevention, administration during pregnancy and in the pediatric age group, and side effects. Lithium is arguably the only true mood stabilizer, and its multifaceted effects across many clinical domains have given rise to a resurgence of interest in recent years, fuelled by both researchers and clinicians. Nevertheless, its use remains constrained by exaggerated concerns about potential side-effects. In reality, lithium is a simple molecule that is relatively straightforward to administer and monitor and has potentially profound benefits at a fraction of the cost of contemporary agents. This book dispels the many myths and concerns that surround its use and will be of interest for clinicians and researchers worldwide, and those that are recipients of lithium therapy","last_updated":"2018-03-18T12:04:26.523Z","parsed":{"xt":"urn:btih:7f3bea09aa95f90dc316408639b7a99da20b95ec","dn":" The Science and Practice of Lithium Therapy  (epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7f3bea09aa95f90dc316408639b7a99da20b95ec","infoHashBuffer":{"type":"Buffer","data":[127,59,234,9,170,149,249,13,195,22,64,134,57,183,169,157,162,11,149,236]},"name":" The Science and Practice of Lithium Therapy  (epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}