{"title":"Tambora: The Eruption That Changed the World by Gillen Wood EPUB","magnet":"magnet:?xt=urn:btih:7f5f159949d3d307d37c5a1ec1bbec122ff76462&dn=Tambora%3A+The+Eruption+That+Changed+the+World+by+Gillen+Wood+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"8757646","seeders":"0","leechers":"0","description":"xx\r\n\r\nTambora: The Eruption That Changed the World by Gillen Wood EPUB\r\n\r\nWhen Indonesia&apos;s Mount Tambora erupted in 1815, it unleashed the most destructive wave of extreme weather the world has witnessed in thousands of years. The volcano&apos;s massive sulfate dust cloud enveloped the Earth, cooling temperatures and disrupting major weather systems for more than three years. Amid devastating storms, drought, and floods, communities worldwide endured famine, disease, and civil unrest on a catastrophic scale. On the eve of the bicentenary of the great eruption, Tambora tells the extraordinary story of the weather chaos it wrought, weaving the latest climate science with the social history of this frightening period to offer a cautionary tale about the potential tragic impacts of drastic climate change in our own century.\r\n\r\nThe year following Tambora&apos;s eruption became known as the &quot;Year without a Summer,&quot; when weather anomalies in Europe and New England ruined crops, displaced millions, and spawned chaos and disease. Here, for the first time, Gillen D&apos;Arcy Wood traces Tambora&apos;s full global and historical reach: How the volcano&apos;s three-year climate change regime initiated the first worldwide cholera pandemic, expanded opium markets in China, set the stage for Ireland&apos;s Great Famine, and plunged the United States into its first economic depression. Mary Shelley&apos;s Frankenstein&apos;s monster, inspired by Tambora&apos;s terrifying storms, embodied the fears and misery of global humanity during this transformative period, the most recent sustained climate crisis the world has faced.\r\n\r\nBringing the history of this planetary emergency grippingly to life, Tambora sheds light on the fragile interdependence of climate and human societies, and the threat a new era of extreme global weather poses to us all.\r\n\r\nxx","last_updated":"2018-03-29T12:00:54.333Z","parsed":{"xt":"urn:btih:7f5f159949d3d307d37c5a1ec1bbec122ff76462","dn":"Tambora: The Eruption That Changed the World by Gillen Wood EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7f5f159949d3d307d37c5a1ec1bbec122ff76462","infoHashBuffer":{"type":"Buffer","data":[127,95,21,153,73,211,211,7,211,124,90,30,193,187,236,18,47,247,100,98]},"name":"Tambora: The Eruption That Changed the World by Gillen Wood EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}