{"title":"Liar, Temptress, Soldier, Spy by Karen Abbott EPUB","magnet":"magnet:?xt=urn:btih:802f84a9728def35b6f12f27907f3cd00de29019&dn=Liar%2C+Temptress%2C+Soldier%2C+Spy+by+Karen+Abbott+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4860724","seeders":"0","leechers":"0","description":"xx\r\n\r\nLiar, Temptress, Soldier, Spy by Karen Abbott EPUB\r\n\r\nKaren Abbott, the New York Times best-selling author of Sin in the Second City and &quot;pioneer of sizzle history&quot; (USA Today), tells the spellbinding true story of four women who risked everything to become spies during the Civil War.\r\n\r\nKaren Abbott illuminates one of the most fascinating yet little-known aspects of the Civil War: The stories of four courageous women - a socialite, a farmgirl, an abolitionist, and a widow - who were spies.\r\n\r\nAfter shooting a Union soldier in her front hall with a pocket pistol, Belle Boyd became a courier and spy for the Confederate army, using her charms to seduce men on both sides. Emma Edmonds cut off her hair and assumed the identity of a man to enlist as a Union private, witnessing the bloodiest battles of the Civil War. The beautiful widow, Rose O&apos;Neale Greenhow, engaged in affairs with powerful Northern politicians to gather intelligence for the Confederacy, and used her young daughter to send information to Southern generals. Elizabeth Van Lew, a wealthy Richmond abolitionist, hid behind her proper Southern manners as she orchestrated a far-reaching espionage ring, right under the noses of suspicious rebel detectives.\r\n\r\nUsing a wealth of primary source material and interviews with the spies&apos; descendants, Abbott seamlessly weaves the adventures of these four heroines throughout the tumultuous years of the war. With a cast of real-life characters including Walt Whitman, Nathaniel Hawthorne, General Stonewall Jackson, detective Allan Pinkerton, Abraham and Mary Todd Lincoln, and Emperor Napoleon III, Liar, Temptress, Soldier, Spy draws you into the war as these daring women lived it.\r\n\r\nxx","last_updated":"2018-02-05T12:00:35.770Z","parsed":{"xt":"urn:btih:802f84a9728def35b6f12f27907f3cd00de29019","dn":"Liar, Temptress, Soldier, Spy by Karen Abbott EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"802f84a9728def35b6f12f27907f3cd00de29019","infoHashBuffer":{"type":"Buffer","data":[128,47,132,169,114,141,239,53,182,241,47,39,144,127,60,208,13,226,144,25]},"name":"Liar, Temptress, Soldier, Spy by Karen Abbott EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}