{"title":"Rise.Of.The.Tomb.Raider.READNFO-CONSPIR4CY","magnet":"magnet:?xt=urn:btih:807b0ce5cbb7a2779bda8f1cfd503a668191cf40&dn=Rise.Of.The.Tomb.Raider.READNFO-CONSPIR4CY&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"jandrews12321","categoryP":"games","categoryS":"pc","size":"337522226","seeders":"0","leechers":"0","description":"\r\n\r\n and treacherous regions of Siberia to find the secret of immortality\r\n    before a ruthless organization known as Trinity. Lara must use her wits\r\n    and survival skills, form new alliances, and ultimately embrace her\r\n    destiny as the Tomb Raider. Experience high-octane action moments,\r\n    conquer beautifully hostile environments, engage in brutal guerilla\r\n    combat, and explore awe-inspiring deadly tombs in the evolution of\r\n    survival action. In Rise of the Tomb Raider, Lara becomes more than a\r\n    survivor as she embarks on her first Tomb Raiding expedition. \r\n\r\n    Key Features:\r\n\r\n    Lara&apos;s Journey -  Lara uncovers an ancient mystery that places her in\r\n    the cross-hairs of a ruthless organization known as Trinity. As she\r\n    races to find the secret before Trinity, the trail leads to a myth about\r\n    the Lost City of Kitezh. Lara knows she must reach the Lost City and its\r\n    hidden secrets before Trinity. With that, she sets out for Siberia on\r\n    her first Tomb Raiding expedition. \r\n    Woman vs. Wild - In Rise of the Tomb Raider, Lara battles with not only\r\n    enemies from around the world, but the world itself. Hunt animals to\r\n    craft weapons and scavenge for rare resources in densely populated eco-\r\n    systems. You&apos;ll encounter beautifully hostile environments, full of\r\n    treacherous conditions and unstable landscapes that will require Lara to\r\n    push her limits to the very edge.\r\n    Guerilla Combat - Use the environment to your advantage, scale trees and\r\n    dive underwater to avoid or takedown enemies, configure Lara&apos;s gear,\r\n    weapons, and ammo to suit your play style from stealth to guns blazing,\r\n    craft explosives on the fly to sow chaos, and wield Lara&apos;s signature combat\r\n    bows and climbing axe. \r\n    Return to Tomb Raiding - Tombs are back, and they&apos;re bigger and better than\r\n    ever. In Rise of the Tomb Raider you&apos;ll explore huge, awe-inspiring ancient\r\n    spaces littered with deadly traps, solve dramatic environmental puzzles,\r\n    and decipher ancient texts to reveal crypts as you take on a world filled\r\n    with secrets to discover","last_updated":"2018-09-13T12:05:27.504Z","parsed":{"xt":"urn:btih:807b0ce5cbb7a2779bda8f1cfd503a668191cf40","dn":"Rise.Of.The.Tomb.Raider.READNFO-CONSPIR4CY","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"807b0ce5cbb7a2779bda8f1cfd503a668191cf40","infoHashBuffer":{"type":"Buffer","data":[128,123,12,229,203,183,162,119,155,218,143,28,253,80,58,102,129,145,207,64]},"name":"Rise.Of.The.Tomb.Raider.READNFO-CONSPIR4CY","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}