{"title":"My Descent into Death by Howard Storm EPUB","magnet":"magnet:?xt=urn:btih:807dc2617af3b09307fb30a25de810abcabe718a&dn=My+Descent+into+Death+by+Howard+Storm+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"356327","seeders":"30","leechers":"4","description":"xx\r\n\r\nMy Descent into Death: A Second Chance at Life by Howard Storm EPUB\r\n\r\nNot since Betty Eadie&apos;s Embraced by the Light has a personal account of a near-death Experience (NDE) been so utterly different from most others - or nearly as compelling.\r\n\r\nIn the 30 years since Raymond Moody&apos;s Life After Life appeared, a familiar pattern of NDEs has emerged: suddenly floating over one&apos;s own body, usually in a hospital setting, then a sudden hurtling through a tunnel of light toward a presence of love. Not so in Howard Storm&apos;s case.\r\n\r\nStorm, an avowed atheist, was awaiting emergency surgery when he realized that he was at death&apos;s door. Storm found himself out of his own body, looking down on the hospital room scene below. Next, rather than going &quot;toward the light&quot;, he found himself being torturously dragged to excruciating realms of darkness and death, where he was physically assaulted by monstrous beings of evil. His description of his pure terror and torture is unnerving in its utter originality and convincing detail.\r\n\r\nFinally, drawn away from death and transported to the realm of heaven, Storm met angelic beings as well as the God of Creation. In this fascinating account, Storm tells of his &quot;life review&quot;, his conversation with God, even answers to age-old questions such as why the Holocaust was allowed to take place. Storm was sent back to his body with a new knowledge of the purpose of life here on earth. This book is his message of hope.\r\n\r\nxx","last_updated":"2018-09-19T12:53:22.195Z","parsed":{"xt":"urn:btih:807dc2617af3b09307fb30a25de810abcabe718a","dn":"My Descent into Death by Howard Storm EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"807dc2617af3b09307fb30a25de810abcabe718a","infoHashBuffer":{"type":"Buffer","data":[128,125,194,97,122,243,176,147,7,251,48,162,93,232,16,171,202,190,113,138]},"name":"My Descent into Death by Howard Storm EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}