{"title":"A Gathering of Brilliant Moons.epub","magnet":"magnet:?xt=urn:btih:83f84862488461745fe458e4c32389f161954477&dn=A+Gathering+of+Brilliant+Moons.epub&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"CopperSun","categoryP":"other","categoryS":"e_books","size":"2696884","seeders":"21","leechers":"1","description":"A Gathering of Brilliant Moons: Practice Advice from the Rime Masters of Tibet \r\n\r\nBy Holly Gayley, Joshua Schapiro \r\n\r\n\r\n\r\nDeepen your meditation with advice on Buddhist practice from celebrated masters of Tibet&#x2019;s nonsectarian rim&#xE9; tradition.\r\n\r\nFor generations, Buddhist masters in Tibet have composed sheldam, poignant instructions tailored to the needs of their disciples in the form of short works of advice. Often difficult to find in publication, these works cover topics ranging from practicing while ill to sitting in solitary retreat to recognizing the nature of mind. This collection focuses on an influential and inspiring generation of Buddhist teachers: the nineteenth-century ecumenical, or rim&#xE9;, tradition of eastern Tibet. A Gathering of Brilliant Moons provides lively translations of nineteen pithy and profound works by these great masters, along with essays by their translators which explore the aesthetic qualities of their chosen works, highlight their ecumenical features, and comment on the journey of translation.\r\n\r\nIncludes works from Jamgon Kongtrul, Dza Patrul Rinpoch&#xE9;, Ju Mipham Rinpoch&#xE9;, Dudjom Lingpa, The Third Dodrupchen, Do Khyents&#xE9;, Tokden Sakya Sri, Jikm&#xE9; Lingpa, Shardza Tashi Gyaltsen, Gets&#xE9; Mahapandita, Shangton Tenpa Gyatso, and Bamda Thupten Gelek Gyatso.\r\n\r\nThis book arose from a unique conference on Tibetan translation, where the fourteen translators shared their process with each other and received feedback from their peers with a special focus on the literary aspects of the source texts. As a reflection of this genesis, the accompanying essays in this volume by the translators explore the aesthetic qualities of their chosen works, highlight ecumenical features in them, and comment on the journey of translation. This unique book will be welcomed by religious scholars, Buddhist practitioners, and meditators","last_updated":"2018-09-08T12:28:50.611Z","parsed":{"xt":"urn:btih:83f84862488461745fe458e4c32389f161954477","dn":"A Gathering of Brilliant Moons.epub","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"83f84862488461745fe458e4c32389f161954477","infoHashBuffer":{"type":"Buffer","data":[131,248,72,98,72,132,97,116,95,228,88,228,195,35,137,241,97,149,68,119]},"name":"A Gathering of Brilliant Moons.epub","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}