{"title":"Yan Lianke - Novels and Novellas (8 books)","magnet":"magnet:?xt=urn:btih:840cd2443d0eef00d250898ea6987b5e6f4a3f8e&dn=Yan+Lianke+-+Novels+and+Novellas+%288+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"12442143","seeders":"0","leechers":"0","description":"\nYAN LIANKE (b. 1958) is a Chinese novelist and short story writer.  He is the recipient of numerous literary awards, the most prestigious being the Lu Xun Literary Prize (2000), the Lao She Literary Award (2004), and the Franz Kafka Prize (2014).  He has been a finalist for the Man Booker International Prize on two occasions.\n\nAlthough a considerable number of his works have been banned in China and he was, for a period of three years, prohibited from obtaining a passport or travelling abroad, Yan continues to speak honestly about the impact that government censorship -- and self-censorship -- have had on contemporary Chinese writers.  He is known for his poignant satire and piercing language in covering China&#x2019;s darkest history.  In one angry 2012 article, Yan wrote that &quot;People live like dogs in this society.  I dream of being able to bark out loud in my books, and of turning my barking into exquisite music.&quot;\n\nYan&apos;s depictions of Chinese history and reality are characterized by a sharp edge that is simultaneously profound, absurd and carnivalesque.  Among his novels are THE DREAM OF DING VILLAGE (2006), a tale of the blood trade and subsequent AIDS epidemic in a rural Henan village, and SERVE THE PEOPLE! (2005), a comic satire on Mao&apos;s famous slogan and the political and sexual taboos of his regime.\n\nLENIN&apos;S KISSES (2004) is an absurdist historical allegory of the money-making fever that swept China after Deng Xiaoping opened up the Chinese economy in the 1990s.  THE FOUR BOOKS (2011), a biting satire about Chinese re-education camps during the Great Leap Forward and a stinging indictment of the illogic of bureaucracy and tyranny, was a finalist for the 2016 Man Booker International Prize.  Forming a loose trilogy with the previous two novels, THE EXPLOSION CHRONICLES (2013) is a parody of communist rule in China and a devastating critique of capitalist excess, power, greed and self-destruction.  THE DAY THE SUN DIED (2015), winner of Hong Kong&apos;s prestigious Dream of the Red Chamber Award, is a haunting dystopian novel of a town caught in a waking nightmare, with an underlying political message that China is sleepwalking to disaster.\n\nIn addition, Yan has published ten collections of novellas and short stories, including the critically acclaimed YEARS, MONTHS, DAYS, a bestselling classic in China and winner of the Lu Xun Literary Prize.\n\n\nThe following books are in ePUB format:\n\n* Day the Sun Died (Text Publishing, 2018).  Translated by Carlos Rojas.\n* Dream of Ding Village (Text Publishing, 2011).  Translated by Cindy Carter.\n* Explosion Chronicles, The (Grove, 2016).  Translated by Carlos Rojas.\n* Four Books, The (Grove, 2015).  Translated by Carlos Rojas.\n* Lenin&apos;s Kisses (Grove, 2012).  Translated by Carlos Rojas.\n* Marrow (Penguin, 2015).  Translated by Carlos Rojas.\n* Serve the People! (Grove, 2007).  Translated by Julia Lovell.\n* Years, Months, Days: Two Novellas (Black Cat, 2017).  Translated by Carlos Rojas.\n\n____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-10-06T12:29:30.214Z","parsed":{"xt":"urn:btih:840cd2443d0eef00d250898ea6987b5e6f4a3f8e","dn":"Yan Lianke - Novels and Novellas (8 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"840cd2443d0eef00d250898ea6987b5e6f4a3f8e","infoHashBuffer":{"type":"Buffer","data":[132,12,210,68,61,14,239,0,210,80,137,142,166,152,123,94,111,74,63,142]},"name":"Yan Lianke - Novels and Novellas (8 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}