{"title":"Breaking Bad: A Cultural History by Lara C. Stache (.epub)","magnet":"magnet:?xt=urn:btih:846626c62a14004d35c795bc2d116af6b41cefdc&dn=Breaking+Bad%3A+A+Cultural+History+by+Lara+C.+Stache+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"4469351","seeders":"0","leechers":"0","description":"\r\nBreaking Bad: A Cultural History by Lara C. Stache \r\n\r\nRequirements: .ePUB Reader\r\n\r\nOverview: As one of the most critically acclaimed shows of all time, Breaking Bad explored the life and crimes of a high school chemistry teacher turned meth kingpin of the American Southwest. As Walter White and his former student Jesse Pinkman become deeply entwined in the drug world, their narrative leaves a trail of bodies strewn across the show&#x2019;s five seasons&#x2014;a story that resulted in more than 15 Emmy awards.\r\n\r\nIn Breaking Bad: A Cultural History, Lara C. Stache offers an engaging analysis of the program, focusing on the show&#x2019;s fascinating characters and complex story lines. Stache gives the show its due reverence, but also suggests new ways of understanding and critiquing the series as a part of the larger culture in which it exists. The author looks at how the program challenges viewers to think about the choices made in the narrative, analyzes what did and did not work, and determines the program&#x2019;s cultural significance, particularly its place in twenty-first century America.\r\n\r\nThe author also explores how Breaking Bad grapples with themes of morality, legality, and anti-drug rhetoric and looks at how the marketing of the series influenced the ways in which television shows are now promoted. Breaking Bad: A Cultural History captures the spirit of the series and examines how the show had an impact on viewers like no other program. This book will be of interest to fans of the show as well as to scholars and students of television, media, and American popular culture.\r\n\r\nGenre: Non-Fiction &gt; Humor &amp; Entertainment &gt; Television","last_updated":"2018-09-24T12:43:33.868Z","parsed":{"xt":"urn:btih:846626c62a14004d35c795bc2d116af6b41cefdc","dn":"Breaking Bad: A Cultural History by Lara C. Stache (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"846626c62a14004d35c795bc2d116af6b41cefdc","infoHashBuffer":{"type":"Buffer","data":[132,102,38,198,42,20,0,77,53,199,149,188,45,17,106,246,180,28,239,220]},"name":"Breaking Bad: A Cultural History by Lara C. Stache (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}