{"title":"Awaken the Darkness by Dianne Duvall EPUB","magnet":"magnet:?xt=urn:btih:85a85d270968ba8313e943da773393d4273db3b4&dn=Awaken+the+Darkness+by+Dianne+Duvall+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1137978","seeders":"0","leechers":"0","description":"xx\r\n\r\nAwaken the Darkness by Dianne Duvall EPUB\r\n\r\nDianne Duvall presents the eighth book of the Immortal Guardians series.\r\n\r\nHe awakens encapsulated in dirt with no knowledge of how he came to be there. Riddled with injuries, he can remember neither his past nor who he is. Nor can he remember what he is. But surely no mortal man could survive being buried deep beneath the earth. All he knows with certainty is that the soothing voice and presence of the woman moving around above enables him to endure the agony of his wounds. And he will do whatever it takes to be with her.\r\n\r\nWhen Susan first sees the old two-story house for sale, such warmth and longing fill her that - against all reason - she makes an offer. It will take years of hard work and money she frankly doesn&apos;t have to fix up the place. So she can&apos;t explain why she bought it. She also can&apos;t explain what compels her to spend hours one night, digging in the basement until she unearths a man. A man who still lives and breathes despite having been buried alive. A man whose intense brown eyes glow amber with pain, declaring him far more than ordinary. Susan knows she should keep her distance. He has no memory and possesses gifts that would make most fear him.\r\n\r\nBut as the two work together to unravel the mystery of his past, she finds herself drawn in by his teasing nature and tender touch. So much so that she loses her heart to him even as they find themselves hunted by unknown enemies who are ruthless in their quest to capture them. \r\n\r\nxx","last_updated":"2018-07-19T12:00:59.186Z","parsed":{"xt":"urn:btih:85a85d270968ba8313e943da773393d4273db3b4","dn":"Awaken the Darkness by Dianne Duvall EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"85a85d270968ba8313e943da773393d4273db3b4","infoHashBuffer":{"type":"Buffer","data":[133,168,93,39,9,104,186,131,19,233,67,218,119,51,147,212,39,61,179,180]},"name":"Awaken the Darkness by Dianne Duvall EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}