{"title":"Colossal Failure of Common Sense by Lawrence G. Mcdonald(.epub)+","magnet":"magnet:?xt=urn:btih:8677f8d60522f12830ba819063fa7b6e43ad29fa&dn=Colossal+Failure+of+Common+Sense+by+Lawrence+G.+Mcdonald%28.epub%29%2B&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"1227583","seeders":"62","leechers":"6","description":"A Colossal Failure of Common Sense: The Inside Story of the Collapse of Lehman Brothers by Lawrence G. McDonald, Patrick Robinson\r\n \r\nRequirements: .ePUB / MOBI Reader\r\n\r\nOverview: One of the biggest questions of the financial crisis has not been answered until now. What happened at Lehman Brothers and why was it allowed to fail, with aftershocks that rocked the global economy? In this news-making, often astonishing book, a former Lehman Brothers Vice President gives us the straight answers&#x2014;right from the belly of the beast. In A Colossal Failure of Common Sense, Larry McDonald, a Wall Street insider, reveals the culture and unspoken rules of the game like no book has ever done. The book is couched in the very human story of Larry McDonald&#x2019;s Horatio Alger-like rise from a Massachusetts &#x201C;gateway to nowhere&#x201D; housing project to the New York headquarters of Lehman Brothers, home of one of the world&#x2019;s toughest trading floors. We get a close-up view of the participants in the Lehman collapse, especially those who saw it coming with a helpless, angry certainty. We meet the Brahmins at the top, whose reckless, pedal-to-the-floor addiction to growth finally demolished the nation&#x2019;s oldest investment bank. The Wall Street we encounter here is a ruthless place, where brilliance, arrogance, ambition, greed, capacity for relentless toil, and other human traits combine in a potent mix that sometimes fuels prosperity but occasionally destroys it. The full significance of the dissolution of Lehman Brothers remains to be measured. But this much is certain: it was a devastating blow to America&#x2019;s&#x2014;and the world&#x2019;s&#x2014;financial system. And it need not have happened. This is the story of why it did.\r\n\r\nGenre: Nonfiction &gt; General, Business","last_updated":"2018-09-22T12:17:38.497Z","parsed":{"xt":"urn:btih:8677f8d60522f12830ba819063fa7b6e43ad29fa","dn":"Colossal Failure of Common Sense by Lawrence G. Mcdonald(.epub) ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8677f8d60522f12830ba819063fa7b6e43ad29fa","infoHashBuffer":{"type":"Buffer","data":[134,119,248,214,5,34,241,40,48,186,129,144,99,250,123,110,67,173,41,250]},"name":"Colossal Failure of Common Sense by Lawrence G. Mcdonald(.epub) ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}