{"title":"Act of God by Jill Ciment EPUB","magnet":"magnet:?xt=urn:btih:875f8f093813c6346c2768e8cf9cdbb8101c12a0&dn=Act+of+God+by+Jill+Ciment+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1964352","seeders":"42","leechers":"4","description":"xx\r\n\r\nAct of God by Jill Ciment EPUB\r\n\r\nFrom the author of Heroic Measures [&quot;Smart and funny and completely surprising - I loved every page&quot; (Ann Patchett)], a contemporary noir novel that starts out a comedy of errors and turns darker at every hairpin turn - about a lethal form of mold spreading throughout New York City, about the townhouse in which it&apos;s first discovered, and the people living in it whose lives are suddenly upended.\r\n\r\nIt&apos;s the summer of 2015, Brooklyn. The city is sweltering from another record-breaking heat wave, this one accompanied by biblical rains. Edith, a recently retired legal librarian, and her identical twin sister, Kat, a feckless romantic who&apos;s mistaken her own eccentricity for originality, discover something ominous in their hall closet. It seems to be phosphorescent; it&apos;s a mushroom...and it&apos;s sprouting from their wall.\r\n\r\nUpstairs their landlady, Vida Cebu, a Shakespearian actress far more famous for her TV commercials for Ziberax (the first female sexual enhancement pill) than for her stage work, discovers that a petite Russian girl, a runaway au pair, has been secretly living in her guest-room closet. When the police arrest the intruder, they find a second mushroom, also glowing, under the intruder&apos;s bedding. Soon the HAZMAT squad arrives, and the four women are forced to evacuate the contaminated row house with only the clothes on their backs.\r\n\r\nAs the mold infestation spreads from row house to high-rise and frightened, bewildered New Yorkers wait out this plague (is it an act of God?) on their city and property, the four women become caught up in a centrifugal nightmare.\r\n\r\n..\r\n\r\nxx","last_updated":"2018-06-10T12:14:04.613Z","parsed":{"xt":"urn:btih:875f8f093813c6346c2768e8cf9cdbb8101c12a0","dn":"Act of God by Jill Ciment EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"875f8f093813c6346c2768e8cf9cdbb8101c12a0","infoHashBuffer":{"type":"Buffer","data":[135,95,143,9,56,19,198,52,108,39,104,232,207,156,219,184,16,28,18,160]},"name":"Act of God by Jill Ciment EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}