{"title":"BadTeensPunished - Jane Wilde (Yes Daddy) NEW 03 October 2018","magnet":"magnet:?xt=urn:btih:876d7d8fde41b76833b50a359b11bc485884c5c3&dn=BadTeensPunished+-+Jane+Wilde+%28Yes+Daddy%29+NEW+03+October+2018&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"281450129","seeders":"30","leechers":"29","description":"Brad Newman can&apos;t believe how late his stepdaughter Jane Wilde is returning home from her horseback riding practice. When he confronts her upon her return, her lies only enrage him. He&apos;s certain that Jane has been banging her horse trainer, so he bends her over his knee to spank her with her riding crop in punishment. When Brad realizes that Jane is into the spanking, he pulls her pants down and finds her pussy wet and smelling of sex. Jane can feel her stepdaddy&apos;s cock getting hard, and she realizes suddenly that she has all the power in this interaction.Rubbing Brad&apos;s dick as she sinks to her knees, she whips it out to kiss and suck. Her hot little mouth is second only to the tightness of her tight tiny twat as she peels off her riding pants and seats herself in Brad&apos;s lap. Fully impaled by his hardon, she shows off just how well those horseback riding lessons have prepared her to undulate her hips and grind like a pro. When she turns around in Brad&apos;s arms to swing her little titties in his face, all he can do is hang onto her hips and go for the ride.Bending Jane over on her hands and knees, Brad takes a ride of his own as he unleashes a doggy style pussy pounding on his teen daughter. She spreads her thighs nice and wide to accommodate him as he brings her off one last time. Pulling out, he gives her the facial that she begs for to leave her covered in cum.\r\nCategories: Small Boobs Hairy Pussy Brunette Hardcore Petite Girl-Boy Blowjob Handjob Girl Orgasm POV Deep Throat Big Dick Bad Teens Punished\r\n <a href=\"\nhttp://imgdone.com/image/z2C5P\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/z2C5P</a>\r\n <a href=\"\nhttp://imgdone.com/image/z26zh\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/z26zh</a>","last_updated":"2018-10-03T12:09:00.385Z","parsed":{"xt":"urn:btih:876d7d8fde41b76833b50a359b11bc485884c5c3","dn":"BadTeensPunished - Jane Wilde (Yes Daddy) NEW 03 October 2018","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"876d7d8fde41b76833b50a359b11bc485884c5c3","infoHashBuffer":{"type":"Buffer","data":[135,109,125,143,222,65,183,104,51,181,10,53,155,17,188,72,88,132,197,195]},"name":"BadTeensPunished - Jane Wilde (Yes Daddy) NEW 03 October 2018","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}