{"title":"Amateur Couples Showing Off - 4 [Homegrown Video] (2014)","magnet":"magnet:?xt=urn:btih:880f3847e04f297ee8600fa7b5513ebc18d52636&dn=Amateur+Couples+Showing+Off+-+4+%5BHomegrown+Video%5D+%282014%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Rurihood13","categoryP":"porn","categoryS":"movie_clips","size":"705297035","seeders":"28","leechers":"98","description":"Starring: Daisy, Hannah, Missy, Natasha, Zoey\r\n\r\n1:54:29 \r\n <a href=\"\nhttps://www.imageuploads.co.uk/image/ygKRj\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.imageuploads.co.uk/image/ygKRj</a>\r\n <a href=\"\nhttps://www.imageuploads.co.uk/image/yfAHx\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.imageuploads.co.uk/image/yfAHx</a>\r\n <a href=\"\nhttps://www.imageuploads.co.uk/image/yfJCL\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.imageuploads.co.uk/image/yfJCL</a>\r\n <a href=\"\nhttps://www.imageuploads.co.uk/image/yfV3h\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.imageuploads.co.uk/image/yfV3h</a>\r\n <a href=\"\nhttps://www.imageuploads.co.uk/image/yfsuP\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.imageuploads.co.uk/image/yfsuP</a>\r\n\r\nMissy - Seems shy and quiet on the outside, but don&apos;t let her appearance fool you!\r\n\r\n19 year old Missy shows us how she pleases herself at home, and her lucky vibrator gets the action started. Next she works her ass and pussy simultaneously with 2 vibrators before she is ready for a real cock. Her boyfriend Patrick gives her what she wants and the action escalates. Missy&apos;s pussy gets very wet and Patrick has Missy lick her pussy juices off his fingers. After some great double penetration, this amazing scene comes to a climactic finish when Patrick dumps his load on Missy&apos;s pretty young face!\r\n\r\nNatasha - Brannon can touch anything he wants as long as she gets that big dick of his!\r\n\r\nThis scene features HGV newcomer Natasha from Columbia. Brannon Rhodes is behind the camera and Natasha doesn&apos;t waste any time going after what she wants, taking Brannon&apos;s big hard bone down her throat. After some cock sucking and ass smacking, Brannon puts that big, black shaft of his deep between Natasha&apos;s puffy, wet pussy lips. He pulls her hair from behind as he rams her repeatedly. This intense fuck-fest comes to a fantastic finish when Brannon shoots his load on Natasha&apos;s lips and face!\r\n\r\nHannah - The role-playing won&apos;t stop us from sharing this hot scene with HGV fans!\r\n\r\nThis hot suck and fuck features pierced hottie Hannah playing Nurse to Vito, a patient who&apos;s had an erection for more than four hours! Nurse Hannah takes a closer look at Vito&apos;s erection, revealing her smoking hot body as she peels her scrubs off. Vito can&apos;t wait to get his hard shaft inside her. Hannah milks Vito&apos;s hard bone for a while before he plunges his shaft deep inside her beautifully trimmed pussy. The good nurse gives him relief as he shoots his cum all over her hard stomach and tight pussy!\r\n\r\nZoey - 18 year old cutie pie may be shy and quiet, but she certainly knows how to suck a dick!\r\n\r\nZoey is an 18 year old cutie pie making her HGV debut. Her shyness is evident, but she seems to come out of her shell once her boyfriend Edward starts sucking on her perky, pink titties. She pops Edward&apos;s cock out and takes his hard shaft deep in her mouth. He reciprocates the giving gesture by putting Zoey on her back and licking her swollen clit and pussy lips. Her breathing gets heavier as Zoey quietly states that she had an orgasm. Edward fucks Zoey long and hard before this amazing scene finishes with Edward shooting a messy load on Zoey&apos;s pretty face!","last_updated":"2018-09-26T12:16:11.629Z","parsed":{"xt":"urn:btih:880f3847e04f297ee8600fa7b5513ebc18d52636","dn":"Amateur Couples Showing Off - 4 [Homegrown Video] (2014)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"880f3847e04f297ee8600fa7b5513ebc18d52636","infoHashBuffer":{"type":"Buffer","data":[136,15,56,71,224,79,41,126,232,96,15,167,181,81,62,188,24,213,38,54]},"name":"Amateur Couples Showing Off - 4 [Homegrown Video] (2014)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}