{"title":"Finland's War of Choice by Henrik Lunde EPUB","magnet":"magnet:?xt=urn:btih:885b05b008f449f120610d1df5e8f7d812e3aa9a&dn=Finland%27s+War+of+Choice+by+Henrik+Lunde+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4921405","seeders":"0","leechers":"0","description":"xx\r\n\r\nFinland&apos;s War of Choice by Henrik Lunde EPUB\r\n\r\nThis book describes the odd coalition between Germany and Finland in World War II, and their joint military operations from 1941 to 1945. This is a topic often missing in English, though in stark contrast to the numerous books on the shorter and less bloody Winter War. That conflict represented a gallant fight of a democratic &#x201C;David&#x201D; against a totalitarian &#x201C;Goliath&#x201D; that caught the imagination of the world. The story of Finland fighting alongside a &#x201C;Goliath&#x201D; of its own has not brought pride to that nation and was a period many Finns would rather forget.\r\n\r\nThe prologue of this book brings the reader up to speed by briefly examining the difficult history of Finland, from its separation from the Soviet Union in 1917 to its isolation after being bludgeoned in 1939-40. It then examines both Finnish and German motives for forming a coalition against the USSR, and how - as logical as a common enemy would seem - the lack of true planning and preparation would doom the alliance. This book posits that it was mind-boggling how the highly professional German General Staff allowed itself to accept the militarily unsound and shaky coalition that resulted. The war aims were not discussed or harmonized, there were no campaign plans with tasks and missions spelled out past the initial assault, no effective main effort established, inadequate force levels, and an unsound command structure with various headquarters. Practically every rule in the book was broken. The objective of linking up with the Finns in the Leningrad area was an important factor in Hitler opting for three main drives into the Soviet Union rather than an earlier OKH plan that called for only two.\r\n\r\nAfter describing the operations during and after Barbarossa, this book describes how the Finnish theater became a blind ally for the Germans. Their strongest and best army was trapped both operationally and geographically in central and northern Finland, making virtually no contribution to the war effort. The Germans could not bring to bear enough forces to accomplish their objectives without substantial Finnish assistance, and that was not forthcoming.\r\n\r\nThe final chapters deal with the Soviet counteroffensive against the Finns in 1944. The Finns lost all their gains and quickly concluded a separate armistice. This left the German forces in Finland to simply vacate the territory, fighting between the Finns and Soviets alike as they tried to return to the main war. Jointly suffering 291,000 casualties, the only consolation was that the coalition had inflicted some 830,000 on the Soviets.\r\n\r\n..\r\n\r\nxx","last_updated":"2018-05-13T12:02:40.856Z","parsed":{"xt":"urn:btih:885b05b008f449f120610d1df5e8f7d812e3aa9a","dn":"Finland's War of Choice by Henrik Lunde EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"885b05b008f449f120610d1df5e8f7d812e3aa9a","infoHashBuffer":{"type":"Buffer","data":[136,91,5,176,8,244,73,241,32,97,13,29,245,232,247,216,18,227,170,154]},"name":"Finland's War of Choice by Henrik Lunde EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}