{"title":"The Good Fight by Danielle Steel EPUB","magnet":"magnet:?xt=urn:btih:88920c01f3b243049fa0eeb68f202f774473755a&dn=The+Good+Fight+by+Danielle+Steel+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"809295","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Good Fight by Danielle Steel EPUB\r\n\r\nAgainst the electrifying backdrop of the 1960s, Danielle Steel unveils the gripping chronicle of a young woman discovering a passion for justice and of the unsung heroes she encounters on her quest to fight the good fight. \r\n\r\nThe daughter and granddaughter of prominent Manhattan lawyers, Meredith McKenzie is destined for the best of everything: top schools, elite social circles, the perfect marriage. Spending her childhood in Germany as her father prosecutes Nazi war criminals at the Nuremberg trials, Meredith soaks up the conflict between good and evil as it plays out in real time. \r\n\r\nWhen her family returns to the United States, she begins blazing her own trail, swimming against the tides, spurred on by her freethinking liberal grandfather, determined to become a lawyer despite her traditional, conservative father&apos;s objections. She forges a lifelong friendship with a young German Jewish woman whose family died in the concentration camps. And while her grandfather rises to the Supreme Court, Meredith enlists in the most pressing causes of her time, fighting for civil rights and an end to the Vietnam War. \r\n\r\nFrom the bright morning of JFK&apos;s inauguration through the tumultuous years that follow as America hurtles toward the twin assassinations of Martin Luther King and Bobby Kennedy, Meredith joins the vanguard of a new generation of women, breaking boundaries socially, politically, and professionally. But when the violence of the era strikes too close to home, her once tightly knit family must survive a devastating loss and rethink their own values and traditions in light of the times. \r\n\r\nEncompassing the remarkable people Meredith meets, the historic events she witnesses, and the sacrifices she must make, this is the story of a woman changing her world as she herself is changed by it. Beautifully told, brimming with unforgettable moments and characters, The Good Fight is an inspiring, uplifting novel with resonance for our own times.\r\n\r\nxx","last_updated":"2018-07-14T12:00:44.289Z","parsed":{"xt":"urn:btih:88920c01f3b243049fa0eeb68f202f774473755a","dn":"The Good Fight by Danielle Steel EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"88920c01f3b243049fa0eeb68f202f774473755a","infoHashBuffer":{"type":"Buffer","data":[136,146,12,1,243,178,67,4,159,160,238,182,143,32,47,119,68,115,117,90]},"name":"The Good Fight by Danielle Steel EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}