{"title":"I Was Anastasia by Ariel Lawhon EPUB","magnet":"magnet:?xt=urn:btih:88b937c10c97edec1c204ce176694d4e99d02d54&dn=I+Was+Anastasia+by+Ariel+Lawhon+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2153029","seeders":"0","leechers":"0","description":"xx\r\n\r\nI Was Anastasia by Ariel Lawhon EPUB\r\n\r\n&#x201C;Compelling and utterly fascinating...drifts far into the mysterious lives of Anastasia Romanov and Anna Anderson.&#x201D; (Lisa Wingate, author of Before We Were Yours)\r\n\r\nIn an enthralling new feat of historical suspense, Ariel Lawhon unravels the extraordinary twists and turns in Anna Anderson&apos;s 50 year battle to be recognized as Anastasia Romanov. Is she the Russian Grand Duchess, a beloved daughter and revered icon, or is she an imposter, the thief of another woman&apos;s legacy?\r\n\r\nCountless others have rendered their verdict. Now it is your turn. \r\n\r\nRussia, July 17, 1918: Under direct orders from Vladimir Lenin, Bolshevik secret police force Anastasia Romanov, along with the entire imperial family, into a damp basement in Siberia where they face a merciless firing squad. None survives. At least that is what the executioners have always claimed.\r\n\r\nGermany, February 17, 1920: A young woman bearing an uncanny resemblance to Anastasia Romanov is pulled shivering and senseless from a canal in Berlin. Refusing to explain her presence in the freezing water, she is taken to the hospital, where an examination reveals that her body is riddled with countless horrific scars. When she finally does speak, this frightened, mysterious woman claims to be the Russian Grand Duchess Anastasia.\r\n\r\nHer detractors, convinced that the young woman is only after the immense Romanov fortune, insist on calling her by a different name: Anna Anderson.\r\n\r\nAs rumors begin to circulate through European society that the youngest Romanov daughter has survived the massacre, old enemies and new threats are awakened. With a brilliantly crafted dual narrative structure, Lawhon wades into the most psychologically complex and emotionally compelling territory yet: the nature of identity itself.\r\n\r\nThe question of who Anna Anderson is and what actually happened to Anastasia Romanov creates a saga that spans 50 years and touches three continents. This thrilling story is every bit as moving and momentous as it is harrowing and twisted.\r\n\r\nxx","last_updated":"2018-03-28T12:04:22.473Z","parsed":{"xt":"urn:btih:88b937c10c97edec1c204ce176694d4e99d02d54","dn":"I Was Anastasia by Ariel Lawhon EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"88b937c10c97edec1c204ce176694d4e99d02d54","infoHashBuffer":{"type":"Buffer","data":[136,185,55,193,12,151,237,236,28,32,76,225,118,105,77,78,153,208,45,84]},"name":"I Was Anastasia by Ariel Lawhon EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}