{"title":"Alaskan Holiday by Debbie Macomber EPUB","magnet":"magnet:?xt=urn:btih:8953d5a720bf7650def4004c290edc99e10490fc&dn=Alaskan+Holiday+by+Debbie+Macomber+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2652901","seeders":"0","leechers":"0","description":"xx\r\n\r\nAlaskan Holiday by Debbie Macomber EPUB\r\n\r\nDebbie Macomber brings us to the Alaskan wilderness for a magical Christmas tale about finding love where it&apos;s least expected.\r\n\r\nBefore beginning her dream job as sous chef in one of Seattle&apos;s hottest new restaurants, Josie Avery takes a summer position cooking at a lakeside lodge in the remote Alaskan town of Ponder. Josie falls for the rustic charms of the local community - including Jack Corcoran, the crotchety keeper of Ponder&apos;s famed sourdough starter, and, in particular, the quiet and intense Palmer Saxon, a famed master swordsmith.   \r\n\r\nJosie and Palmer become close during the long Alaskan summer days, but Josie knows that come fall, she&apos;ll be returning to reality and the career she&apos;s worked so hard for. Palmer, on the other hand, would like nothing better than to make Josie his wife and to keep her in Ponder. But Josie can&apos;t imagine abandoning her mother back in the Emerald City and sacrificing her career to stay in this isolated town - not even for a man she&apos;s quickly coming to love.   \r\n\r\nFate has other plans. Josie misses the last boat out of town before winter sets in, stranding her in Ponder and putting her dream job at risk. As the holidays approach, Josie and Palmer must grapple with the complications that arise when dreams confront reality and the Christmas magic that can happen when they put their faith in love.   \r\n\r\nDebbie Macomber is at her best in this beautiful holiday story about the far journeys we travel to find a place to call home.\r\n\r\nxx","last_updated":"2018-10-05T12:17:57.639Z","parsed":{"xt":"urn:btih:8953d5a720bf7650def4004c290edc99e10490fc","dn":"Alaskan Holiday by Debbie Macomber EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8953d5a720bf7650def4004c290edc99e10490fc","infoHashBuffer":{"type":"Buffer","data":[137,83,213,167,32,191,118,80,222,244,0,76,41,14,220,153,225,4,144,252]},"name":"Alaskan Holiday by Debbie Macomber EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}