{"title":"Me and a Guy Named Elvis by Jerry Schilling, C. Crisafulli EPUB","magnet":"magnet:?xt=urn:btih:8a5b951f29f5b8704e8b6a8a18b9d3c7fda6b9ee&dn=Me+and+a+Guy+Named+Elvis+by+Jerry+Schilling%2C+C.+Crisafulli+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"10624045","seeders":"42","leechers":"4","description":"xx\r\n\r\nMe and a Guy Named Elvis by Jerry Schilling, C. Crisafulli EPUB\r\n\r\nOn a lazy Sunday in 1954, 12-year-old Jerry Schilling wandered into a Memphis touch-football game, only to discover that his team was quarterbacked by a 19-year-old Elvis Presley, the local teen whose first record, That&apos;s All Right, had just debuted on Memphis radio. The two became fast friends, even as Elvis turned into the world&apos;s biggest star. In 1964, Elvis invited Jerry to work for him as part of his &quot;Memphis Mafia&quot;, and Jerry soon found himself living with Elvis full-time in a Bel Air mansion and, later, in his own room at Graceland.\r\n\r\nOver the next 13 years, Jerry would work for Elvis in various capacities, from bodyguard to photo double to co-executive producer on a karate film. But more than anything else, he was Elvis&apos; close friend and confidant. Elvis trusted Jerry with protecting his life when he received death threats; he also asked Jerry to drive him and Priscilla to the hospital the day Lisa Marie was born and to accompany him during the famous &quot;lost weekend&quot;, when he traveled to meet President Nixon at the White House.\r\n\r\nMe and a Guy Named Elvis looks at Presley from a friend&apos;s perspective, offering readers the man rather than the icon, including insights into the creative frustrations that led to Elvis&apos; abuse of prescription medication and his tragic death. Jerry offers never-before-told stories about life inside Elvis&apos; inner circle and an emotional recounting of the great times, hard times, and unique times he and Elvis shared. These vivid memories will be priceless for Elvis&apos; millions of fans, and the compelling story will fascinate an even wider audience.\r\n\r\nxx","last_updated":"2018-06-08T12:15:47.322Z","parsed":{"xt":"urn:btih:8a5b951f29f5b8704e8b6a8a18b9d3c7fda6b9ee","dn":"Me and a Guy Named Elvis by Jerry Schilling, C. Crisafulli EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8a5b951f29f5b8704e8b6a8a18b9d3c7fda6b9ee","infoHashBuffer":{"type":"Buffer","data":[138,91,149,31,41,245,184,112,78,139,106,138,24,185,211,199,253,166,185,238]},"name":"Me and a Guy Named Elvis by Jerry Schilling, C. Crisafulli EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}