{"title":"Mine Eyes Have Seen the Glory by Randall Balmer AZW3","magnet":"magnet:?xt=urn:btih:8ae3e0ad172f23bf34351c8994a80616e579d3ef&dn=Mine+Eyes+Have+Seen+the+Glory+by+Randall+Balmer+AZW3&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"671291","seeders":"29","leechers":"5","description":"xx\r\n\r\nMine Eyes Have Seen the Glory: A Journey into the Evangelical Subculture in America by Randall Balmer AZW3\r\n\r\nRandall Balmer&apos;s Mine Eyes Have Seen the Glory is an insightful and engaging journey into the world of conservative Christians in America. Originally published 25 years ago and the basis for an award-winning PBS documentary, this timely new edition arrives just as recent elections have left an ever-growing number of secular Americans wondering exactly how the other half thinks.\r\n\r\nFrom Oregon to Florida, and from Texas to North Dakota, Balmer offers an immensely readable tour of the highways and byways of American evangelicalism. We visit a revival meeting in Florida, an Indian reservation in the Dakotas, a trade show for Christian booksellers, and a fundamentalist Bible camp in the Adirondacks. For this fourth edition, Balmer adds two chapters, one on the phenomenally popular &quot;Painter of Light&quot;, Thomas Kinkade, and one on Rick Warren, author of The Purpose-Driven Life. Through the eyes of these and other people Balmer meets on his journeys, we arrive at a more accurate and balanced understanding of an abiding tradition that, as the author argues, is both rich in theological insights and mired in contradictions.\r\n\r\nMine Eyes Have Seen the Glory offers readers a genuine insight into the appeal that the evangelicals movement holds for thousands of Americans.\r\n\r\nxx","last_updated":"2018-07-01T12:11:27.090Z","parsed":{"xt":"urn:btih:8ae3e0ad172f23bf34351c8994a80616e579d3ef","dn":"Mine Eyes Have Seen the Glory by Randall Balmer AZW3","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8ae3e0ad172f23bf34351c8994a80616e579d3ef","infoHashBuffer":{"type":"Buffer","data":[138,227,224,173,23,47,35,191,52,53,28,137,148,168,6,22,229,121,211,239]},"name":"Mine Eyes Have Seen the Glory by Randall Balmer AZW3","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}