{"title":"A Column of Fire (The Kingsbridge Novels #3) by Ken Follett EPUB","magnet":"magnet:?xt=urn:btih:8b3157f47699dd4bae0c11c7febc9fedbb0144b3&dn=A+Column+of+Fire+%28The+Kingsbridge+Novels+%233%29+by+Ken+Follett+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2818671","seeders":"1","leechers":"0","description":"xx\r\n\r\nA Column of Fire (The Kingsbridge Novels, Book 3) by Ken Follett EPUB\r\n\r\nInternational best-selling author Ken Follett has enthralled millions of fans with the first two books of his Kingsbridge series, The Pillars of the Earth and World Without End. The saga now continues with Follett&apos;s magnificent new epic, A Column of Fire.\r\n\r\nIn 1558, the ancient stones of Kingsbridge Cathedral look down on a city torn apart by religious conflict. As power in England shifts precariously between Catholics and Protestants, high principles clash bloodily with friendship, loyalty, and love.\r\n\r\nNed Willard wants nothing more than to marry Margery Fitzgerald. But when the lovers find themselves on opposing sides of the religious divide sweeping across the country, Ned goes to work for Princess Elizabeth. When she becomes queen, all Europe turns against England. The shrewd, determined young monarch sets up the country&apos;s first secret service, to give her early warning of assassination plots, rebellions, and invasion plans. Over a turbulent half century, the love between Ned and Margery seems doomed as extremism sparks violence from Edinburgh to Geneva. Elizabeth clings precariously to her throne and her principles, protected by a small, dedicated group of resourceful spies and courageous secret agents.\r\n\r\nThe real enemies, then as now, are not the rival religions. The true battle pitches those who believe in tolerance and compromise against the tyrants who would impose their ideas on everyone else - no matter what the cost.\r\n\r\nSet during one of the most turbulent and revolutionary times in history, A Column of Fire is one of Follett&apos;s most exciting and ambitious works yet and is perfect both for longtime fans of the Kingsbridge series as well as readers new to Ken Follett.\r\n\r\nxx","last_updated":"2018-09-30T12:04:02.572Z","parsed":{"xt":"urn:btih:8b3157f47699dd4bae0c11c7febc9fedbb0144b3","dn":"A Column of Fire (The Kingsbridge Novels #3) by Ken Follett EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8b3157f47699dd4bae0c11c7febc9fedbb0144b3","infoHashBuffer":{"type":"Buffer","data":[139,49,87,244,118,153,221,75,174,12,17,199,254,188,159,237,187,1,68,179]},"name":"A Column of Fire (The Kingsbridge Novels #3) by Ken Follett EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}