{"title":"The Parking Lot Attendant by Nafkote Tamirat EPUB","magnet":"magnet:?xt=urn:btih:8b6654207b654965bcf6517fae0b4f61ed16791c&dn=The+Parking+Lot+Attendant+by+Nafkote+Tamirat+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5613844","seeders":"2","leechers":"1","description":"xx\r\n\r\nThe Parking Lot Attendant by Nafkote Tamirat EPUB\r\n\r\nA mesmerizing, indelible coming-of-age book about a girl in Boston&apos;s tightly-knit Ethiopian community who falls under the spell of a charismatic hustler out to change the world\r\n\r\nA haunting story of fatherhood, national identity, and what it means to be an immigrant in America today, Nafkote Tamirat&apos;s The Parking Lot Attendant explores how who we love, the choices we make, and the places we&#x2019;re from combine to make us who we are.\r\n\r\nThe story begins on an undisclosed island where the unnamed narrator and her father are the two newest and least-liked members of a commune that has taken up residence there. Though the commune was built on utopian principles, it quickly becomes clear that life here is not as harmonious as the founders intended. After immersing us in life on the island, our young heroine takes us back to Boston to recount the events that brought her here. Though she and her father belong to a wide Ethiopian network in the city, they mostly keep to themselves, which is how her father prefers it.\r\n\r\nThis detached existence only makes Ayale&#x2019;s arrival on the scene more intoxicating. The unofficial king of Boston&#x2019;s Ethiopian community, Ayale is a born hustler - when he turns his attention to the narrator, she feels seen for the first time. Ostensibly a parking lot attendant, Ayale soon proves to have other projects in the works, which the narrator becomes more and more entangled in to her father&#x2019;s growing dismay. By the time the scope of Ayale&#x2019;s schemes - and their repercussions - become apparent, our narrator has unwittingly become complicit in something much bigger and darker than she ever imagined.\r\n\r\nxx","last_updated":"2018-04-26T12:06:38.942Z","parsed":{"xt":"urn:btih:8b6654207b654965bcf6517fae0b4f61ed16791c","dn":"The Parking Lot Attendant by Nafkote Tamirat EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8b6654207b654965bcf6517fae0b4f61ed16791c","infoHashBuffer":{"type":"Buffer","data":[139,102,84,32,123,101,73,101,188,246,81,127,174,11,79,97,237,22,121,28]},"name":"The Parking Lot Attendant by Nafkote Tamirat EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}