{"title":"In Broad Daylight by Patrick Desbois EPUB","magnet":"magnet:?xt=urn:btih:8b82c1d794fa38aec72a81601601f889946a5745&dn=In+Broad+Daylight+by+Patrick+Desbois+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3264106","seeders":"6","leechers":"0","description":"xx\r\n\r\nIn Broad Daylight by Patrick Desbois EPUB\r\n\r\nIn The Holocaust by Bullets, Father Patrick Desbois documented for the first time the murder of 1.5 million Jews in Ukraine during World War II, based on wartime documents, interviews with locals, and the application of modern forensic practices on long-hidden gravesites. Nearly a decade of further work by his team, drawing on interviews with 5,000 neighbors of the Jews, has resulted in stunning new findings about the extent and nature of the genocide.\r\n\r\nThe mass killings took place across the Eastern Front, in seven countries formerly part of the Soviet Union invaded by Nazi Germany. They followed a secret template, or repeatable script, that included a timetable and involved local inhabitants in the mechanics of death to ensure complicity, whether it was to cook for the killers; to clear, dig, and cover the graves; to witness their Jewish neighbors being marched off; or to take part in the slaughter.\r\n\r\nNarrating in lucid, powerful prose that has the immediacy of a crime report, Father Desbois assembles a chilling account of how, concretely, these events took place in village after village, from the selection of the date to the twenty-four-hour period in which the mass murders unfolded. Today, such groups as ISIS put into practice the Nazis&apos; lessons on making genocide efficient.\r\n\r\nxx","last_updated":"2018-01-25T12:09:55.205Z","parsed":{"xt":"urn:btih:8b82c1d794fa38aec72a81601601f889946a5745","dn":"In Broad Daylight by Patrick Desbois EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8b82c1d794fa38aec72a81601601f889946a5745","infoHashBuffer":{"type":"Buffer","data":[139,130,193,215,148,250,56,174,199,42,129,96,22,1,248,137,148,106,87,69]},"name":"In Broad Daylight by Patrick Desbois EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}