{"title":"An Illustrated History of Torture ","magnet":"magnet:?xt=urn:btih:8b99b22f759f5e44b958d68f3eaac83a15903a98&dn=An+Illustrated+History+of+Torture+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"4627116","seeders":"44","leechers":"7","description":" &#x201C;The brank may be described simply as an iron framework; which was placed on the head, closing it in a kind of cage; it had in front a plate of iron, which, either sharpened or covered with spikes, was so situated as to be placed in the mouth of the victim, and if she attempted to move her tongue in any way whatever, it was certain to be shockingly injured. She thus suffered for telling her mind to some petty tyrant in office, or speaking plainly to a wrong-doer, or for taking to task a lazy, and perhaps a drunken husband.&#x201C;\r\n\r\nDive into the macabre history of England and Old Europe in this treasure chest of historical punishments. In the pages of Medieval Punishments are punishments from a less enlightened period, creating a thoroughly researched historical document that sheds light on the evolution of society and how humans have maintained social order and addressed crime.\r\n\r\nIn a town called Newcastle-on-Tyne, a drunkard cloak was a barrel that offenders were made to wear. In Anglo-Saxon times, each town was required to build stocks to hold breakers of the peace. To the Romans, beheading was considered the most honorable of deaths. It&#x2019;s these details that make Medieval Punishments a compelling read for social historians and important component of human history","last_updated":"2018-03-20T12:05:43.486Z","parsed":{"xt":"urn:btih:8b99b22f759f5e44b958d68f3eaac83a15903a98","dn":"An Illustrated History of Torture ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8b99b22f759f5e44b958d68f3eaac83a15903a98","infoHashBuffer":{"type":"Buffer","data":[139,153,178,47,117,159,94,68,185,88,214,143,62,170,200,58,21,144,58,152]},"name":"An Illustrated History of Torture ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}