{"title":"Creative Selection by Ken Kocienda EPUB","magnet":"magnet:?xt=urn:btih:8c19286c761846bc2e5bf9e96358fc968eb6cd33&dn=Creative+Selection+by+Ken+Kocienda+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"12080152","seeders":"36","leechers":"3","description":"xx \r\n\r\nCreative Selection: Inside Apple&apos;s Design Process During the Golden Age of Steve Jobs by Ken Kocienda EPUB \r\n\r\nAn insider&apos;s account of Apple&apos;s creative process during the golden years of Steve Jobs. \r\n\r\nHundreds of millions of people use Apple products every day; several thousand work on Apple&apos;s campus in Cupertino, California; but only a handful sit at the drawing board. \r\n\r\nCreative Selection recounts the life of one of the few who worked behind the scenes, a highly respected software engineer who worked in the final years the Steve Jobs era - the Golden Age of Apple. Ken Kocienda offers an inside look at Apple&#x2019;s creative process. For 15 years, he was on the ground floor of the company as a specialist, directly responsible for experimenting with novel user interface concepts and writing powerful, easy-to-use software for products including the iPhone, the iPad, and the Safari web browser. His stories explain the symbiotic relationship between software and product development for those who have never dreamed of programming a computer and reveal what it was like to work on the cutting edge of technology at one of the world&apos;s most admired companies. \r\n\r\nKocienda shares moments of struggle and success, crisis and collaboration, illuminating each with lessons learned over his Apple career. He introduces the essential elements of innovation - inspiration, collaboration, craft, diligence, decisiveness, taste, and empathy - and uses these as a lens through which to understand productive work culture. An insider&apos;s tale of creativity and innovation at Apple, Creative Selection shows readers how a small group of people developed an evolutionary design model and how they used this methodology to make groundbreaking and intuitive software that countless millions use every day. \r\n\r\nxx","last_updated":"2018-09-11T12:19:50.096Z","parsed":{"xt":"urn:btih:8c19286c761846bc2e5bf9e96358fc968eb6cd33","dn":"Creative Selection by Ken Kocienda EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8c19286c761846bc2e5bf9e96358fc968eb6cd33","infoHashBuffer":{"type":"Buffer","data":[140,25,40,108,118,24,70,188,46,91,249,233,99,88,252,150,142,182,205,51]},"name":"Creative Selection by Ken Kocienda EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}