{"title":"Man is Wolf to Man.Surviving the Gulag","magnet":"magnet:?xt=urn:btih:8c6dde747fc82350fe6b402d179cadcba7223dc9&dn=Man+is+Wolf+to+Man.Surviving+the+Gulag&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"2042851","seeders":"20","leechers":"5","description":"FROM THE BOOK:&quot;The pit I was ordered to dig had the precise dimensions of a casket. The NKVD officer carefully designed it. He measured my size with a stick, made lines on the forest floor, and told me to dig. He wanted to make sure I&apos;d fit well inside.&quot;\r\n\r\nIn 1941 Janusz Bardach&apos;s death sentence was commuted to ten years&apos; hard labor and he was sent to Kolyma&#x2014;the harshest, coldest, and most deadly prison in Joseph Stalin&apos;s labor camp system&#x2014;the Siberia of Siberias. The only English-language memoir since the fall of communism to chronicle the atrocities committed during the Stalinist regime, Bardach&apos;s gripping testimony explores the darkest corners of the human condition at the same time that it documents the tyranny of Stalin&apos;s reign, equal only to that of Hitler. With breathtaking immediacy, a riveting eye for detail, and a humanity that permeates the events and landscapes he describes, Bardach recounts the extraordinary story of this nearly inconceivable world.\r\n\r\nThe story begins with the Nazi occupation when Bardach, a young Polish Jew inspired by Soviet Communism, crosses the border of Poland to join the ranks of the Red Army. His ideals are quickly shattered when he is arrested, court-martialed, and sentenced to death. How Bardach survives an endless barrage of brutality&#x2014;from a near-fatal beating to the harsh conditions and slow starvation of the gulag existence&#x2014;is a testament to human endurance under the most oppressive circumstances. Besides being of great historical significance, Bardach&apos;s narrative is a celebration of life and a vital affirmation of what it means to be human","last_updated":"2018-03-15T12:13:57.513Z","parsed":{"xt":"urn:btih:8c6dde747fc82350fe6b402d179cadcba7223dc9","dn":"Man is Wolf to Man.Surviving the Gulag","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8c6dde747fc82350fe6b402d179cadcba7223dc9","infoHashBuffer":{"type":"Buffer","data":[140,109,222,116,127,200,35,80,254,107,64,45,23,156,173,203,167,34,61,201]},"name":"Man is Wolf to Man.Surviving the Gulag","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}