{"title":"Becoming by Michelle Obama (.epub)","magnet":"magnet:?xt=urn:btih:8c9ee02cf1e7587c81bcad641c143f9badb32781&dn=Becoming+by+Michelle+Obama+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"8635956","seeders":"0","leechers":"0","description":"Becoming by Michelle Obama \r\n\r\nRequirements: .ePUB Reader\r\n\r\nOverview: An intimate, powerful, and inspiring memoir by the former First Lady of the United States\r\n\r\nIn a life filled with meaning and accomplishment, Michelle Obama has emerged as one of the most iconic and compelling women of our era. As First Lady of the United States of America&#x2014;the first African American to serve in that role&#x2014;she helped create the most welcoming and inclusive White House in history, while also establishing herself as a powerful advocate for women and girls in the U.S. and around the world, dramatically changing the ways that families pursue healthier and more active lives, and standing with her husband as he led America through some of its most harrowing moments. Along the way, she showed us a few dance moves, crushed Carpool Karaoke, and raised two down-to-earth daughters under an unforgiving media glare. \r\n\r\nIn her memoir, a work of deep reflection and mesmerizing storytelling, Michelle Obama invites readers into her world, chronicling the experiences that have shaped her&#x2014;from her childhood on the South Side of Chicago to her years as an executive balancing the demands of motherhood and work, to her time spent at the world&#x2019;s most famous address. With unerring honesty and lively wit, she describes her triumphs and her disappointments, both public and private, telling her full story as she has lived it&#x2014;in her own words and on her own terms. Warm, wise, and revelatory, Becoming is the deeply personal reckoning of a woman of soul and substance who has steadily defied expectations&#x2014;and whose story inspires us to do the same.\r\n\r\nGenre: Non-Fiction &gt; Biographies &amp; Memoirs","last_updated":"2018-11-13T12:10:43.003Z","parsed":{"xt":"urn:btih:8c9ee02cf1e7587c81bcad641c143f9badb32781","dn":"Becoming by Michelle Obama (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8c9ee02cf1e7587c81bcad641c143f9badb32781","infoHashBuffer":{"type":"Buffer","data":[140,158,224,44,241,231,88,124,129,188,173,100,28,20,63,155,173,179,39,129]},"name":"Becoming by Michelle Obama (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}