{"title":"Battlezone-Gold Edition *RePack* [RUS/ENG/MULTi11] v.1.08","magnet":"magnet:?xt=urn:btih:8d287e7dc5e14685eae736d0b9daf1c71d1d8e59&dn=Battlezone-Gold+Edition+%2ARePack%2A+%5BRUS%2FENG%2FMULTi11%5D+v.1.08&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"friephtua","categoryP":"games","categoryS":"pc","size":"3438415872","seeders":"1","leechers":"1","description":"Description:\r\nJump into the cabin of the Cobra, the most powerful tank on the planet and immerse yourself in exciting tank fights in the midst of neon-burned futuristic landscapes in an explosive campaign for 1-4 players. Equip your tank with a wide range of destructive weapons and modifications to get to the colossal finale. Now you can conquer battlefields on your PC, even if you do not have VR. The new version of Battlezone Gold Edition includes the game itself, as well as all the add-ons that have been released so far: Sirens pack - Surprise or unite your teammates in Battlezone with one of 10 customizable sirens, including sirens like: ship, clown, sports car, train, motorcycle ... and others! Military camouflage / high-visibility camouflage / safari - Use 15 unique types of camouflage to customize the inner and outer appearance of your Cobras!\r\n\r\n&#x25AA;Put on your VR headset to completely immerse yourself in the dizzying world of Battlezone with an incredible sense of scale and breathtaking battles. \r\n&#x25AA;Use destructive weapons and steep special equipment, from laser-guided missiles and artillery to EMR and improved shields. \r\n&#x25AA;Enjoy an exciting campaign for 1-4 players, where different environments, enemies and missions are mixed together in a procedurally generated campaign. The game shines with new colors every time you pass! \r\n&#x25AA;Discover even more powerful tanks, new types of weapons and special equipment and choose from hundreds of deadly combinations! \r\n&#x25AA;Customize the appearance of your tank with the help of various camouflage, figures and sirens in the edition of Gold Edition!\r\n&#x25AA; Find out how the game started with the Classic mode with the original control of the two caterpillars and the global rating of the players you are competing with!\r\n\r\n&#x25AA;Based on the release of Voksi Game \r\n&#x25AA;version - 1.08 \r\n&#x25AA;Installation ~ 1 min \r\n&#x25AA;RePack from qoob","last_updated":"2018-05-07T12:08:57.260Z","parsed":{"xt":"urn:btih:8d287e7dc5e14685eae736d0b9daf1c71d1d8e59","dn":"Battlezone-Gold Edition *RePack* [RUS/ENG/MULTi11] v.1.08","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8d287e7dc5e14685eae736d0b9daf1c71d1d8e59","infoHashBuffer":{"type":"Buffer","data":[141,40,126,125,197,225,70,133,234,231,54,208,185,218,241,199,29,29,142,89]},"name":"Battlezone-Gold Edition *RePack* [RUS/ENG/MULTi11] v.1.08","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}