{"title":"The Girl Next Door by Ruth Rendell EPUB","magnet":"magnet:?xt=urn:btih:8d39555f8e774be3fac75e7e731bca1f748a617d&dn=The+Girl+Next+Door+by+Ruth+Rendell+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"266698","seeders":"43","leechers":"1","description":"xx\r\n\r\nThe Girl Next Door by Ruth Rendell EPUB\r\n\r\nIn this psychologically explosive story from &quot;one of the most remarkable novelists of her generation&quot; People, the discovery of bones in a tin box sends shockwaves across a group of long-time friends.\r\n\r\nIn the waning months of the second World War, a group of children discover an earthen tunnel in their neighborhood outside London. Throughout the summer of 1944 - until one father forbids it - the subterranean space becomes their &quot;secret garden&quot;, where the friends play games and tell stories.\r\n\r\nSix decades later, beneath a house on the same land, construction workers uncover a tin box containing two skeletal hands, one male and one female. As the discovery makes national news, the friends come together once again, to recall their days in the tunnel for the detective investigating the case. Is the truth buried among these aging friends and their memories?\r\n\r\nThis impromptu reunion causes long-simmering feelings to bubble to the surface. Alan, stuck in a passionless marriage, begins flirting with Daphne, a glamorous widow. Michael considers contacting his estranged father, who sent Michael to live with an aunt after his mother vanished in 1944. Lewis begins remembering details about his Uncle James, an army private who once accompanied the children into the tunnels, and who later disappeared.\r\n\r\nIn The Girl Next Door Rendell brilliantly shatters the assumptions about age, showing that the choices people make - and the emotions behind them - remain as potent in late life as they were in youth.\r\n\r\nxx","last_updated":"2018-09-17T12:25:15.406Z","parsed":{"xt":"urn:btih:8d39555f8e774be3fac75e7e731bca1f748a617d","dn":"The Girl Next Door by Ruth Rendell EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8d39555f8e774be3fac75e7e731bca1f748a617d","infoHashBuffer":{"type":"Buffer","data":[141,57,85,95,142,119,75,227,250,199,94,126,115,27,202,31,116,138,97,125]},"name":"The Girl Next Door by Ruth Rendell EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}