{"title":"Locked In by Victoria Arlen EPUB","magnet":"magnet:?xt=urn:btih:8dc3c9529b1ed2cd05277493f7c2ab4eb5162a92&dn=Locked+In+by+Victoria+Arlen+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2420928","seeders":"3","leechers":"9","description":"xx\r\n\r\nLocked In by Victoria Arlen EPUB\r\n\r\nESPN personality and Paralympics champion Victoria Arlen shares her courageous and miraculous story of recovery after falling into a mysterious vegetative state at age 11 and how she broke free, overcoming the odds and never giving up hope, eventually living a full and inspiring life.\r\n\r\nWhen Victoria Arlen was 11 years old, she contracted two rare diseases simultaneously and fell into a mysterious vegetative state. For two years her mind was dark, but in the third year, her mind broke free, and she was able to think clearly and to hear and feel everything - but no one knew.\r\n\r\nWhen she was 15 years old, against all odds and medical predictions, she was finally able to communicate through eye blinks, and she gradually regained her ability to speak and eat and move her upper body, but she faced the devastating reality of paralysis from the waist down because of damage to her spine. However, Victoria didn&#x2019;t lose her strength or steadfast determination, and two years later, she won a gold medal for swimming at the London 2012 Paralympics.\r\n\r\nIn Locked In, Victoria shares her never-before-published story - the pain, the struggle, the fight to live and thrive, and most importantly, the faith that carried her through. Her journey was not easy, but by believing in God&#x2019;s healing power and forgiveness, she is living proof that, despite seemingly insurmountable odds and challenges, the will to survive and resolve to live can be a force stronger than our worst deterrents.\r\n\r\nNot many people get a second chance at life like Victoria has, and she made a promise to God that she would make every moment count. \r\n\r\nxx","last_updated":"2018-09-02T12:02:48.251Z","parsed":{"xt":"urn:btih:8dc3c9529b1ed2cd05277493f7c2ab4eb5162a92","dn":"Locked In by Victoria Arlen EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8dc3c9529b1ed2cd05277493f7c2ab4eb5162a92","infoHashBuffer":{"type":"Buffer","data":[141,195,201,82,155,30,210,205,5,39,116,147,247,194,171,78,181,22,42,146]},"name":"Locked In by Victoria Arlen EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}