{"title":"Whatsapp-Plus-V6.30 Mod [GeekyApk]","magnet":"magnet:?xt=urn:btih:8e531add782115649db323ea56a7af1dc2178810&dn=Whatsapp-Plus-V6.30+Mod+%5BGeekyApk%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Cracsoft","categoryP":"applications","categoryS":"android","size":"36474550","seeders":"26","leechers":"1","description":"For More Moded Stuff Have A Look www.geekyapk.in\r\nWhatsApp Plus is a great WhatsApp mod version which has a lot of advanced features that normal version doesn&#x2019;t have. A few years back, there was an official WhatsApp Plus app offered for $1/year from WhatsApp Inc. But they just stopped their plus service. Then lots of Android developers tended to make modified versions of WhatsApp Plus with improved advanced features like hiding last seen, hide online status, increased character limit in status, send larger videos and much more amazing features. But the problem was WhatsApp began to ban users who were using modified versions. That is why we&#x2019;re giving you the latest WhatsApp Plus Apk with Anti-Ban (ban proof) mod which is an exclusive feature of it. From here  you can download it for free without any cost. This is 100% risk-free version and you don&#x2019;t have to worry about banning from WhatsApp with this app. You will have to uninstall Google Play version to get installed this version on your Android device. If you want to keep two WhatsApp Accounts at the same time in one device, you can try GBWhatsApp Apk or OGWhatsApp versions. WhatsApp Plus for iOS is not available to download. There is no version for iOS users. As this is not a legal version, you cannot find it on Play Store. You need to download the Apk from our website P This is safe to use and you don&#x2019;t have to worry about it. With WhatsApp Plus Apk you can make video calls which is not offered in the normal version. Download the latest WhatsApp Plus 2017 from our download page by clicking Download button here","last_updated":"2018-05-23T12:13:49.925Z","parsed":{"xt":"urn:btih:8e531add782115649db323ea56a7af1dc2178810","dn":"Whatsapp-Plus-V6.30 Mod [GeekyApk]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8e531add782115649db323ea56a7af1dc2178810","infoHashBuffer":{"type":"Buffer","data":[142,83,26,221,120,33,21,100,157,179,35,234,86,167,175,29,194,23,136,16]},"name":"Whatsapp-Plus-V6.30 Mod [GeekyApk]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}