{"title":"Death by China by Peter W. Navarro, Greg Autry EPUB","magnet":"magnet:?xt=urn:btih:916a355719e90a199962c204dd056cefa38a06fb&dn=Death+by+China+by+Peter+W.+Navarro%2C+Greg+Autry+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1084217","seeders":"0","leechers":"0","description":"xx\r\n\r\nDeath by China by Peter W. Navarro, Greg Autry EPUB\r\n\r\nBest-selling author Peter Navarro (The Coming China Wars) and Greg Autry challenge the dominant paradigm of a &quot;Chinese Miracle&quot; - the one featuring a modernizing, progressive Chinese state heading toward political reform and driving global economic growth with its new found embrace of capitalism and freedom. Tearing this delusion away, Death by China documents the myriad ways that a powerful, wealthy, and corrupt Chinese Communist Party emboldened by a growing nationalistic frenzy is becoming the biggest threat to global peace, prosperity, and health since Nazi Germany.\r\n\r\nFrom currency manipulation and abusive trade policies, to slave labor and deadly consumer products, China&apos;s ruthless rulers threaten the livelihood of the citizens of every developed nation. These thugs have created a frightening, amoral society ruled by a constant fear hidden to outsiders and bought off with the ill-gotten profits of a myopic quest for economic advantage at any cost - social, environmental, or civil rights concerns be damned. Worse, as with everything else, China is scaling and exporting this model around this world, threatening its neighbors and exploiting developing nations across the globe with a new imperialism.\r\n\r\nWhile America worries that Al Qaeda or Iran might get their hands on a weapon of mass destruction, China is using our Wal-Mart dollars to build them by the score, filling brand new nuclear submarines with missiles aimed at our heartland and building stealth planes designed to obliterate our friends in Japan, Korea, and Taiwan.\r\n\r\nAmerica&apos;s policy of appeasement and perpetual bending to Beijing&apos;s tacit threat to stop funding our unsustainable consumption-based economy and deficit-addicted government has left the Chinese people and the world in a frightening position while achieving absolutely nothing. With each new attempt at further &quot;engagement&quot;, China simply rounds up more artists, writers, and political dissidents into its gulags and continues its policies of virtual genocide against the peoples of Tibet and the Uighars of East Turkestan. It tightens control over media and the Internet and expands its regional, territorial, and resource claims. Laughing at our timidity, it becomes ever bolder in executing its plan to shutter every last manufacturing plant in the West.\r\n\r\n..\r\n\r\nxx","last_updated":"2018-03-11T12:01:00.567Z","parsed":{"xt":"urn:btih:916a355719e90a199962c204dd056cefa38a06fb","dn":"Death by China by Peter W. Navarro, Greg Autry EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"916a355719e90a199962c204dd056cefa38a06fb","infoHashBuffer":{"type":"Buffer","data":[145,106,53,87,25,233,10,25,153,98,194,4,221,5,108,239,163,138,6,251]},"name":"Death by China by Peter W. Navarro, Greg Autry EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}