{"title":"The Soldier by Neal Asher EPUB","magnet":"magnet:?xt=urn:btih:91e9a3fe8f501795ad4a3067a0ba3beddcedfb94&dn=The+Soldier+by+Neal+Asher+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"551130","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Soldier by Neal Asher EPUB\r\n\r\nHumanity, artificial intelligences, and monstrous aliens clash over control of deadly technology in this explosive beginning to Neal Asher&#x2019;s newest Polity series.\r\n\r\nIn a far corner of space, on the very borders between humanity&#x2019;s Polity worlds and the kingdom of the vicious crab-like prador, is an immediate threat to all sentient life: an accretion disc, a solar system designed by the long-dead Jain race and swarming with living technology powerful enough to destroy entire civilizations. \r\n\r\nNeither the Polity or the prador want the other in full control of the disc, so they&#x2019;ve placed an impartial third party in charge of the weapons platform guarding the technology from escaping into the galaxy: Orlandine, a part-human, part-AI haiman. She&#x2019;s assisted by Dragon, a mysterious, spaceship-sized alien entity who has long been suspicious of Jain technology and who suspects the disc is a trap lying-in-wait. \r\n\r\nMeanwhile, the android Angel is planning an attack on the Polity, and is searching for a terrible weapon to carry out his plans - a Jain super-soldier. But what exactly the super-soldier is, and what it could be used for if it fell into the wrong hands, will bring Angel and Orlandine&#x2019;s missions to a head in a way that could forever change the balance of power in the Polity universe. \r\n\r\nIn The Soldier, British science fiction writer Neal Asher kicks off another Polity-based trilogy in signature fashion, concocting a mind-melting plot filled with far-future technology, lethal weaponry, and bizarre alien creations.\r\n\r\nxx","last_updated":"2018-05-16T12:01:18.902Z","parsed":{"xt":"urn:btih:91e9a3fe8f501795ad4a3067a0ba3beddcedfb94","dn":"The Soldier by Neal Asher EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"91e9a3fe8f501795ad4a3067a0ba3beddcedfb94","infoHashBuffer":{"type":"Buffer","data":[145,233,163,254,143,80,23,149,173,74,48,103,160,186,59,237,220,237,251,148]},"name":"The Soldier by Neal Asher EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}