{"title":"Hayim Nahman Bialik - Book of Legends and other prose (4 books)","magnet":"magnet:?xt=urn:btih:925efd88229b83e9dc41c9b4bb34f307b7e69604&dn=Hayim+Nahman+Bialik+-+Book+of+Legends+and+other+prose+%284+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"34230689","seeders":"45","leechers":"6","description":"\nHAYIM NAHMAN BIALIK (1873-1934) was a Russian-Jewish poet, esteemed for expressing in his verse the yearnings of the Jewish people and for making the modern Hebrew language a flexible medium of poetic expression.  His influence is felt deeply in all modern Hebrew literature and he ultimately came to be recognized as Israel&apos;s national poet.\n\nAlthough most famous for his poetry (not included here), Bialik was also a master of Hebrew prose.  Often expressing a realism and social awareness associated with the Russia of his youth, Bialik&apos;s stories and novellas showcase his extraordinary gift for lyricism, his deft use of symbolism, and his sense of humor, captured in engaging vignettes of life in the Ukrainian countryside.\n\nIn collaboration with Yehoshua Ravnitzky, he published THE BOOK OF LEGENDS / Sefer HaAggadah (1908-1911), a three-volume edition of the folk tales, parables and proverbs scattered through classical Rabbinic literature.  They selected hundreds of texts and arranged them thematically -- a captivating melange of wisdom and piety, fantasy and satire.  The book was immediately hailed as a masterpiece and has been reprinted numerous times.\n\n\nThe following books are in PDF format:\n\n* Aftergrowth &amp; Other Stories (JPS, 1939). Translated by I.M. Last.\n\n* And It Came to Pass: Legends and Stories about King David and King Solomon (Hebrew Publishing, 1938).  Translated by Herbert Danby.\n\n* Book of Legends / Sefer Ha-Aggadah: Legends from the Talmud and Midrash (Schocken, 1992).  Edited by Hayim Nahman Bialik and Yehoshua Hana Ravnitzky.\n\n* Random Harvest: The Novellas of Bialik (Westview, 1999).  Translated by David Patterson and Ezra Spicehandler.\n\n____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-06-10T12:14:05.396Z","parsed":{"xt":"urn:btih:925efd88229b83e9dc41c9b4bb34f307b7e69604","dn":"Hayim Nahman Bialik - Book of Legends and other prose (4 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"925efd88229b83e9dc41c9b4bb34f307b7e69604","infoHashBuffer":{"type":"Buffer","data":[146,94,253,136,34,155,131,233,220,65,201,180,187,52,243,7,183,230,150,4]},"name":"Hayim Nahman Bialik - Book of Legends and other prose (4 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}