{"title":"God's Blueprint.epub","magnet":"magnet:?xt=urn:btih:93a011c4be55965872d95bab2d0885ab15f8ada5&dn=God%27s+Blueprint.epub&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"CopperSun","categoryP":"other","categoryS":"e_books","size":"973948","seeders":"29","leechers":"2","description":"God&apos;s Blueprint: Scientific Evidence that the Earth was Created to Produce Humans \r\n\r\nBy Christopher Knight\r\n\r\nPublished by Watkins in 2015-Epub \r\n\r\nDescription\r\n\r\nFrom the co-author of the international bestseller Who Built the Moon? comes this well-researched scientific study of the possibility of a divine creator &#x2013; or God\r\n\r\nThis book puts the idea of God on trial. Whilst the case has been hotly disputed over recent generations with scientists on one side and theologians on the other, evidence either way has been thin on the ground. Faith - belief without evidence - has been the basis for the world&apos;s major religions. Most scientists reject the notion of God because they require factual, empirical evidence in order to accept any proposition as being real. However, new information has become available, which appears to provide hard-nosed evidence of God&apos;s existence. Can faith be replaced by understanding, and can scientists formally embrace, once again, the concept of a supreme being as they did in Isaac Newton&apos;s day? Nothing less than God&apos;s &apos;blueprint&apos; appears to have been discovered - found by chance by the author while researching the science of the Neolithic (late Stone Age) people of western Europe. The case will be tried taking the evidence step-by-step. You, the reader, are the jury. You must evaluate the evidence as the proceedings develop and, to aid you, there will be a brief summing up at the end of each section.At the close of the book you are asked to make a judgment as to whether the case is proven or not. Does God exist?","last_updated":"2018-07-22T12:13:54.025Z","parsed":{"xt":"urn:btih:93a011c4be55965872d95bab2d0885ab15f8ada5","dn":"God's Blueprint.epub","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"93a011c4be55965872d95bab2d0885ab15f8ada5","infoHashBuffer":{"type":"Buffer","data":[147,160,17,196,190,85,150,88,114,217,91,171,45,8,133,171,21,248,173,165]},"name":"God's Blueprint.epub","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}