{"title":"All the Single Ladies by Rebecca Traister EPUB","magnet":"magnet:?xt=urn:btih:93a4bd43a2cf3a04892571af062c2b01b9b99d36&dn=All+the+Single+Ladies+by+Rebecca+Traister+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1509837","seeders":"0","leechers":"0","description":"xx\r\n\r\nAll the Single Ladies by Rebecca Traister EPUB\r\n\r\nIn a provocative, groundbreaking work, National Magazine Award finalist Rebecca Traister, &quot;the most brilliant voice on feminism in this country&quot; (Anne Lamott), traces the history of unmarried women in America who, through social, political, and economic means, have radically shaped our nation.\r\n\r\nFor legions of women, living single isn&apos;t news; it&apos;s life. In 2009, the award-winning journalist Rebecca Traister started All the Single Ladies - a book she thought would be a work of contemporary journalism - about the 21st-century phenomenon of the American single woman. It was the year the proportion of American women who were married dropped below 50 percent, and the median age of first marriages, which had remained between 20 and 22 years old for nearly a century (1890-1980), had risen dramatically to 27.\r\n\r\nBut over the course of her vast research and more than 100 interviews with academics, social scientists, and prominent single women, Traister discovered a startling truth: The phenomenon of the single woman in America is not a new one. And historically, when women were given options beyond early heterosexual marriage, the results were massive social change - temperance, abolition, secondary education, and more. Today, only 20 percent of Americans are wed by age 29, compared to nearly 60 percent in 1960. The Population Reference Bureau calls it a &quot;dramatic reversal&quot;.\r\n\r\nAll the Single Ladies is a remarkable portrait of contemporary American life and how we got here, through the lens of the single American woman. Covering class, race, and sexual orientation and filled with vivid anecdotes from fascinating contemporary and historical figures, All the Single Ladies is destined to be a classic work of social history and journalism. Exhaustively researched, brilliantly balanced, and told with Traister&apos;s signature wit and insight, this book should be shelved alongside Gail Collins&apos; When Everything Changed.\r\n\r\nxx","last_updated":"2018-02-05T12:00:36.898Z","parsed":{"xt":"urn:btih:93a4bd43a2cf3a04892571af062c2b01b9b99d36","dn":"All the Single Ladies by Rebecca Traister EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"93a4bd43a2cf3a04892571af062c2b01b9b99d36","infoHashBuffer":{"type":"Buffer","data":[147,164,189,67,162,207,58,4,137,37,113,175,6,44,43,1,185,185,157,54]},"name":"All the Single Ladies by Rebecca Traister EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}