{"title":"Junichiro Tanizaki - Novels, Short Stories and Memoir (15 books)","magnet":"magnet:?xt=urn:btih:940b927c4ab332591a003d9bcca871b77c54d4b3&dn=Junichiro+Tanizaki+-+Novels%2C+Short+Stories+and+Memoir+%2815+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"33985034","seeders":"0","leechers":"0","description":"\nJUN&apos;ICHIRO TANIZAKI (1886-1965) was one of the major writers of modern Japanese literature, and perhaps the most popular Japanese novelist after Natsume Soseki.  Some of his works present a shocking world of sexuality and destructive erotic obsessions.  Others, less sensational, subtly portray the dynamics of family life in the context of the rapid changes in 20th-century Japanese society.  Frequently his stories are narrated in the context of a search for cultural identity in which constructions of &quot;the West&quot; and &quot;Japanese tradition&quot; are juxtaposed.\n\nTanizaki&apos;s earliest stories show affinities with Edgar Allan Poe and the French Decadents.  In &quot;The Tattooer&quot; (1910), for example, a tattoo artist inscribes a giant spider on the body of a beautiful young woman, after which the woman&apos;s beauty takes on a demonic, compelling power, in which eroticism is combined with sado-masochism.  In the aftermath of the earthquake in 1923, Tanizaki moved to Kyoto where his youthful love for the imagined West and modernity was redirected into a renewed interest in traditional Japanese aesthetics, culture, and ideals of beauty.  His first truly successful novel was NAOMI (1924-25), a tragicomic exploration of class, sexual obsession, and cultural identity.  SOME PREFER NETTLES (1929), one of his finest works, reflects the change in his own system of values, describing marital unhappiness that is in fact a conflict between the new and the old, with the implication that the old will win.  His renewed interest in classical Japanese literature culminated in his multiple translations into modern Japanese of the eleventh-century classic &quot;The Tale of Genji&quot; and in his masterpiece THE MAKIOKA SISTERS (1943-48), a detailed characterization of four daughters of a wealthy Osaka merchant family who see their traditional way of life slipping away in the early years of World War II.\n\nHis first major post-war work was CAPTAIN SHIGEMOTO&apos;S MOTHER (1949-50), which includes a restatement of Tanizaki&apos;s frequent theme of a son&apos;s longing for his mother.  The novel also introduces a new theme, sexuality in old age, which reappears in later works.  For example, THE KEY (1956) is a psychological novel in which an aging professor arranges for his wife to commit adultery in order to boost his own sagging sexual desires, while in one of his last novels, DIARY OF A MAD OLD MAN (1961-62), the elderly diarist is struck down by a stroke brought on by an excess of sexual excitement.\n\n\nThe following books are in ePUB and/or PDF format as noted:\n\n* A Cat, a Man, and Two Women (Kodansha, 1990).  Paul McCarthy, trans. -- PDF\n* Childhood Years: A Memoir (Kodansha, 1988).  Paul McCarthy, trans. -- PDF\n* Diary of a Mad Old Man (Vintage, 1991).  Howard Hibbett, trans. -- PDF\n* Gourmet Club, The (Michigan, 2017).  Chambers &amp; McCarthy, trans. -- ePUB + PDF\n* In Black and White (Columbia, 2017).  Phyllis Lyons, trans. -- ePUB\n* In Praise of Shadows (Leetes Island, 1977).  Thomas Harper, trans. -- ePUB + PDF\n* Key, The (Vintage, 1991).  Howard Hibbett, trans. -- PDF\n* Makioka Sisters, The (Vintage, 2000).  Edward Seidensticker, trans. -- ePUB\n* Naomi (North Point, 1985).  Anthony Chambers, trans. -- ePUB + PDF\n* Quicksand (Vintage, 1994).  Howard Hibbett, trans. -- ePUB\n* Red Roofs &amp; Other Stories (Michigan, 2016).  Chambers &amp; McCarthy, trans. -- ePUB\n* Reed Cutter / Captain Shigemoto&apos;s Mother (Knopf, 1994). Chambers, trans. -- PDF\n* Secret History of the Lord of Musashi / Arrowroot (Vintage, 1982) -- ePUB\n* Seven Japanese Tales (Tuttle, 1967 / Vintage, 1996).  Hibbett, trans. -- ePUB + PDF\n* Some Prefer Nettles (Tuttle, 1955).  Edward G Seidensticker, trans. -- ePUB\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-09-09T12:03:41.048Z","parsed":{"xt":"urn:btih:940b927c4ab332591a003d9bcca871b77c54d4b3","dn":"Junichiro Tanizaki - Novels, Short Stories and Memoir (15 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"940b927c4ab332591a003d9bcca871b77c54d4b3","infoHashBuffer":{"type":"Buffer","data":[148,11,146,124,74,179,50,89,26,0,61,155,204,168,113,183,124,84,212,179]},"name":"Junichiro Tanizaki - Novels, Short Stories and Memoir (15 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}