{"title":"Callings: The Purpose and Passion of Work by David Isay EPUB","magnet":"magnet:?xt=urn:btih:941459428d43ebc8be9a40ff91b10a537e128627&dn=Callings%3A+The+Purpose+and+Passion+of+Work+by+David+Isay+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4098717","seeders":"24","leechers":"12","description":"xx \r\n\r\nCallings: The Purpose and Passion of Work by David Isay EPUB \r\n\r\nIn Callings, StoryCorps founder Dave Isay presents unforgettable stories from people doing what they love. Some are paid well for their work, others not at all; some found their paths at very young ages, others later in life; many overcame great odds or upturned their lives in order to pursue what matters to them. Many of these stories have never been published or broadcast by StoryCorps until now. \r\n\r\nWe meet a man from the barrios of Texas whose harrowing experiences in a family of migrant farmers inspired him to become a public defender. We meet a longtime waitress who takes pride in making regulars and newcomers alike feel at home in her Nashville diner. We meet a young man on the South Side of Chicago who became a teacher in order to help at-risk teenagers like the ones who killed his father get on the right track. We meet a woman from Little Rock who helps former inmates gain the skills and confidence they need to rejoin the workforce. Together they demonstrate how work can be about much more than just making a living, that chasing dreams and finding inspiration in unexpected places can transform a vocation into a calling. Their shared senses of passion, honor, and commitment brings deeper meaning and satisfaction to every aspect of their lives. \r\n\r\nAn essential contribution to the beloved StoryCorps collection, Callings is an inspiring tribute to rewarding work and the American pursuit of happiness. \r\n\r\nxx","last_updated":"2018-04-23T12:02:35.327Z","parsed":{"xt":"urn:btih:941459428d43ebc8be9a40ff91b10a537e128627","dn":"Callings: The Purpose and Passion of Work by David Isay EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"941459428d43ebc8be9a40ff91b10a537e128627","infoHashBuffer":{"type":"Buffer","data":[148,20,89,66,141,67,235,200,190,154,64,255,145,177,10,83,126,18,134,39]},"name":"Callings: The Purpose and Passion of Work by David Isay EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}