{"title":"The Lake House by Kate Morton EPUB","magnet":"magnet:?xt=urn:btih:9493910928997bedbbd945dde7406b8f6ae12270&dn=The+Lake+House+by+Kate+Morton+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"674073","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Lake House by Kate Morton EPUB\r\n\r\nLiving on her family&#x2019;s gorgeous lakeside estate in Cornwall, England, Alice Edevane is a bright, clever, inquisitive, innocent, and precociously talented 14 year old who loves to write stories. But the mysteries she pens are no match for the one her family is about to endure....\r\n\r\nOne midsummer&#x2019;s eve, after a beautiful party drawing hundreds of guests to the estate has ended, the Edevanes discover that their youngest son, Theo, has vanished without a trace. What follows is a tragedy that tears the family apart in ways they never imagined, leaving their estate as empty as their broken hearts.\r\n\r\nNearly 60 years later, having enjoyed a long, successful career as an author, Alice is now 80 years old and living in London. Theo&#x2019;s case has never been solved, though Alice still harbours a suspicion as to the culprit.\r\n\r\nMiles away, Sadie Sparrow, a young detective in the London police force, is staying at her grandfather&#x2019;s house in Cornwall. While out walking one day, she stumbles upon the old estate - now crumbling and covered with vines, clearly abandoned long ago. Her curiosity is sparked, setting off a series of events that will bring her and Alice together and reveal shocking truths about a past long gone... yet more present than ever.\r\n\r\nA lush, atmospheric tale of intertwined destinies, this latest novel from a masterful storyteller is spellbinding and satisfying.\r\n\r\nxx","last_updated":"2018-03-23T12:02:38.487Z","parsed":{"xt":"urn:btih:9493910928997bedbbd945dde7406b8f6ae12270","dn":"The Lake House by Kate Morton EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9493910928997bedbbd945dde7406b8f6ae12270","infoHashBuffer":{"type":"Buffer","data":[148,147,145,9,40,153,123,237,187,217,69,221,231,64,107,143,106,225,34,112]},"name":"The Lake House by Kate Morton EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}