{"title":"Don't Even Think About It by George Marshall EPUB","magnet":"magnet:?xt=urn:btih:94e591aea0c0f38dd75e650535d24b2ada28060b&dn=Don%27t+Even+Think+About+It+by+George+Marshall+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"384742","seeders":"0","leechers":"0","description":"xx\r\n\r\nDon&apos;t Even Think About It by George Marshall EPUB\r\n\r\nMost of us recognize that climate change is real, and yet we do nothing to stop it. What is this psychological mechanism that allows us to know something is true but act as if it is not? George Marshall&apos;s search for the answers brings him face to face with Nobel Prize-winning psychologists and the activists of the Texas Tea Party; the world&apos;s leading climate scientists and the people who denounce them; liberal environmentalists and conservative evangelicals. What he discovered is that our values, assumptions, and prejudices can take on lives of their own, gaining authority as they are shared, dividing people in their wake.\r\n\r\nWith engaging stories and drawing on years of his own research, Marshall argues that the answers do not lie in the things that make us different and drive us apart, but rather in what we all share: how our human brains are wired - our evolutionary origins, our perceptions of threats, our cognitive blind spots, our love of storytelling, our fear of death, and our deepest instincts to defend our family and tribe. Once we understand what excites, threatens, and motivates us, we can rethink and reimagine climate change, for it is not an impossible problem. Rather, it is one we can halt if we can make it our common purpose and common ground. Silence and inaction are the most persuasive of narratives, so we need to change the story. In the end, Don&apos;t Even Think About It is both about climate change and about the qualities that make us human and how we can grow as we deal with the greatest challenge we have ever faced.\r\n\r\nxx","last_updated":"2018-11-25T12:01:18.240Z","parsed":{"xt":"urn:btih:94e591aea0c0f38dd75e650535d24b2ada28060b","dn":"Don't Even Think About It by George Marshall EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"94e591aea0c0f38dd75e650535d24b2ada28060b","infoHashBuffer":{"type":"Buffer","data":[148,229,145,174,160,192,243,141,215,94,101,5,53,210,75,42,218,40,6,11]},"name":"Don't Even Think About It by George Marshall EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}