{"title":"Good and Mad by Rebecca Traister EPUB","magnet":"magnet:?xt=urn:btih:95246aaba8a2d08127dd7dff1e5a942726ad5b22&dn=Good+and+Mad+by+Rebecca+Traister+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3402755","seeders":"0","leechers":"0","description":"xx\r\n\r\nGood and Mad: The Revolutionary Power of Women&apos;s Anger by Rebecca Traister EPUB\r\n\r\nFrom Rebecca Traister, the New York Times best-selling author of All the Single Ladies - whom Anne Lamott called &apos;the most brilliant voice on feminism in this country&apos; - comes a vital, incisive exploration into the transformative power of female anger and its ability to transcend into a political movement.\r\n\r\nIn the year 2018, it seems as if women&#x2019;s anger has suddenly erupted into the public conversation. But long before Pantsuit Nation, before the Women&#x2019;s March and before the #MeToo movement, women&#x2019;s anger was not only politically catalytic - but politically problematic. The story of female fury and its cultural significance demonstrates the long history of bitter resentment that has enshrouded women&#x2019;s slow rise to political power in America as well as the ways that anger is received when it comes from women as opposed to when it comes from men.\r\n\r\nWith eloquence and fervour, Rebecca tracks the history of female anger as political fuel - from suffragettes chaining themselves to the White House to office workers vacating their buildings after Clarence Thomas was confirmed to the Supreme Court. Here Traister explores women&#x2019;s anger at both men and other women, anger between ideological allies and foes and the varied ways anger is perceived based on its owner as well as the history of caricaturing and delegitimising female anger and the way women&#x2019;s collective fury has become transformative political fuel - as is most certainly occurring today. She deconstructs society&#x2019;s (and the media&#x2019;s) condemnation of female emotion (notably, rage) and the impact of their resulting repercussions.\r\n\r\nHighlighting a double standard perpetuated against women by all sexes and its disastrous, stultifying effect, Traister&#x2019;s latest is timely and crucial. It offers a glimpse into the galvanising force of women&#x2019;s collective anger, which, when harnessed, can change history.\r\n\r\nxx","last_updated":"2018-10-03T12:01:06.226Z","parsed":{"xt":"urn:btih:95246aaba8a2d08127dd7dff1e5a942726ad5b22","dn":"Good and Mad by Rebecca Traister EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"95246aaba8a2d08127dd7dff1e5a942726ad5b22","infoHashBuffer":{"type":"Buffer","data":[149,36,106,171,168,162,208,129,39,221,125,255,30,90,148,39,38,173,91,34]},"name":"Good and Mad by Rebecca Traister EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}