{"title":"Shadow of the Fox (Shadow of the Fox, Book 1) by Julie Kagawa EP","magnet":"magnet:?xt=urn:btih:9559e28aa3c8a4b090c4948467bc7508b533fe3d&dn=Shadow+of+the+Fox+%28Shadow+of+the+Fox%2C+Book+1%29+by+Julie+Kagawa+EP&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"491824","seeders":"0","leechers":"0","description":"xx\r\n\r\nShadow of the Fox (Shadow of the Fox, Book 1) by Julie Kagawa EPUB\r\n\r\nOne thousand years ago, the great Kami Dragon was summoned to grant a single terrible wish - and the land of Iwagoto was plunged into an age of darkness and chaos.\r\n\r\nNow, for whoever holds the Scroll of a Thousand Prayers, a new wish will be granted. A new age is about to dawn. \r\n\r\nRaised by monks in the isolated Silent Winds temple, Yumeko has trained all her life to hide her yokai nature. Half kitsune, half human, her skill with illusion is matched only by her penchant for mischief. Until the day her home is burned to the ground, her adoptive family is brutally slain and she is forced to flee for her life with the temple&#x2019;s greatest treasure - one part of the ancient scroll. \r\n\r\nThere are many who would claim the dragon&#x2019;s wish for their own. Kage Tatsumi, a mysterious samurai of the Shadow Clan, is one such hunter, under orders to retrieve the scroll...at any cost. Fate brings Kage and Yumeko together. With a promise to lead him to the scroll, an uneasy alliance is formed, offering Yumeko her best hope for survival. But he seeks what she has hidden away, and her deception could ultimately tear them both apart. \r\n\r\nWith an army of demons at her heels and the unlikeliest of allies at her side, Yumeko&#x2019;s secrets are more than a matter of life or death. They are the key to the fate of the world itself. \r\n\r\nNew from the New York Times best-selling author of The Talon Saga and The Iron Fey. Fans of Sarah J. Maas, Julie C. Dao, Marie Lu, Cassandra Clare, and more best-selling YA fantasy will be captivated by book one of this enchanting new series.\r\n\r\n&#x201C;One of my all-time favorite fantasy novels! I&apos;m in love with this book, its characters, its worldbuilding!&#x201D; (Ellen Oh, author of the Prophecy and Spirit Hunters series)\r\n\r\nxx","last_updated":"2018-10-02T12:25:08.244Z","parsed":{"xt":"urn:btih:9559e28aa3c8a4b090c4948467bc7508b533fe3d","dn":"Shadow of the Fox (Shadow of the Fox, Book 1) by Julie Kagawa EP","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9559e28aa3c8a4b090c4948467bc7508b533fe3d","infoHashBuffer":{"type":"Buffer","data":[149,89,226,138,163,200,164,176,144,196,148,132,103,188,117,8,181,51,254,61]},"name":"Shadow of the Fox (Shadow of the Fox, Book 1) by Julie Kagawa EP","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}