{"title":"Merchants in the Temple by Gianluigi Nuzzi EPUB","magnet":"magnet:?xt=urn:btih:959f6d42ae1e6edffdeedcf5adaa4c1935a1ce7b&dn=Merchants+in+the+Temple+by+Gianluigi+Nuzzi+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"690199","seeders":"0","leechers":"0","description":"xx\r\n\r\nMerchants in the Temple by Gianluigi Nuzzi EPUB\r\n\r\nFrom a best-selling author with unprecedented access to Pope Francis, an investigative look at the recent financial scandals at the highest levels of the Vatican.\r\n\r\nA veritable war is waging in the church: On one side there is Pope Francis&apos; strong message for one church of the poor and all; on the other there is the old Curia, with its endless enemies, and the old and new lobbies struggling to preserve their not-so-Christian privileges. The old guard do not back down; they are ready to use all means necessary to stay in control and continue the immoral way they conduct their business. They resist reforms sought by Pope Francis and seek to delegitimize their opponents, to isolate those who want to eliminate corruption. It&apos;s a war that will determine the future of the church. And if he loses the battle against secular interests and blackmail, Pope Francis could resign, much like his predecessor.\r\n\r\nBased on confidential information - including top-secret documents from inside the Vatican and actual transcripts of Pope Francis&apos; admonishments to the papal court about the lack of financial oversight and responsibility - Merchants in the Temple illustrates all the undercover work conducted by the Pope since his election and shows the reader who his real enemies are. It reveals the instruments Francis is using to reform the Vatican and rid it, once and for all, of the overwhelming corruption traditionally encrusted in the Roman Catholic Church. Merchants in the Temple is a startling book that will shock every reader. It&apos;s a story worthy of a Dan Brown novel, with its electrifying details of the trickery and scheming against the papacy - except that it is real.\r\n\r\nxx","last_updated":"2018-03-19T12:00:27.541Z","parsed":{"xt":"urn:btih:959f6d42ae1e6edffdeedcf5adaa4c1935a1ce7b","dn":"Merchants in the Temple by Gianluigi Nuzzi EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"959f6d42ae1e6edffdeedcf5adaa4c1935a1ce7b","infoHashBuffer":{"type":"Buffer","data":[149,159,109,66,174,30,110,223,253,238,220,245,173,170,76,25,53,161,206,123]},"name":"Merchants in the Temple by Gianluigi Nuzzi EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}