{"title":"DNP Education, Practice, and Policy, Second Edition","magnet":"magnet:?xt=urn:btih:961d02613ed623c743872dcc1803daec2171bcb2&dn=DNP+Education%2C+Practice%2C+and+Policy%2C+Second+Edition&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"bookflare","categoryP":"other","categoryS":"e_books","size":"5217472","seeders":"12","leechers":"7","description":"Description\r\nFirst edition named a 2013 Doody&#x2019;s Core Title&#x2015;5 stars! The second edition of this distinguished text&#x2015;designed for use across the entire DNP curriculum&#x2015;defines practice scholarship for the DNP-prepared professional nurse and promotes the development of key leadership skills needed to effectively influence healthcare policy and improve outcomes. Weaving the eight AACN DNP competencies throughout, the second edition clarifies, updates, and demonstrates their application. The text incorporates updates to the AACN&#x2019;s 2015 position statement, The DNP: Current Issues and Clarifying Recommendations, and the Institute of Medicine&#x2019;s The Future of Nursing report, and delivers new content from nationally recognized nurse leaders.\r\nFocusing heavily on improving aggregate care, strengthening leadership roles, and influencing health policy, the second edition continues to address APRN and nurse executive roles, health information technology, outcomes measurement, and the relationship of the DNP graduate to ongoing scholarship. The text&#x2019;s challenging and thoughtprovoking content is of particular value not only to students, but also to professors who will welcome the clarity it offers to the highly complex DNP curriculum.\r\n\r\nNew to the Second Edition:\r\nReflects the most current thinking about the DNP degree and clarifies recommendations from the AACN task force on implementing the DNP curriculum\r\nIncorporates recommendations of the Institute of Medicine&#x2019;s The Future of Nursing report\r\nDemonstrates the application of core competencies to practice and aggregate care\r\nOffers contemporary examples of DNP competencies and role integration\r\nFocuses primarily on developing key leadership skills for influencing healthcare policy and improving outcomes\r\nDelivers new content from nationally recognized nurse leaders","last_updated":"2018-07-08T12:08:25.977Z","parsed":{"xt":"urn:btih:961d02613ed623c743872dcc1803daec2171bcb2","dn":"DNP Education, Practice, and Policy, Second Edition","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"961d02613ed623c743872dcc1803daec2171bcb2","infoHashBuffer":{"type":"Buffer","data":[150,29,2,97,62,214,35,199,67,135,45,204,24,3,218,236,33,113,188,178]},"name":"DNP Education, Practice, and Policy, Second Edition","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}