{"title":"Real Magic: Ancient Wisdom, Modern .. by Dean Radin EPUB","magnet":"magnet:?xt=urn:btih:98a2657374b32a137c8873359904f4ae6425dbe7&dn=Real+Magic%3A+Ancient+Wisdom%2C+Modern+..+by+Dean+Radin+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3639547","seeders":"86","leechers":"17","description":"xx\r\n\r\nReal Magic: Ancient Wisdom, Modern Science .. by Dean Radin EPUB\r\n\r\nThe chief scientist at the Institute of Noetic Sciences (IONS) turns a critical eye toward such practices as telepathy, clairvoyance, precognition, and psychokinesis. Are such powers really possible? Science says yes.\r\n\r\nAccording to noted scientist and best-selling author of The Conscious Universe, Dean Radin, magic is a natural aspect of reality, and each of us can tap into this power with diligent practice.\r\n\r\nBut wait, aren&apos;t things like ESP and telepathy just wishful thinking and flights of the imagination? Not according to the author, who worked on the US government&apos;s top secret psychic espionage program known as Stargate. Radin has spent the last 40 years conducting controlled experiments that demonstrate that thoughts are things, that we can sense others&apos; emotions and intentions from a distance, that intuition is more powerful than we thought, and that we can tap into the power of intention (think The Secret, only on a more realistic and scientific level). These dormant powers can help us to lead more interesting and fulfilling lives.\r\n\r\nBeginning with a brief history of magic over the centuries (what was called magic 2,000 years ago is turning out to be scientific fact today), a review of the scientific evidence for magic, a series of simple but effective magical techniques (the key is mental focus, something elite athletes know a lot about), Radin then offers a vision of a scientifically informed magic and explains why magic will play a key role in frontiers of science.\r\n\r\nxx","last_updated":"2018-04-12T17:57:00.687Z","parsed":{"xt":"urn:btih:98a2657374b32a137c8873359904f4ae6425dbe7","dn":"Real Magic: Ancient Wisdom, Modern .. by Dean Radin EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"98a2657374b32a137c8873359904f4ae6425dbe7","infoHashBuffer":{"type":"Buffer","data":[152,162,101,115,116,179,42,19,124,136,115,53,153,4,244,174,100,37,219,231]},"name":"Real Magic: Ancient Wisdom, Modern .. by Dean Radin EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}