{"title":"The Conspiracy against the Human Race by Thomas Ligotti (.epub)","magnet":"magnet:?xt=urn:btih:9a0cbdf47527d3d4b2cfa6fa07519d2e5a1a8037&dn=The+Conspiracy+against+the+Human+Race+by+Thomas+Ligotti+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"1193555","seeders":"35","leechers":"0","description":"The Conspiracy against the Human Race: A Contrivance of Horror by Thomas Ligotti\r\nRequirements: .ePUB reader\r\n\r\nOverview: In Thomas Ligotti&apos;s first nonfiction outing, an examination of the meaning (or meaninglessness) of life through an insightful, unsparing argument that proves the greatest horrors are not the products of our imagination but instead are found in reality. \r\n\r\n&quot;There is a signature motif discernible in both works of philosophical pessimism and supernatural horror. It may be stated thus: Behind the scenes of life lurks something pernicious that makes a nightmare of our world.&quot; \r\n\r\nHis fiction is known to be some of the most terrifying in the genre of supernatural horror, but Thomas Ligotti&apos;s first nonfiction book may be even scarier. Drawing on philosophy, literature, neuroscience, and other fields of study, Ligotti takes the penetrating lens of his imagination and turns it on his audience, causing them to grapple with the brutal reality that they are living a meaningless nightmare, and anyone who feels otherwise is simply acting out an optimistic fallacy. At once a guidebook to pessimistic thought and a relentless critique of humanity&apos;s employment of self-deception to cope with the pervasive suffering of their existence, The Conspiracy against the Human Race may just convince readers that there is more than a measure of truth in the despairing yet unexpectedly liberating negativity that is widely considered a hallmark of Ligotti&apos;s work.\r\n\r\nGenre: Non-Fiction &gt; General","last_updated":"2018-10-03T12:16:49.213Z","parsed":{"xt":"urn:btih:9a0cbdf47527d3d4b2cfa6fa07519d2e5a1a8037","dn":"The Conspiracy against the Human Race by Thomas Ligotti (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9a0cbdf47527d3d4b2cfa6fa07519d2e5a1a8037","infoHashBuffer":{"type":"Buffer","data":[154,12,189,244,117,39,211,212,178,207,166,250,7,81,157,46,90,26,128,55]},"name":"The Conspiracy against the Human Race by Thomas Ligotti (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}