{"title":"Karl Popper - Philosophical Works (19 books)","magnet":"magnet:?xt=urn:btih:9a60ebf7631547f5fd4664d57ccc424694f9c79f&dn=Karl+Popper+-+Philosophical+Works+%2819+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"96316519","seeders":"0","leechers":"0","description":"\nKARL R. POPPER (1902-1994) was an Austrian-born British philosopher who is generally regarded as one of the 20th century&apos;s greatest philosophers of science, known for his rejection of the classical inductivist views on the scientific method in favour of empirical falsification.  He helped to establish the philosophy of science as an autonomous discipline within philosophy, through his own prolific and influential works, and also through his influence on his own contemporaries and students.  He was also a social and political philosopher of considerable stature, a self-professed critical-rationalist, a dedicated opponent of all forms of scepticism, conventionalism, and relativism in science and in human affairs generally and a committed advocate and staunch defender of the &quot;Open Society.&quot;\n\nAlthough his first book, THE LOGIC OF SCIENTIFIC DISCOVERY (1935), was published by the Vienna Circle of logical positivists, Popper rejected their inductive empiricism and developmental historicism.  According to this traditional view, a scientific hypothesis may be tested and verified by obtaining the repeated outcome of substantiating observations.  Popper argued instead that hypotheses are deductively validated by what he called the &quot;falsifiability criterion.&quot;  Under this method, a scientist seeks to discover an observed exception to his postulated rule.  The absence of contradictory evidence thereby becomes corroboration of his theory.  According to Popper, such pseudosciences as astrology, metaphysics, Marxist history, and Freudian psychoanalysis are not empirical sciences, because of their failure to adhere to the principle of falsifiability.\n\nIn political discourse, he is known for his vigorous defence of liberal democracy and the principles of social criticism that he came to believe made a flourishing open society possible.  In THE OPEN SOCIETY AND ITS ENEMIES (1945) and THE POVERTY OF HISTORICISM (1957), Popper developed a critique of historicism and a defence of the &quot;Open Society&quot;.  He argued that historicism (according to which history develops inexorably and necessarily according to knowable general laws towards a determinate end) is the principal theoretical presupposition underpinning most forms of authoritarianism and totalitarianism, and that it is founded upon mistaken assumptions regarding the nature of scientific law and prediction.  Since the growth of human knowledge is a causal factor in the evolution of human history, and since &quot;no society can predict, scientifically, its own future states of knowledge&quot;, it follows, he argued, that there can be no predictive science of human history.  For Popper, metaphysical and historical indeterminism went hand in hand.\n\n\nThe following books are in ePUB and/or PDF format as indicated:\n\n* All Life is Problem Solving (Routledge, 2001) -- ePUB + PDF\n* Conjectures and Refutations (Routledge, 2002) -- ePUB + PDF\n* In Search of a Better World: Lectures and Essays (Routledge, 1996) -- ePUB\n* Lesson of This Century, The (Routledge, 1997) -- PDF\n* Logic of Scientific Discovery, The (Routledge, 2002) -- ePUB + PDF\n* Myth of the Framework (Routledge, 2006).  M.A. Notturno, ed. -- ePUB\n* Objective Knowledge: An Evolutionary Approach (Oxford, 1979) -- PDF\n* Open Society and Its Enemies, The (Princeton, 2013) -- ePUB + PDF\n* Open Society and Its Enemies, The (Routledge, 2011) -- ePUB\n* Popper Selections (Princeton, 1985).  David Miller, ed. -- PDF\n* Poverty of Historicism (Routledge, 2002) -- ePUB + PDF\n* Quantum Theory &amp; the Schism in Physics (Rowman &amp; Littlefield, 1982) -- PDF\n* Realism and the Aim of Science (Routledge, 1996).  W. Bartley III, ed. -- PDF\n* Revolution or Reform [with Herbert Marcuse] (Precedent, 1985) -- PDF\n* Self and Its Brain, The [with John C. Eccles] (Springer, 1985) -- PDF\n* Two Fundamental Problems of Theory of Knowledge (Routledge, 2008) -- PDF\n* Unended Quest: An Intellectual Autobiography (Routledge, 2002) -- ePUB + PDF\n* World of Parmenides, The (Routledge, 2012) -- ePUB\n* World of Propensities, A (Thoemmes, 1995) -- PDF\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-08-29T12:01:01.572Z","parsed":{"xt":"urn:btih:9a60ebf7631547f5fd4664d57ccc424694f9c79f","dn":"Karl Popper - Philosophical Works (19 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9a60ebf7631547f5fd4664d57ccc424694f9c79f","infoHashBuffer":{"type":"Buffer","data":[154,96,235,247,99,21,71,245,253,70,100,213,124,204,66,70,148,249,199,159]},"name":"Karl Popper - Philosophical Works (19 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}