{"title":"What Was Mine by Helen Klein Ross EPUB","magnet":"magnet:?xt=urn:btih:9a90bbf00905631f249c62e21c9a62fa5d43543d&dn=What+Was+Mine+by+Helen+Klein+Ross+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3300962","seeders":"14","leechers":"7","description":"xx\r\n\r\nWhat Was Mine by Helen Klein Ross EPUB\r\n\r\nSimply told but deeply affecting, in the best-selling tradition of Alice McDermott and Tom Perrotta, this urgent novel unravels the heartrending yet unsentimental tale of a woman who kidnaps a baby in a superstore - and gets away with it for 21 years.\r\n\r\nLucy Wakefield is a seemingly ordinary woman who does something extraordinary in a desperate moment: She takes a baby girl from a shopping cart and raises her as her own. It&apos;s a secret she manages to keep for over two decades - from her daughter, the babysitter who helped raise her, family, coworkers, and friends.\r\n\r\nWhen Lucy&apos;s now-grown daughter, Mia, discovers the devastating truth of her origins, she is overwhelmed by confusion and anger and determines not to speak again to the mother who raised her. She reaches out to her birth mother for a tearful reunion, and Lucy is forced to flee to China to avoid prosecution. What follows is a ripple effect that alters the lives of many and challenges our understanding of the very meaning of motherhood.\r\n\r\nAuthor Helen Klein Ross, whose work has appeared in The New Yorker, weaves a powerful story of upheaval and resilience told from the alternating perspectives of Lucy, Mia, Mia&apos;s birth mother, and others intimately involved in the kidnapping. What Was Mine is a compelling tale of motherhood and loss, of grief and hope, and of the life-shattering effects of a single irrevocable moment.\r\n\r\nxx","last_updated":"2018-03-22T15:03:34.892Z","parsed":{"xt":"urn:btih:9a90bbf00905631f249c62e21c9a62fa5d43543d","dn":"What Was Mine by Helen Klein Ross EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9a90bbf00905631f249c62e21c9a62fa5d43543d","infoHashBuffer":{"type":"Buffer","data":[154,144,187,240,9,5,99,31,36,156,98,226,28,154,98,250,93,67,84,61]},"name":"What Was Mine by Helen Klein Ross EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}