{"title":"Oxen (The Ox) (Sweden 1991) H.264 from PAL DVD (moviesbyrizzo)","magnet":"magnet:?xt=urn:btih:9af66d0076adea79e356bcaf430247c5335abf86&dn=Oxen+%28The+Ox%29+%28Sweden+1991%29+H.264+from+PAL+DVD+%28moviesbyrizzo%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"moviesbyrizzo","categoryP":"video","categoryS":"movies","size":"1724508282","seeders":"0","leechers":"0","description":" <a href=\"http://www.imdb.com/title/tt0102619/\" rel=\"nofollow\" target=\"_NEW\">http://www.imdb.com/title/tt0102619/</a> \r\n\r\nDirected by Mr. Sven Nykvist Stars  Stellan Skarsg&#xE5;rd, Ewa Fr&#xF6;ling \r\n\r\nThis is an H.264 2400k bitrate 720 X 576 video res convert of the 4GB (single layer) DVD we ordered o-line from Europe years ago. It is no longer showing as available last we checked. perhaps a blue-ray is in the works. that would be great thing I&apos;m sure. Until then here is something to tide you over. \r\n\r\n192k stereo AC3 Swedish audio Check for subtitles on the net please. Included in the torrent folder this time are subtitles for Bosnian Czech English Dutch English Finnish  Norwegian Romanian Spanish and Swedish. \r\n\r\nThis movie from Sweden is one I initially saw at a theatre in Edmonton Canada catering to the best movies from around Europe. It tells of the suffering of a Swedish Irish family after the Husband and Father does something desperate bid to keep his family alive with some food during difficult times indeed back then. \r\n\r\nThe moral of the story I suggest is that when someone does something wrong, that is \r\nnot a valid enough reason or excuse rather to do something insanely harsh by way of \r\npunishment in order to consider some kind of justice done. \r\n\r\nThe man did err against his community at large while trying to do for his \r\nimmediate family, However I don&apos;t think understanding sufficient to his spirit \r\nprevailed to make for a reasonable outcome for all concerned. Sometimes \r\nall that a good enough person needs is a talking to or a warning or even a slap \r\non the wrist. On the other hand for those that do evil with intent to be that way \r\n(and that certainly isn&apos;t something this man should be accused of), whatever \r\nsanctions - even extreme that may apply may be insufficient to do true and real \r\njustice to serve the community in a real way. \r\n\r\nWhere truly lovely spirits can be found, a lighter approach to punishments should \r\nbe taken in matters such as this as that is punishment enough if the person concerned is a conscionable nice enough person to take a point and seek to improve his behaviour if he can accept the wisdom of it, which he should be able to in such a case. \r\n\r\nMichael Rizzo Chessman \r\n(moviesbyrizzo)","last_updated":"2018-06-28T12:00:43.369Z","parsed":{"xt":"urn:btih:9af66d0076adea79e356bcaf430247c5335abf86","dn":"Oxen (The Ox) (Sweden 1991) H.264 from PAL DVD (moviesbyrizzo)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9af66d0076adea79e356bcaf430247c5335abf86","infoHashBuffer":{"type":"Buffer","data":[154,246,109,0,118,173,234,121,227,86,188,175,67,2,71,197,51,90,191,134]},"name":"Oxen (The Ox) (Sweden 1991) H.264 from PAL DVD (moviesbyrizzo)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}