{"title":"Tales from a Young Vet by Jo Hardy EPUB","magnet":"magnet:?xt=urn:btih:9b9b2d6b021883f8b8e544f048c0d294479339f8&dn=Tales+from+a+Young+Vet+by+Jo+Hardy+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1335423","seeders":"1","leechers":"0","description":"xx\r\n\r\nTales from a Young Vet by Jo Hardy EPUB\r\n\r\nThe funny, touching and entertaining story of how Jo Hardy, the star of BBC2&apos;s Young Vets, gets to grips with animals big and small, friendly and not at all happy, on the road to becoming a fully qualified vet.\r\n\r\n&quot;Stand well clear. Keep your eyes on them. Oh, and make sure you have insurance.&quot; Not the most comforting words of wisdom but probably the most useful for a trainee vet, Jo would say.\r\n\r\nFrom well-equipped surgeries to windswept hills and ramshackle barns, Jo has to be able to diagnose and treat any animal at any time of the day or night. It&apos;s not quite as easy as James Herriot made it seem. Jo&apos;s final year of training saw her race from rectal examinations of cows to spine surgery on a Great Dane and from treating an eventing horse with a heart problem to inserting a contraceptive implant into a monkey. And then there were the owners - the tough guy who sobbed when his cat was diagnosed with cancer, the woman who was convinced her dog was embarrassed by its stomach upset, and the farmer who loved his cows as much as anyone loves their pets.\r\n\r\nGruelling days of animal treatments and visits combined with long nights of study and revision made Jo&apos;s final year of training the most demanding and rewarding year of her life. Her book tells of the highs and lows, the pets that stole her heart, and the lifelong friends that she made - with two legs and four.\r\n\r\nxx","last_updated":"2018-01-25T12:11:46.418Z","parsed":{"xt":"urn:btih:9b9b2d6b021883f8b8e544f048c0d294479339f8","dn":"Tales from a Young Vet by Jo Hardy EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9b9b2d6b021883f8b8e544f048c0d294479339f8","infoHashBuffer":{"type":"Buffer","data":[155,155,45,107,2,24,131,248,184,229,68,240,72,192,210,148,71,147,57,248]},"name":"Tales from a Young Vet by Jo Hardy EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}