{"title":"The Gutsy Girl Handbook by Kate White EPUB","magnet":"magnet:?xt=urn:btih:9c8252809f0741c82f71cfe1bf5725807400729c&dn=The+Gutsy+Girl+Handbook+by+Kate+White+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6525103","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Gutsy Girl Handbook by Kate White EPUB\r\n\r\nBest-selling author, professional speaker, and former editor in chief of Cosmopolitan Kate White shares the nine core principles gutsy women need to go bigger and bolder and achieve the full level of success they desire. \r\n\r\nTwenty-two years ago Kate White wrote the best-selling career bible Why Good Girls Don&apos;t Get Ahead but Gutsy Girls Do and helped thousands of women push their success to the next level. Now a new generation of women, still eyeing the pay gap and glass ceiling, needs its own set of rules for today&apos;s modern workplace.  \r\n\r\nIn The Gutsy Girl Handbook White presents the nine core principles that have guided her career, offering dozens of straightforward, doable strategies for women in any field and at any stage in their professional lives. Drawing on original research, and sharing new success stories and never before told examples from her time as the editor in chief of Cosmo, White inspires women to own their excellence, break the rules (or make their own), ask for the money and opportunities they deserve, and refuse to apologize for who they are and what they want.  \r\n\r\nThe Gutsy Girl Handbook is a resource for women who want to build confidence; negotiate a great salary and perks; manage meetings, mansplaining, and interruptions; and create game-changing &quot;notice me&quot; ideas. This all-new accessible handbook is a great gift for graduates and a must-read for professional women of all levels.\r\n\r\nxx","last_updated":"2018-05-11T12:00:48.089Z","parsed":{"xt":"urn:btih:9c8252809f0741c82f71cfe1bf5725807400729c","dn":"The Gutsy Girl Handbook by Kate White EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9c8252809f0741c82f71cfe1bf5725807400729c","infoHashBuffer":{"type":"Buffer","data":[156,130,82,128,159,7,65,200,47,113,207,225,191,87,37,128,116,0,114,156]},"name":"The Gutsy Girl Handbook by Kate White EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}