{"title":"Jamestown, the Buried Truth by William M. Kelso EPUB","magnet":"magnet:?xt=urn:btih:9ca5ac958d4c8bce47fecd577b96639cfb0db297&dn=Jamestown%2C+the+Buried+Truth+by+William+M.+Kelso+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"9704749","seeders":"0","leechers":"0","description":"xx\r\n\r\nJamestown, the Buried Truth by William M. Kelso EPUB\r\n\r\nWhat was life really like for the band of adventurers who first set foot on the banks of the James River in 1607? Important as the accomplishments of these men and women were, the written records pertaining to them are scarce, ambiguous, and often conflicting, and those curious about the birthplace of the United States are left to turn to dramatic and often highly fictionalized reports.\r\n\r\nIn Jamestown, the Buried Truth, William Kelso takes us literally to the soil where the Jamestown colony began, unearthing the James Fort and its contents to reveal fascinating evidence of the lives and deaths of the first settlers, of their endeavors and struggles, and of their relationships with the Virginia Indians. He offers up a lively but fact-based account, framed around a narrative of the archaeological team&apos;s exciting discoveries.\r\n\r\nOnce thought to have been washed away by the James River, James Fort still retains much of its structure, including palisade walls, bulwarks, interior buildings, a well, a warehouse, and several pits, and more than 500,000 objects have been cataloged. Dr. Kelso and his team of archaeologists have discovered the lost burial of one of Jamestown&apos;s early leaders, presumed to be Captain Bartholomew Gosnold, and the remains of several other early settlers, including a young man who died of a musket ball wound. In addition, they&apos;ve uncovered and analyzed the remains of the foundations of Jamestown&apos;s massive capitol building. Refuting the now decades-old stereotype that attributed the high mortality rate of the Jamestown settlers to their laziness and ineptitude, Jamestown, the Buried Truth produces a vivid picture of the settlement that is far more complex, incorporating the most recent archaeology to give Jamestown its rightful place in history and thus contributing to a broader understanding of the transatlantic world. The book is published by University of Virginia Press.\r\n\r\nxx","last_updated":"2018-06-15T12:00:47.839Z","parsed":{"xt":"urn:btih:9ca5ac958d4c8bce47fecd577b96639cfb0db297","dn":"Jamestown, the Buried Truth by William M. Kelso EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9ca5ac958d4c8bce47fecd577b96639cfb0db297","infoHashBuffer":{"type":"Buffer","data":[156,165,172,149,141,76,139,206,71,254,205,87,123,150,99,156,251,13,178,151]},"name":"Jamestown, the Buried Truth by William M. Kelso EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}