{"title":"Music from Upstairs Downstairs 1971 (TV Series) (musicfromrizzo)","magnet":"magnet:?xt=urn:btih:9d101233193e3405847c91a9821ce3ffee0379e9&dn=Music+from+Upstairs+Downstairs+1971+%28TV+Series%29+%28musicfromrizzo%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"moviesbyrizzo","categoryP":"audio","categoryS":"music","size":"15380811","seeders":"7","leechers":"2","description":" <a href=\"https://www.imdb.com/title/tt0066722/\" rel=\"nofollow\" target=\"_NEW\">https://www.imdb.com/title/tt0066722/</a>\r\n\r\nThis is an offering f the most gloriously beautiful music we have ever\r\nbeen blessed with as a human race - I believe. All from the Upstairs Downstairs program.\r\n\r\nIm referring to the genius of Mr. Alexander Faris in the most beautiful creative\r\nminds which could possibly be employed in dreaming up the Upstairs Downstairs main theme music for us.\r\n\r\nThen there&apos;s the best piece by Chopin ever - my favourite - and used in the\r\nsong &quot;So deep is the night&quot; that I first heard at a British Boarding school\r\nI attended in East Africa during my impressionable most years.\r\n\r\nAlso included is a most lovely song - Loveliest night of the year - supremely done\r\nby Ms. Vera Lynn and a rendition too by Fraulein Helen Traubel of Germany which\r\nsounds almost equally as lovely indeed.\r\n\r\nWe plan to soon post a 720 X 576 (2000k video bitrate) H.26 MP4 offering of\r\na better made set of PAL discs (than the A&amp;E version we donated a full set of to the local library in Toronto to, years back) we received from Europe not too long ago. The audio will be improved too and posted at 192k - the full bitrate on the disc.\r\n\r\nWe do have the DVDs seeding on the net in PAL format however they have been doing poorly with only several completions and a few peers that have been struggling to complete for some time without the benefit of better sharing ability given the\r\npoorly designed torrent software (I believe) we are all seemingly stuck with,along\r\nwith the seeming unacceptability of the full DVD torrent at the piratebay site\r\ngiven size restrictions (likely) - we were poorly responded to in trying to clarify what the hangup was so the DVDs aren&apos;t at present posted here - too bad - because it would be a nice offering for those wanting the full benefit of them.\r\n\r\nAnyway, do enjoy this greatest music (only 15MB download) and take whichever\r\nof our Upstairs Downstairs collections best fits your wants - our DivX version\r\n(poor quality compared to the PAL picture I would say without a doubt - no fault\r\nof our own) or our PAL DVDs if you can find them (even here), or our H.264 version\r\nwhich we hope we can post here in the coming days - we are in the process of \r\nconverting to MP4 format on three computer stations simultaneously so that\r\nwe keep you waiting no longer. Other such British series programs will soon follow\r\nin similar format and bitrates for those preferring this to the DVD option\r\nwe have given here and various sites before\r\n\r\nthanks and please share kindly\r\n\r\nMichael Rizzo Chessman\r\nmusicfromrizzo moviesbyrizzo","last_updated":"2018-09-22T12:34:25.978Z","parsed":{"xt":"urn:btih:9d101233193e3405847c91a9821ce3ffee0379e9","dn":"Music from Upstairs Downstairs 1971 (TV Series) (musicfromrizzo)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9d101233193e3405847c91a9821ce3ffee0379e9","infoHashBuffer":{"type":"Buffer","data":[157,16,18,51,25,62,52,5,132,124,145,169,130,28,227,255,238,3,121,233]},"name":"Music from Upstairs Downstairs 1971 (TV Series) (musicfromrizzo)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}