{"title":"Happiness Is a Choice You Make by John Leland EPUB","magnet":"magnet:?xt=urn:btih:9d5250704956f41aaab4625d9f9d75bffb3596ac&dn=Happiness+Is+a+Choice+You+Make+by+John+Leland+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"12245365","seeders":"20","leechers":"17","description":"xx\r\n\r\nHappiness Is a Choice You Make by John Leland EPUB\r\n\r\nBased on the popular New York Times series, life-changing wisdom from an unexpected source: America&apos;s oldest old\r\n\r\nIn 2015, the award-winning New York Times journalist John Leland set out to meet some of the city&apos;s oldest inhabitants for a series on America&apos;s fastest-growing age group: those over 85. Leland was at a crossroads in his own life. His marriage had fallen apart, and, at 55, he was alone for the first time. He was also caring for his elderly mother, whose main desire was to die. He understood aging, like many of us do, as nothing more than the relentless deterioration of body, mind, and quality of life. He wondered: Is there a threshold at which life is no longer worth living?\r\n\r\nBut the six elders Leland interviewed took him in a different direction. Beyond illuminating what it&apos;s like to be old, physically and materially, they provided a life-changing education in resilience and joy. They had lived long enough to master the art of living, and they shared their wisdom generously. Leland did not anticipate all that he would learn, nor did he anticipate the popularity of the series: Its following grew to nearly half a million online views for the finale, plus print readers.\r\n\r\nHappiness Is a Choice You Make, based on the series, is a rare, intimate glimpse into the end of life and the insight that can enhance the years preceding. What he finds is deeply heartening: Even as our faculties decline, we still wield extraordinary influence over the quality of our lives. Happiness is a choice we make.\r\n\r\nLearn how to live from those who have mastered the art\r\n\r\nxx","last_updated":"2018-01-27T12:04:48.820Z","parsed":{"xt":"urn:btih:9d5250704956f41aaab4625d9f9d75bffb3596ac","dn":"Happiness Is a Choice You Make by John Leland EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9d5250704956f41aaab4625d9f9d75bffb3596ac","infoHashBuffer":{"type":"Buffer","data":[157,82,80,112,73,86,244,26,170,180,98,93,159,157,117,191,251,53,150,172]},"name":"Happiness Is a Choice You Make by John Leland EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}