{"title":"TurboCollage 7.0.2.0 Cracked","magnet":"magnet:?xt=urn:btih:9eee151a923ec7bac6f978cd38dcf587e52c657a&dn=TurboCollage+7.0.2.0+Cracked&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"shareche","categoryP":"applications","categoryS":"windows","size":"8953945","seeders":"0","leechers":"0","description":"TurboCollage 7.0.2.0 Cracked\r\n\r\nTurboCollage is a lightweight software application whose purpose is to help you create collages made up of images, text, as well as transparent or custom backgrounds.\r\n\r\nUser-friendly layout and importing/exporting options\r\nThe GUI looks clean and intuitive, allowing you to add photos in the working environment using the built-in browse button or drag-and-drop support.\r\n\r\nIt works with the following file formats: JPEG, PNG, BMP, TIFF, and GIF. You can print or export the generated collage to one of the aforementioned file formats, or save it as a project on your computer so you can easily import it for future editing tasks.\r\n\r\nCustomize your collages\r\nYou are allowed to move pictures to the preferred position in the working environment, delete the selected image, resize objects, lock the image and text, as well as shuffle items in the collage. TurboCollage lets you choose between different collage patterns (mosaic, picture pile, picture grid, center frame, zig mosaic).\r\n\r\nSeveral tweaks can be applied to the layout, namely you may choose between predefined size options (e.g. wallet, poster, square), change the orientation (landscape or portrait), adjust the spacing between objects, as well as alter the form of the corners.\r\n\r\nYou may opt for a transparent background, add a photo from your computer, or select a background color, and draw shadow with custom x and y offset and blur options.\r\n\r\nCustom text can be added in your pictures. You may type the text directly into the main window or paste it from the clipboard, alter the text in terms of font, style, size, and alignment, change the background opacity and color, as well as add text shadow.\r\n\r\nBottom line\r\nAll things considered, TurboCollage integrates an essential suite of features for helping you generate user-defined collages. It does not come with a comprehensive pack of customization options but the basic parameters are sufficient for placing your favorite images in a collage with custom text and background.\r\n\r\nSystem Requirement:\r\nWindows 10/8/7/Vista 64bit","last_updated":"2018-03-19T12:00:52.618Z","parsed":{"xt":"urn:btih:9eee151a923ec7bac6f978cd38dcf587e52c657a","dn":"TurboCollage 7.0.2.0 Cracked","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9eee151a923ec7bac6f978cd38dcf587e52c657a","infoHashBuffer":{"type":"Buffer","data":[158,238,21,26,146,62,199,186,198,249,120,205,56,220,245,135,229,44,101,122]},"name":"TurboCollage 7.0.2.0 Cracked","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}