{"title":"MomsTeachSex - Emily Willis, Mona Wales (Moms Revenge) NEW 04 Oc","magnet":"magnet:?xt=urn:btih:9f59719e9d1071d0a41c31cd8295f643c1d7a74c&dn=MomsTeachSex+-+Emily+Willis%2C+Mona+Wales+%28Moms+Revenge%29+NEW+04+Oc&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"584712904","seeders":"15","leechers":"18","description":"Trent Tyler and his wife Mona Wales have brought foreign exchange student Emily Willis into their house, but Mona walks in on Trent banging the new girl. Mona doesn&apos;t just get mad, she gets even. She goes to find Trent&apos;s son and pulls out her boobs that are tipped with her big, hard nipples. Codey Steel is confused at first, but once Mona explains the situation Codey is willing to be seduced. Mona eventually gets her wish, earning the privilege of sucking Codey off and mounting him with her juicy, hairy pussy. At his stepmom&apos;s insistence, Codey fucks her until he fills her with a creampie of cum.A few days later, Trent has left on a business trip and Mona dresses in sexy lingerie to facetime a striptease for him. She&apos;s interrupted in her masturbation by Emily, who tries to retreat to protect Mona&apos;s privacy. Mona calls Emily back and hangs up on Trent so she can tell Emily that she knows about her banging her husband. Emily claims she&apos;s actually more into girls, and Mona sees an opportunity to continue her revenge. Emily is ridiculously easy to seduce, and soon the girls are on the bed with Mona&apos;s face buried between Emily&apos;s thighs. When the girls switch positions, Codey gets an eyeful and finds that he can&apos;t look away!Mona catches her stepson spying and invites him to join in on the fun. The ensuing threesome soothes everyone&apos;s hurt feelings as Codey gets a taste of the exchange student and another go with his stepmom. Working together, the two girls dominate Codey&apos;s cock until they&apos;ve sucked him to the point of no return. Laying side by side by side with Mona, Emily watches as her host mom takes a facial of her stepson&apos;s jizz. Shooing the kids out, Mona calls her husband back with Codey&apos;s cum still hot on her face to complete her revenge.\r\nCategories: Small Boobs Big Nipples Shaved Pussy Landing Strip Pussy Brunette Blonde Lingerie Masturbation Hardcore Pantyhose Lesbian Fair Skin Petite Housewife Milf Stockings Girl-Girl-Boy Blowjob Facial Handjob Girl Orgasm POV Deep Throat Big Dick Pussy Licking\r\n <a href=\"\nhttp://imgdone.com/image/z3p1U\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/z3p1U</a>\r\n <a href=\"\nhttp://imgdone.com/image/z3qvk\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/z3qvk</a>","last_updated":"2018-10-04T12:12:18.695Z","parsed":{"xt":"urn:btih:9f59719e9d1071d0a41c31cd8295f643c1d7a74c","dn":"MomsTeachSex - Emily Willis, Mona Wales (Moms Revenge) NEW 04 Oc","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9f59719e9d1071d0a41c31cd8295f643c1d7a74c","infoHashBuffer":{"type":"Buffer","data":[159,89,113,158,157,16,113,208,164,28,49,205,130,149,246,67,193,215,167,76]},"name":"MomsTeachSex - Emily Willis, Mona Wales (Moms Revenge) NEW 04 Oc","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}