{"title":"Loving Pablo, Hating Escobar by Virginia Vallejo EPUB","magnet":"magnet:?xt=urn:btih:9f6a2421f7904cf8fcc14cd30e909f1f86f69a83&dn=Loving+Pablo%2C+Hating+Escobar+by+Virginia+Vallejo+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7431444","seeders":"1","leechers":"1","description":"xx\r\n\r\nLoving Pablo, Hating Escobar by Virginia Vallejo EPUB\r\n\r\nA revealing memoir of Colombian television journalist Virginia Vallejo&apos;s affair with the &quot;King of Cocaine&quot;, notorious Medellin drug lord Pablo Escobar. Soon to be a major motion picture starring Javier Bardem and Penelope Cruz.\r\n\r\nAt 33, Virginia Vallejo was part of the media elite. A renowned anchorwoman and socialite, and a model who appeared on magazine covers worldwide, Vallejo was the darling of Colombia&apos;s most powerful politicians and billionaires. Meeting Pablo Escobar in 1983, then becoming his mistress for many years, she witnessed the rise of a drug empire that was characterized by Escobar&apos;s far-reaching political corruption, his extraordinary wealth, and a network of violent crime that lasted until his death in 1993.\r\n\r\nIn this highly personal and insightful story, Vallejo characterizes the duality of Escobar. His charm and charisma as a benefactor to many Colombians contrast with the repulsiveness of his criminal actions as a tyrannical terrorist and enemy of many world leaders. Told from the perspective of the present day, and reflecting on her cooperation with the US Department of Justice in 2006, as she testified against high-ranking Colombian ministers on trial for conspiracy and murder, Vallejo offers a compelling work of both intimate reflection and critical journalism - a unique perspective on the Colombian drug wars and the endlessly fascinating figure of Pablo Escobar.\r\n\r\nxx","last_updated":"2018-08-22T12:04:39.848Z","parsed":{"xt":"urn:btih:9f6a2421f7904cf8fcc14cd30e909f1f86f69a83","dn":"Loving Pablo, Hating Escobar by Virginia Vallejo EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9f6a2421f7904cf8fcc14cd30e909f1f86f69a83","infoHashBuffer":{"type":"Buffer","data":[159,106,36,33,247,144,76,248,252,193,76,211,14,144,159,31,134,246,154,131]},"name":"Loving Pablo, Hating Escobar by Virginia Vallejo EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}