{"title":"Writing on the Wall by Tom Standage EPUB","magnet":"magnet:?xt=urn:btih:a06b8f3e1473ee07454252dcefefa4b1ce01ee06&dn=Writing+on+the+Wall+by+Tom+Standage+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3820332","seeders":"40","leechers":"7","description":"xx\r\n\r\nWriting on the Wall: Social Media_ The First 2,000 Years by Tom Standage EPUB\r\n\r\nPapyrus rolls and Twitter have much in common, as each was their generation&apos;s signature means of &quot;instant&quot; communication. Indeed, as Tom Standage reveals in his scintillating new book, social media is anything but a new phenomenon. From the papyrus letters that Roman statesmen used to exchange news across the Empire to the advent of hand-printed tracts of the Reformation to the pamphlets that spread propaganda during the American and French revolutions, Standage chronicles the increasingly sophisticated ways people shared information with each other, spontaneously and organically, down the centuries. With the rise of newspapers in the nineteenth century, then radio and television, &quot;mass media&quot; consolidated control of information in the hands of a few moguls. However, the Internet has brought information sharing full circle, and the spreading of news along social networks has reemerged in powerful new ways.\r\n\r\nA fresh, provocative exploration of social media over two millennia, Writing on the Wall reminds us how modern behavior echoes that of prior centuries - the Catholic Church, for example, faced similar dilemmas in deciding whether or how to respond to Martin Luther&apos;s attacks in the early sixteenth century to those that large institutions confront today in responding to public criticism on the Internet. Invoking the likes of Thomas Paine and Vinton Cerf, coinventor of the Internet, Standage explores themes that have long been debated: the tension between freedom of expression and censorship; whether social media trivializes, coarsens, or enhances public discourse; and its role in spurring innovation, enabling self-promotion, and fomenting revolution. As engaging as it is visionary, Writing on the Wall draws on history to cast new light on today&apos;s social media and encourages debate and discussion about how we&apos;ll communicate in the future.\r\n\r\nxx","last_updated":"2018-09-02T12:11:53.686Z","parsed":{"xt":"urn:btih:a06b8f3e1473ee07454252dcefefa4b1ce01ee06","dn":"Writing on the Wall by Tom Standage EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a06b8f3e1473ee07454252dcefefa4b1ce01ee06","infoHashBuffer":{"type":"Buffer","data":[160,107,143,62,20,115,238,7,69,66,82,220,239,239,164,177,206,1,238,6]},"name":"Writing on the Wall by Tom Standage EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}