{"title":"The Hardware Hacker - Andrew 'bunnie' Huang - Epub","magnet":"magnet:?xt=urn:btih:a08b5021d8dde13593c27be255c2855b790b97c2&dn=The+Hardware+Hacker+-+Andrew+%27bunnie%27+Huang+-+Epub&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"wormword216","categoryP":"other","categoryS":"e_books","size":"13276106","seeders":"72","leechers":"3","description":"The Hardware Hacker: Adventures in Making and Breaking Hardware Epub\r\nAndrew &apos;bunnie&apos; Huang\r\n\r\n\r\nFor over a decade, Andrew &quot;bunnie&quot; Huang, one of the world&apos;s most esteemed hackers, has shaped the fields of hacking and hardware, from his cult-classic book Hacking the Xbox to the open-source laptop Novena and his mentorship of various hardware startups and developers. In The Hardware Hacker, Huang shares his experiences in manufacturing and open hardware, creating an illuminating and compelling career retrospective.\r\n\r\nHuang&apos;s journey starts with his first visit to the staggering electronics markets in Shenzhen, with booths overflowing with capacitors, memory chips, voltmeters, and possibility. He shares how he navigated the overwhelming world of Chinese factories to bring chumby, Novena, and Chibitronics to life, covering everything from creating a Bill of Materials to choosing the factory to best fit his needs.\r\n\r\nThrough this collection of personal essays and interviews on topics ranging from the legality of reverse engineering to a comparison of intellectual property practices between China and the United States, bunnie weaves engineering, law, and society into the tapestry of open hardware.\r\n\r\nWith highly detailed passages on the ins and outs of manufacturing and a comprehensive take on the issues associated with open source hardware, The Hardware Hacker is an invaluable resource for aspiring hackers and makers","last_updated":"2018-06-03T12:08:00.641Z","parsed":{"xt":"urn:btih:a08b5021d8dde13593c27be255c2855b790b97c2","dn":"The Hardware Hacker - Andrew 'bunnie' Huang - Epub","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a08b5021d8dde13593c27be255c2855b790b97c2","infoHashBuffer":{"type":"Buffer","data":[160,139,80,33,216,221,225,53,147,194,123,226,85,194,133,91,121,11,151,194]},"name":"The Hardware Hacker - Andrew 'bunnie' Huang - Epub","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}