{"title":"New Years Eve - All Star Comedy 2011 Eng Subs 720p [H264-mp4]","magnet":"magnet:?xt=urn:btih:a0eb641e8cc16f3ffc4c69f8704d1dbc88f8cf78&dn=New+Years+Eve+-+All+Star+Comedy+2011+Eng+Subs+720p+%5BH264-mp4%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"eyezin","categoryP":"video","categoryS":"hd___movies","size":"1671184078","seeders":"14","leechers":"6","description":"Plot.\r\nSet during New Year&apos;s Eve in New York city, this movie follows several people and \r\nhow the day affects them. Kim is a single mother who still thinks of her daughter, \r\nHailey as a child who wants to go out with a boy so that she could kiss him at \r\nmidnight. Claire, who is in charge of the city&apos;s annual tradition, the ball drop on \r\nTimes Square. And when something goes wrong she has to ask an electrician, who was \r\nfired, to come and fix it. Laura, a chef who is cooking the New year&apos;s Eve party \r\nfor a record company who runs into Jensen, her ex who&apos;s a singer and performing at \r\nthe party. While he tries to apologize for how things ended, she refuses to accept \r\nit. Ingrid, a woman who works at the record company, after having a near death \r\nexperience, decides to quit her job and asks a young messenger, Paul to help her \r\nfulfil her resolutions. And at a hospital, Stan, a man who is in the final stages \r\nof cancer, only wishes to see the ball drop. Also Griffin and Tess, a couple who \r\nare expecting, want to be the ones who give birth first after New Year because of \r\nthe available cash prize; but another couple is also about to give birth. Randy a \r\nman who&apos;s not exactly fond of the holiday because of something that happened, finds \r\nhimself trapped in an elevator with a singer who is one of Jensen&apos;s back up singers \r\nwhen he performs at Times Square. And Sam, son of the owner of the record company, \r\nwho is out of town and is trying to get back to the city so that he could give a \r\nspeech at the party, but when he has an accident and since it&apos;s a holiday, his car \r\ncan&apos;t be fixed so he hitches a ride with some people going to the city. But it \r\nseems he has another reason why he needs to get back","last_updated":"2018-09-20T12:25:53.334Z","parsed":{"xt":"urn:btih:a0eb641e8cc16f3ffc4c69f8704d1dbc88f8cf78","dn":"New Years Eve - All Star Comedy 2011 Eng Subs 720p [H264-mp4]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a0eb641e8cc16f3ffc4c69f8704d1dbc88f8cf78","infoHashBuffer":{"type":"Buffer","data":[160,235,100,30,140,193,111,63,252,76,105,248,112,77,29,188,136,248,207,120]},"name":"New Years Eve - All Star Comedy 2011 Eng Subs 720p [H264-mp4]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}