{"title":"So Good They Can't Ignore You by Cal Newport EPUB","magnet":"magnet:?xt=urn:btih:a156c1c3b7ad7da75d3806fb651f434afe757e97&dn=So+Good+They+Can%27t+Ignore+You+by+Cal+Newport+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"320936","seeders":"0","leechers":"0","description":"xx\r\n\r\nSo Good They Can&apos;t Ignore You by Cal Newport EPUB\r\n\r\nIn this eye-opening account, Cal Newport debunks the long-held belief that &quot;follow your passion&quot; is good advice.\r\n\r\nNot only is the clich&#xE9; flawed - pre-existing passions are rare and have little to do with how most people end up loving their work - but it can also be dangerous, leading to anxiety and chronic job hopping.\r\n\r\nAfter making his case against passion, Newport sets out on a quest to discover the reality of how people end up loving what they do. Spending time with organic farmers, venture capitalists, screenwriters, freelance computer programmers, and others who admitted to deriving great satisfaction from their work, Newport uncovers the strategies they used and the pitfalls they avoided in developing their compelling careers.\r\n\r\nMatching your job to a preexisting passion does not matter, he reveals. Passion comes after you put in the hard work to become excellent at something valuable, not before.\r\n\r\nIn other words, what you do for a living is much less important than how you do it.\r\n\r\nWith a title taken from the comedian Steve Martin, who once said his advice for aspiring entertainers was to &quot;be so good they can&apos;t ignore you&quot;, Cal Newport&apos;s clearly written manifesto is mandatory reading for anyone fretting about what to do with their life, or frustrated by their current job situation and eager to find a fresh new way to take control of their livelihood. He provides an evidence-based blueprint for creating work you love.\r\n\r\nSo Good They Can&apos;t Ignore You will change the way we think about our careers, happiness, and the crafting of a remarkable life.\r\n\r\nxx","last_updated":"2018-03-28T12:04:15.023Z","parsed":{"xt":"urn:btih:a156c1c3b7ad7da75d3806fb651f434afe757e97","dn":"So Good They Can't Ignore You by Cal Newport EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a156c1c3b7ad7da75d3806fb651f434afe757e97","infoHashBuffer":{"type":"Buffer","data":[161,86,193,195,183,173,125,167,93,56,6,251,101,31,67,74,254,117,126,151]},"name":"So Good They Can't Ignore You by Cal Newport EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}