{"title":"Every Fifteen Minutes by Lisa Scottoline EPUB","magnet":"magnet:?xt=urn:btih:a233f3ca86689860330531a43e4401b3a4ad670f&dn=Every+Fifteen+Minutes+by+Lisa+Scottoline+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"768879","seeders":"0","leechers":"0","description":"xx\r\n\r\nEvery Fifteen Minutes by Lisa Scottoline EPUB\r\n\r\nDr. Eric Parrish is the chief of the psychiatric unit at Havemeyer General Hospital outside of Philadelphia. Recently separated from his wife, Alice, he is doing his best as a single dad to his seven-year-old daughter, Hannah. His work seems to be going better than his homelife, however. His unit at the hospital has just been named number two in the country, and Eric has a devoted staff of doctors and nurses who are as caring as he is. But when he takes on a new patient, Eric&apos;s entire world begins to crumble. Seventeen-year-old Max has a terminally ill grandmother and is having trouble handling it. That, plus his OCD and violent thoughts about a girl he likes make him a high-risk patient. Max can&apos;t turn off the mental rituals he needs to perform every 15 minutes that keep him calm. With the pressure mounting, Max just might reach the breaking point. When the girl is found murdered, Max is nowhere to be found. Worried about Max, Eric goes looking for him and puts himself in danger of being seen as a person of interest himself. Next, one of his own staff turns on him in a trumped-up charge of sexual harassment. Is this chaos all random? Or is someone systematically trying to destroy Eric&apos;s life? Lisa Scottoline&apos;s visceral thriller brings you into the grip of a true sociopath and shows you how, in the quest to survive such ruthlessness, every minute counts.\r\n\r\nxx","last_updated":"2018-07-03T12:00:43.310Z","parsed":{"xt":"urn:btih:a233f3ca86689860330531a43e4401b3a4ad670f","dn":"Every Fifteen Minutes by Lisa Scottoline EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a233f3ca86689860330531a43e4401b3a4ad670f","infoHashBuffer":{"type":"Buffer","data":[162,51,243,202,134,104,152,96,51,5,49,164,62,68,1,179,164,173,103,15]},"name":"Every Fifteen Minutes by Lisa Scottoline EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}