{"title":"Picturing the Bronze Age (gnv64)","magnet":"magnet:?xt=urn:btih:a272d4adbbb5a8b98e5d668e6fe10ab1f66ae929&dn=Picturing+the+Bronze+Age+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"18352724","seeders":"3","leechers":"120","description":"Picturing the Bronze Age\r\nby Johan Ling and Peter Skoglund\r\nOxbow Books | May 2015 | ISBN-10: 1782978798 | PDF | 185 Pages |  | 17.3 mb\r\n\r\nPictures from the Bronze Age are numerous, vivid and complex. There is no other prehistoric period that has produced such a wide range of images spanning from rock art to figurines to decoration on bronzes and gold. Fifteen papers, with a geographical coverage from Scandinavia to the Iberian Peninsula, examine a wide range of topics reflecting the many forms and expressions of Bronze Age imagery encompassing important themes including religion, materiality, mobility, interaction, power and gender.\r\nContributors explore specific elements of rock art in some detail such as the representation of the human form; images of manslaughter; and gender identities. The relationship between rock art imagery and its location on the one hand, and metalwork and networks of trade and exchange of both materials and ideas on the other, are considered. Modern and ancient perceptions of rock art are discussed, in particular the changing perceptions that have developed during almost 150 years of documented research.\r\n\r\nCONTENTS\r\nList of contributors vii\r\n1. The Swedish Rock Art Research Archives and Picturing the Bronze Age &#x2013; an introduction 1\r\n2. From folk oddities and remarkable relics to scientific substratum: 135 years of changing perceptions on the rock carvings in Tanum, northern Bohusl&#xE4;n, Sweden 5\r\n3. Hyper-masculinity and the construction of gender identities in the Bronze Age rock carvings of southern Sweden 21\r\n4. Mixed media, mixed messages: religious transmission in Bronze Age Scandinavia 37\r\n5. Walking on the stones of years. Some remarks on the north-west Iberian rock art 47\r\n6. A rock with a view: new perspectives on Danish rock art 65\r\n7. Rock art and the alchemy of bronze. Metal and images in Early Bronze Age Scotland 79\r\n8. The &#x2018;Stranger King&#x2019; (bull) and rock art 89\r\n9. Trading images: exchange, transformation and identity in rock-art from Valcamonica between the Bronze Age and the Iron Age 105\r\n10. Carl Georg Brunius: An early nineteenth-century pioneer in Swedish petroglyph research 121\r\n11. Alpine and Scandinavian rock art in the Bronze Age: a common cultural matrix in a web of continental influences 129\r\n12. The maritime factor in the distribution of Bronze Age rock art in Galicia 143\r\n13. Rock art as history &#x2013; representations of human images from an historical perspective 155\r\n14. Sword-wielders and manslaughter. Recently discovered images on the rock carvings of Brastad, western Sweden 167\r\n <a href=\"\nhttps://s18.postimg.org/6dkcfq355/Picturing_the_Bronze_Age.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s18.postimg.org/6dkcfq355/Picturing_the_Bronze_Age.jpg</a>","last_updated":"2018-01-30T12:12:20.787Z","parsed":{"xt":"urn:btih:a272d4adbbb5a8b98e5d668e6fe10ab1f66ae929","dn":"Picturing the Bronze Age (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a272d4adbbb5a8b98e5d668e6fe10ab1f66ae929","infoHashBuffer":{"type":"Buffer","data":[162,114,212,173,187,181,168,185,142,93,102,142,111,225,10,177,246,106,233,41]},"name":"Picturing the Bronze Age (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}