{"title":"Bad Blood by John Carreyrou EPUB","magnet":"magnet:?xt=urn:btih:a3f06ed487af8e4f1695e73070bc79e59af859f8&dn=Bad+Blood+by+John+Carreyrou+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"540789","seeders":"3","leechers":"2","description":"xx\r\n\r\nBad Blood by John Carreyrou EPUB\r\n\r\nThe full inside story of the breathtaking rise and shocking collapse of Theranos, the multibillion-dollar biotech startup, by the prize-winning journalist who first broke the story and pursued it to the end, despite pressure from their charismatic CEO and threats by her lawyers.\r\n\r\nIn 2014, Theranos founder and CEO Elizabeth Holmes was widely seen as the female Steve Jobs: a brilliant Stanford dropout whose startup &quot;unicorn&quot; promised to revolutionize the medical industry with a machine that would make blood testing significantly faster and easier. Backed by investors such as Larry Ellison and Tim Draper, Theranos sold shares in a fundraising round that valued the company at $9 billion, putting Holmes&apos;s worth at an estimated $4.7 billion. There was just one problem: The technology didn&apos;t work.\r\n\r\nFor years, Holmes had been misleading investors, FDA officials, and her own employees. When Carreyrou, working at the Wall Street Journal, got a tip from a former Theranos employee and started asking questions, both Carreyrou and the Journal were threatened with lawsuits. Undaunted, the newspaper ran the first of dozens of Theranos articles in late 2015. By early 2017, the company&apos;s value was zero and in March 2018 the SEC charged Holmes with perpetrating &quot;an elaborate, years-long fraud.&quot;\r\n\r\nHere is the riveting story of the biggest corporate fraud since Enron, a disturbing cautionary tale set amid the bold promises and gold-rush frenzy of Silicon Valley.\r\n\r\nxx","last_updated":"2018-05-23T12:03:26.361Z","parsed":{"xt":"urn:btih:a3f06ed487af8e4f1695e73070bc79e59af859f8","dn":"Bad Blood by John Carreyrou EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a3f06ed487af8e4f1695e73070bc79e59af859f8","infoHashBuffer":{"type":"Buffer","data":[163,240,110,212,135,175,142,79,22,149,231,48,112,188,121,229,154,248,89,248]},"name":"Bad Blood by John Carreyrou EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}