{"title":"Raw: My Journey into the Wu-Tang by Lamont 'U-God' Hawkins EPUB","magnet":"magnet:?xt=urn:btih:a400798b7b4c1fdb5490e7f5c5254ef0b2ba5567&dn=Raw%3A+My+Journey+into+the+Wu-Tang+by+Lamont+%27U-God%27+Hawkins+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"457941","seeders":"0","leechers":"0","description":"xx\r\n\r\nRaw: My Journey into the Wu-Tang by Lamont &apos;U-God&apos; Hawkins EPUB\r\n\r\nThe explosive, never-before-told story behind the historic rise of the Wu-Tang Clan, as told by one of its founding members, Lamont &quot;U-God&quot; Hawkins. \r\n\r\n&#x201C;It&#x2019;s time to write down not only my legacy, but the story of nine dirt-bomb street thugs who took our everyday life - scrappin&#x2019; and hustlin&#x2019; and tryin&#x2019; to survive in the urban jungle of New York City - and turned that into something bigger than we could possibly imagine, something that took us out of the projects for good, which was the only thing we all wanted in the first place.&#x201D; (Lamont &quot;U-God&quot; Hawkins)\r\n\r\nThe Wu-Tang Clan are considered hip-hop royalty. Remarkably, none of the founding members have told their story - until now. Here, for the first time, the quiet one speaks. \r\n\r\nLamont &#x201C;U-God&#x201D; Hawkins was born in Brownsville, New York, in 1970. Raised by a single mother and forced to reckon with the hostile conditions of project life, U-God learned from an early age how to survive. And surviving in New York City in the 1970s and 1980s was no easy task - especially as a young black boy living in some of the city&#x2019;s most ignored and destitute districts. But, along the way, he met and befriended those who would eventually form the Clan&#x2019;s core: RZA, GZA, Method Man, Raekwon, Ol&#x2019; Dirty Bastard, Inspectah Deck, Ghostface Killah, and Masta Killa. Brought up by the streets, and bonding over their love of hip-hop, they sought to pursue the impossible: music as their ticket out of the ghetto. \r\n\r\nU-God&#x2019;s unforgettable first-person account of his journey, from the streets of Brooklyn to some of the biggest stages around the world, is not only thoroughly affecting, unfiltered, and explosive but also captures, in vivid detail, the making of one of the greatest acts in American music history. \r\n\r\nxx","last_updated":"2018-03-19T12:00:35.978Z","parsed":{"xt":"urn:btih:a400798b7b4c1fdb5490e7f5c5254ef0b2ba5567","dn":"Raw: My Journey into the Wu-Tang by Lamont 'U-God' Hawkins EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a400798b7b4c1fdb5490e7f5c5254ef0b2ba5567","infoHashBuffer":{"type":"Buffer","data":[164,0,121,139,123,76,31,219,84,144,231,245,197,37,78,240,178,186,85,103]},"name":"Raw: My Journey into the Wu-Tang by Lamont 'U-God' Hawkins EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}