{"title":"Sonic Forces [xatab][ ENG+9] (2017) (1.04.79.d2f5cadd + 6 DLC)","magnet":"magnet:?xt=urn:btih:a54c5e527adddfc721e7eac58074cb4e31166a19&dn=+Sonic+Forces+%5Bxatab%5D%5B+ENG%2B9%5D+%282017%29+%281.04.79.d2f5cadd+%2B+6+DLC%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"klqr","categoryP":"games","categoryS":"pc","size":"13855206075","seeders":"1","leechers":"7","description":"Sonic Forces [RePack] [RUS + ENG + 9 / ENG] (2017) (1.04.79.d2f5cadd + 6 DLC)\r\n\r\n\r\nDoctor Eggman attacks a city, and Sonic sets out to stop him. However, upon arriving, he is attacked by Infinite, a mercenary transformed by the power of the Phantom Ruby from Sonic Mania. Infinite defeats Sonic, and he is taken prisoner aboard the Death Egg. Without Sonic, the land is left without a defender, and Eggman, with the help of his robots, Infinite, Shadow the Hedgehog, Chaos, Zavok, and Metal Sonic, manages to conquer the world within six months. Frustrated, Knuckles the Echidna forms a resistance force with Tails, the Chaotix, Amy Rose, Silver the Hedgehog, and a survivor of Eggman&apos;s attack whom they nickname the Rookie. Knuckles discovers Sonic&apos;s whereabouts, and the Rookie steals a space shuttle, breaks into the Death Egg, and rescues Sonic. Back in the city, Tails is attacked by Chaos, but is saved by Classic Sonic (also from Sonic Mania). The two set out to spy on Eggman, learning of the Phantom Ruby and that Eggman has a plan to completely destroy the Resistance which will take effect in three days.\r\n\r\nMeanwhile, Sonic encounters Shadow, who reveals that the Shadow following Eggman is a fake virtual reality copy created by Infinite, as are the other villains serving him. Tails infiltrates Eggman&apos;s computer network and finds the Phantom Ruby&apos;s weakness: it is directly powered by the Death Egg&apos;s core, and without a power source it is useless. While the Rookie stages a diversion, Sonic and Classic Sonic destroy the Death Egg. Believing they have the upper hand, the Resistance attacks Eggman&apos;s capital Metropolis. However, Eggman has a hidden backup power source under Metropolis, and he makes Infinite create a massive sun over the planet so that it will crash down and destroy the entire Resistance. Thinking fast, the Rookie uses a prototype Phantom Ruby they had recovered to dispel the virtual sun, saving everybody. Sonic and the Rookie then battle Infinite and defeat him. Eggman unveils yet another backup plan, moving the Phantom Ruby into one of his Death Egg Robots and fighting Sonic and his friends directly. Working together, Sonic, Classic Sonic, and the Rookie destroy Eggman&apos;s robot and defeat him. Classic Sonic returns to the past, the Resistance disbands, and Sonic and his friends decide to rebuild the world.\r\n\r\nSetup:\r\nrun Sonic Forces setup.exe","last_updated":"2018-01-23T12:05:53.645Z","parsed":{"xt":"urn:btih:a54c5e527adddfc721e7eac58074cb4e31166a19","dn":" Sonic Forces [xatab][ ENG 9] (2017) (1.04.79.d2f5cadd   6 DLC)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a54c5e527adddfc721e7eac58074cb4e31166a19","infoHashBuffer":{"type":"Buffer","data":[165,76,94,82,122,221,223,199,33,231,234,197,128,116,203,78,49,22,106,25]},"name":" Sonic Forces [xatab][ ENG 9] (2017) (1.04.79.d2f5cadd   6 DLC)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}