{"title":"Disciples by Douglas Waller EPUB","magnet":"magnet:?xt=urn:btih:a55bf47dcb062aa05bfb175caa3b0de5c8fad977&dn=Disciples+by+Douglas+Waller+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"18631750","seeders":"14","leechers":"11","description":"xx\r\n\r\nDisciples by Douglas Waller EPUB\r\n\r\nThe author of the critically acclaimed best seller Wild Bill Donovan tells the story of four OSS warriors of World War II. All four later led the CIA.\r\n\r\nThey are the most famous and controversial directors the CIA has ever had - Allen Dulles, Richard Helms, William Colby, and William Casey. Disciples is the story of these dynamic agents and their daring espionage and sabotage in wartime Europe under OSS Director Bill Donovan.\r\n\r\nAllen Dulles ran the OSS&apos; most successful spy operation against the Axis. Bill Casey organized dangerous missions to penetrate Nazi Germany. Bill Colby led OSS commando raids behind the lines in occupied France and Norway. Richard Helms mounted risky intelligence programs against the Russians in the ruin of Berlin after the German surrender.\r\n\r\nFour very different men, they later led (or misled) the successor CIA. Dulles launched the calamitous operation to land CIA-trained, anti-Castro guerrillas at Cuba&apos;s Bay of Pigs. Helms was convicted of lying to Congress over the CIA&apos;s role in the coup that ousted Chile&apos;s president. Colby would become a pariah for releasing to Congress what became known as the &quot;Family Jewels&quot; report on CIA misdeeds during the 1950s, &apos;60s and early &apos;70s. Casey would nearly bring down the CIA - and Ronald Reagan&apos;s presidency - from a scheme that secretly supplied Nicaragua&apos;s contras with money raked off from the sale of arms to Iran for American hostages in Beirut.\r\n\r\nMining thousands of once-secret World War II documents and interviewing scores of family members and CIA colleagues, Waller has written a brilliant successor to Wild Bill Donovan.\r\n\r\nxx","last_updated":"2018-01-22T21:40:20.025Z","parsed":{"xt":"urn:btih:a55bf47dcb062aa05bfb175caa3b0de5c8fad977","dn":"Disciples by Douglas Waller EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a55bf47dcb062aa05bfb175caa3b0de5c8fad977","infoHashBuffer":{"type":"Buffer","data":[165,91,244,125,203,6,42,160,91,251,23,92,170,59,13,229,200,250,217,119]},"name":"Disciples by Douglas Waller EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}