{"title":"MVP Baseball 2005","magnet":"magnet:?xt=urn:btih:a5966776b2baf8d6f2dca33a522005c061988504&dn=MVP+Baseball+2005&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"1427903217","seeders":"2","leechers":"5","description":"MVP Baseball 2005 includes all 30 official Major League Baseball teams, stadiums, and all 30 unique dynasties, as well as the more than 1,000 individual players that populate their respective teams. A notable exclusion is Barry Bonds, who does not appear in the game due to his withdrawal from the MLBPA&apos;s licensing agreement. His &quot;replacement&quot; is a fictional player named Jon Dowd. Dowd bears no resemblance in appearance to Bonds, but his skills mimic those of Bonds. Like its predecessor MVP Baseball 2004, this game does not include Kevin Millar, who does not appear in the game because he is not a member of the MLBPA. His &quot;replacement&quot; is a fictional player named Anthony Friese. The game also includes authentic minor league teams and actual minor league players by including double-A and triple-A-level farm teams. 2005&apos;s installment includes ballclubs from the High Single-A ranks as well, giving each MLB team three levels of minor league farm clubs. 2 legends teams, 63 legendary players, 15 classic stadiums, 5 fantasy parks, and more than 100 retro uniforms round out the list of unlockable features. Rosters are current as of January 12, 2005, and the game included the then-new Washington Nationals, along with their then temporary home, RFK Stadium. At the time, new rosters could be downloaded to the Xbox and PS2 versions by accessing their online play menus.[1]","last_updated":"2018-10-13T12:09:28.798Z","parsed":{"xt":"urn:btih:a5966776b2baf8d6f2dca33a522005c061988504","dn":"MVP Baseball 2005","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a5966776b2baf8d6f2dca33a522005c061988504","infoHashBuffer":{"type":"Buffer","data":[165,150,103,118,178,186,248,214,242,220,163,58,82,32,5,192,97,152,133,4]},"name":"MVP Baseball 2005","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}