{"title":"Treasures of the Great Silk Road","magnet":"magnet:?xt=urn:btih:a5ac50acca7f0642951a229161b50d707f17e59e&dn=Treasures+of+the+Great+Silk+Road&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"18750149","seeders":"56","leechers":"3","description":"Treasures of the Great Silk Road - Edgar Knobloch [epub]\r\n\r\nThis comprehensive account of the culture and history of Central Asia describes the main centers of human civilization. Turkestan&#x2014;the great landmass of Central Asia and Western China&#x2014;is an intriguing meeting point of civilizations. Four major invasions&#x2014;Greek, Arab, Mongol, and Russian&#x2014;together with Persian, Turkic and Chinese cultural influences, have made their mark on this vast and sometime forbidding region. The Great Silk Route ran to the West through it, while nomad and urban peoples combined over the centuries to produce a cultural flowering under Timur and his successors in the late medieval and early modern periods, through a rich profusion of artistic and architectural styles and ornament.\r\n\r\nThis text is spiced with quotations from the works of contemporary travelers, while providing an expert&apos;s commentary on the archaeological, architectural, and decorative features of the sites he describes. Stunning and evocative photographs are supplemented by numerous maps, incorporating the recent developments in the region&apos;s borders and frontiers. With up-to-date information on borders, check points, and visas, this book should appeal not only to scholars and those interested in the great cultural heritage of this region, but also to travelers to the region.\r\n\r\nEdgar Knobloch first visited Central Asia in 1959 and has researched and photographed archaeological and architectural monuments throughout the Islamic world ever since. His photographs have been exhibited at the British Museum and the Royal Geographic Society.\r\n\r\nPaperback: 248 pages\r\nPublisher: The History Press; Reprint edition (June 1, 2013)","last_updated":"2018-09-22T12:35:16.400Z","parsed":{"xt":"urn:btih:a5ac50acca7f0642951a229161b50d707f17e59e","dn":"Treasures of the Great Silk Road","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a5ac50acca7f0642951a229161b50d707f17e59e","infoHashBuffer":{"type":"Buffer","data":[165,172,80,172,202,127,6,66,149,26,34,145,97,181,13,112,127,23,229,158]},"name":"Treasures of the Great Silk Road","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}