{"title":"The Girls in the Picture by Melanie Benjamin EPUB","magnet":"magnet:?xt=urn:btih:a6e3821ccef18fb6e81a77250feef2d292127fb6&dn=The+Girls+in+the+Picture+by+Melanie+Benjamin+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2516074","seeders":"29","leechers":"4","description":"xx\r\n\r\nThe Girls in the Picture by Melanie Benjamin EPUB\r\n\r\nA fascinating novel of the friendship and creative partnership between two of Hollywood&apos;s earliest female legends - screenwriter Frances Marion and superstar Mary Pickford - from the New York Times best-selling author of The Swans of Fifth Avenue and The Aviator&apos;s Wife\r\n\r\nIt is 1914, and 25-year-old Frances Marion has left her (second) husband and her Northern California home for the lure of Los Angeles, where she is determined to live independently as an artist. But the word on everyone&apos;s lips these days is &quot;flickers&quot; - the silent moving pictures enthralling theatergoers. Turn any corner in this burgeoning town and you&apos;ll find made-up actors running around, as a movie camera captures it all.\r\n\r\nIn this fledgling industry, Frances finds her true calling: writing stories for this wondrous new medium. She also makes the acquaintance of actress Mary Pickford, whose signature golden curls and lively spirit have earned her the title &quot;America&apos;s Sweetheart&quot;. The two ambitious young women hit it off instantly, their kinship fomented by their mutual fever to create, to move audiences to a frenzy, to start a revolution.\r\n\r\nBut their ambitions are challenged by both the men around them and the limitations imposed on their gender - and their astronomical success could come at a price. As Mary, the world&apos;s highest paid and most beloved actress, struggles to live her life under the spotlight, she also wonders if it is possible to find love, even with the dashing actor Douglas Fairbanks. Frances, too, longs to share her life with someone. As in any good Hollywood story, dramas will play out, personalities will clash, and even the deepest friendships might be shattered.\r\n\r\nWith cameos from such notables as Charlie Chaplin, Louis B. Mayer, Rudolph Valentino, and Lillian Gish, The Girls in the Picture is, at its heart, a story of friendship and forgiveness. Melanie Benjamin perfectly captures the dawn of a glittering new era - its myths and icons, its possibilities and potential, and its seduction and heartbreak.\r\n\r\nxx","last_updated":"2018-01-18T19:01:18.436Z","parsed":{"xt":"urn:btih:a6e3821ccef18fb6e81a77250feef2d292127fb6","dn":"The Girls in the Picture by Melanie Benjamin EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a6e3821ccef18fb6e81a77250feef2d292127fb6","infoHashBuffer":{"type":"Buffer","data":[166,227,130,28,206,241,143,182,232,26,119,37,15,238,242,210,146,18,127,182]},"name":"The Girls in the Picture by Melanie Benjamin EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}