{"title":"Where They Found Her: A Novel by Kimberly McCreight EPUB","magnet":"magnet:?xt=urn:btih:a7f24d51512157ed9d811c83187573658dee2f5d&dn=Where+They+Found+Her%3A+A+Novel+by+Kimberly+McCreight+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"490792","seeders":"32","leechers":"6","description":"xx\r\n\r\nWhere They Found Her: A Novel by Kimberly McCreight EPUB\r\n\r\nFrom the author of the New York Times best seller and 2014 Edgar and Anthony nominee Reconstructing Amelia comes another harrowing, gripping novel that marries psychological suspense with an emotionally powerful story about a community struggling with the consequences of a devastating discovery.\r\n\r\nAt the end of a long winter in well-to-do Ridgedale, New Jersey, the body of an infant is discovered in the woods near the town&apos;s prestigious university campus. No one knows who the baby is or how her body ended up out there. But there is no shortage of opinions.\r\n\r\nWhen freelance journalist and recent Ridgedale transplant Molly Anderson is unexpectedly called upon to cover the story for the Ridgedale Reader, it&apos;s a risk, given the severe depression that followed the loss of her own baby. But the bigger threat comes when Molly unearths some of Ridgedale&apos;s darkest secrets, including a string of unreported sexual assaults going back 20 years. Meanwhile Sandy, a high-school dropout, searches for her volatile and now missing mother, and PTA president Barbara struggles to help her young son, who&apos;s suddenly having disturbing outbursts.\r\n\r\nTold from the perspectives of Molly, Barbara, and Sandy, Kimberly McCreight&apos;s taut and profoundly moving novel unwinds the tangled truth about the baby&apos;s death, revealing that these three women have far more in common than they realized. That the very worst crimes are committed against those we love. And that - sooner or later - the past catches up to all of us.\r\n\r\nxx","last_updated":"2018-07-03T12:11:53.202Z","parsed":{"xt":"urn:btih:a7f24d51512157ed9d811c83187573658dee2f5d","dn":"Where They Found Her: A Novel by Kimberly McCreight EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a7f24d51512157ed9d811c83187573658dee2f5d","infoHashBuffer":{"type":"Buffer","data":[167,242,77,81,81,33,87,237,157,129,28,131,24,117,115,101,141,238,47,93]},"name":"Where They Found Her: A Novel by Kimberly McCreight EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}