{"title":"The Removes by Tatjana Soli EPUB","magnet":"magnet:?xt=urn:btih:a8ce20f04608727bb7c082ed494b807f20a7bba0&dn=The+Removes+by+Tatjana+Soli+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"13147354","seeders":"24","leechers":"5","description":"xx\r\n\r\nThe Removes by Tatjana Soli EPUB\r\n\r\nAs the first wave of pioneers travel westward to settle the American frontier, two women discover their inner strength when their lives are irrevocably changed by the hardship of the wild west in The Removes, a historical book from New York Times best-selling and award-winning author Tatjana Soli.\r\n\r\nSpanning the years of the first great settlement of the west, The Removes tells the intertwining stories of 15-year-old Anne Cummins, frontierswoman Libbie Custer, and Libbie&#x2019;s husband, the Civil War hero George Armstrong Custer. When Anne survives a surprise attack on her family&#x2019;s homestead, she is thrust into a difficult life she never anticipated - living among the Cheyenne as both a captive and, eventually, a member of the tribe. Libbie, too, is thrown into a brutal, unexpected life when she marries Custer. They move out to the territories with the US Army, where Libbie is challenged daily and her worldview expanded: the pampered daughter of a small-town judge, she transforms into a daring camp follower. But when what Anne and Libbie have come to know - self-reliance, freedom, danger - is suddenly altered through tragedy and loss, they realize how indelibly shaped they are by life on the treacherous, extraordinary American plains. \r\n\r\nWith taut, suspenseful writing, Tatjana Soli tells the exhilarating stories of Libbie and Anne, who have grown like weeds into women unwilling to be restrained by the strictures governing 19th-century society. The Removes is a powerful, transporting book about the addictive intensity and freedom of the American frontier.\r\n\r\nxx","last_updated":"2018-06-14T12:14:35.697Z","parsed":{"xt":"urn:btih:a8ce20f04608727bb7c082ed494b807f20a7bba0","dn":"The Removes by Tatjana Soli EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a8ce20f04608727bb7c082ed494b807f20a7bba0","infoHashBuffer":{"type":"Buffer","data":[168,206,32,240,70,8,114,123,183,192,130,237,73,75,128,127,32,167,187,160]},"name":"The Removes by Tatjana Soli EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}