{"title":"Relics: Travels in Nature's Time Machine .PDF","magnet":"magnet:?xt=urn:btih:a9107a6b2e6e40d29074a7f1eacb9f457b244797&dn=Relics%3A+Travels+in+Nature%27s+Time+Machine+.PDF&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"CopperSun","categoryP":"other","categoryS":"e_books","size":"63697613","seeders":"41","leechers":"14","description":"Relics: Travels in Nature&apos;s Time Machine \r\n\r\nBy Piotr Naskrecki \r\n\r\n\r\n\r\nOn any night in early June, if you stand on the right beaches of America&#x2019;s East Coast, you can travel back in time all the way to the Jurassic. For as you watch, thousands of horseshoe crabs will emerge from the foam and scuttle up the beach to their spawning grounds, as they&#x2019;ve done, nearly unchanged, for more than 440 million years.\r\n\r\nHorseshoe crabs are far from the only contemporary manifestation of Earth&#x2019;s distant past, and in Relics, world-renowned zoologist and photographer Piotr Naskrecki leads readers on an unbelievable journey through those lingering traces of a lost world. With camera in hand, he travels the globe to create a words-and-pictures portrait of our planet like no other, a time-lapse tour that renders Earth&#x2019;s colossal age comprehensible, visible in creatures and habitats that have persisted, nearly untouched, for hundreds of millions of years.\r\n\r\nNaskrecki begins by defining the concept of a relic&#x2014;a creature or habitat that, while acted upon by evolution, remains remarkably similar to its earliest manifestations in the fossil record. Then he pulls back the Cambrian curtain to reveal relic after eye-popping relic: katydids, ancient reptiles, horsetail ferns, majestic magnolias, and more, all depicted through stunning photographs and first-person accounts of Naskrecki&#x2019;s time studying them and watching their interactions in their natural habitats. Then he turns to the habitats themselves, traveling to such remote locations as the Atewa Plateau of Africa, the highlands of Papua New Guinea, and the lush forests of the Guyana Shield of South America&#x2014;a group of relatively untrammeled ecosystems that are the current end point of staggeringly long, uninterrupted histories that have made them our best entryway to understanding what the prehuman world looked, felt, sounded, and even smelled like.\r\n\r\nThe stories and images of Earth&#x2019;s past assembled in Relics are beautiful, breathtaking, and unmooring, plunging the reader into the hitherto incomprehensible reaches of deep time. We emerge changed, astonished by the unbroken skein of life on Earth and attentive to the hidden heritage of our planet&#x2019;s past that surrounds us","last_updated":"2018-09-09T12:22:30.335Z","parsed":{"xt":"urn:btih:a9107a6b2e6e40d29074a7f1eacb9f457b244797","dn":"Relics: Travels in Nature's Time Machine .PDF","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a9107a6b2e6e40d29074a7f1eacb9f457b244797","infoHashBuffer":{"type":"Buffer","data":[169,16,122,107,46,110,64,210,144,116,167,241,234,203,159,69,123,36,71,151]},"name":"Relics: Travels in Nature's Time Machine .PDF","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}