{"title":"The People vs Tech by Jamie Bartlett EPUB","magnet":"magnet:?xt=urn:btih:a9620bba26603f68481ee304637319427c443fd2&dn=The+People+vs+Tech+by+Jamie+Bartlett+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"420782","seeders":"49","leechers":"5","description":"xx\r\n\r\nThe People vs Tech by Jamie Bartlett EPUB\r\n\r\nIn the ongoing waves of thescandal, this is the book that explains all the dangers of the digital revolution, and how our mountains of personal cyberdata are being mined by everyone from our own governments and political parties to big business to exploit our trust and threaten our freedom.\r\n\r\nThe Internet was meant to set us free. But have we unwittingly handed too much away to shadowy powers behind a wall of code, all manipulated by a handful of Silicon Valley utopians, ad men, and venture capitalists? And, in light of recent data breach scandals around companies likeand Cambridge Analytica, what does that mean for democracy, our delicately balanced system of government that was created long before big data, total information, and artificial intelligence? In this urgent polemic, Jamie Bartlett argues that through our unquestioning embrace of big tech, the building blocks of democracy are slowly being removed. The middle class is being eroded, sovereign authority and civil society are weakened, and we citizens are losing our critical faculties, maybe even our free will.\r\n\r\nThe People vs Tech is an enthralling account of how our fragile political system is being threatened by the digital revolution. Bartlett explains that by upholding six key pillars of democracy, we can save it before it is too late. We need to become active citizens, uphold a shared democratic culture, protect free elections, promote equality, safeguard competitive and civic freedoms, and trust in a sovereign authority. This essential book shows that the stakes couldn&apos;t be higher and that, unless we radically alter our course, democracy will join feudalism, supreme monarchies, and communism as just another political experiment that quietly disappeared.\r\n\r\nxx","last_updated":"2018-04-13T16:03:10.507Z","parsed":{"xt":"urn:btih:a9620bba26603f68481ee304637319427c443fd2","dn":"The People vs Tech by Jamie Bartlett EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a9620bba26603f68481ee304637319427c443fd2","infoHashBuffer":{"type":"Buffer","data":[169,98,11,186,38,96,63,104,72,30,227,4,99,115,25,66,124,68,63,210]},"name":"The People vs Tech by Jamie Bartlett EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}