{"title":"Far Cry 2: Fortune's Edition","magnet":"magnet:?xt=urn:btih:a9e4d85c73dad4ad9f42855cd324e17446a4db95&dn=Far+Cry+2%3A+Fortune%27s+Edition&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"freedisk","categoryP":"games","categoryS":"pc","size":"2600400695","seeders":"0","leechers":"2","description":"You are a gun for hire, trapped in a war-torn African state, stricken with malaria and forced to make deals with corrupt warlords on both sides of the conflict in order to make this country your home.\r\nYou must identify and exploit your enemies&apos; weaknesses, neutralizing their superior numbers and firepower with surprise, subversion, cunning and of course brute force.\r\n\r\nFire ? Feel the heat of the most realistic fire ever seen in a video game! Use wind and propagation to surround and trap your enemies. Grab your Molotov cocktails or flamethrowers to take out your enemies.\r\nDestructible environment ? No more obstacles: Everything is breakable and alterable, even in Multiplayer mode. The DUNIA engine&apos;s RealTree technology also delivers the most realistic nature deterioration system ever.\r\nOpen world ? Experience real freedom while roaming in more than 50km2 without any loading. Choose your own path in this vast environment and explore a living African world.\r\n\r\nA huge adventure ? Fight for two rival factions, and make your way up to your primary target by any means necessary. Take on over 70 side missions to earn valuable information, new weapons and vehicles.\r\nNon-scripted artificial intelligence ? Medics will drag wounded soldiers to safety. Grunts will come to fear you. Your reputation and in-game actions will make enemies drop their guns and run for their lives. Feel the tension of never knowing just how an enemy will react.\r\n\r\nMULTIPLAYER ? Challenge your friends but watch your back?you never know who your true friends are and who might betray you! All the single player technical features are also present in multiplayer mode.\r\nFar Cry 2: Fortune&apos;s Edition contains the full Far Cry 2 game, including all previously released patches and the Far Cry 2 Fortunes DLC with additional content listed below. \r\n\r\n*Single player additional content:\r\n*Three brand-new weapons: Silenced shotgun, Sawed-off shotgun, Crossbow\r\n*Two new vehicles: Unimog, Quad\r\n*Multiplayer additional content:\r\n*Additional weapons and four new exciting maps: Cheap Labor, Last Resort, Lake Smear, Fort Fury","last_updated":"2018-10-06T12:41:44.435Z","parsed":{"xt":"urn:btih:a9e4d85c73dad4ad9f42855cd324e17446a4db95","dn":"Far Cry 2: Fortune's Edition","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a9e4d85c73dad4ad9f42855cd324e17446a4db95","infoHashBuffer":{"type":"Buffer","data":[169,228,216,92,115,218,212,173,159,66,133,92,211,36,225,116,70,164,219,149]},"name":"Far Cry 2: Fortune's Edition","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}