{"title":"Barracoon by Zora Neale Hurston EPUB","magnet":"magnet:?xt=urn:btih:a9f1762177976bc030a7650c53c302bd1d779c27&dn=Barracoon+by+Zora+Neale+Hurston+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1709040","seeders":"1","leechers":"3","description":"xx\r\n\r\nBarracoon by Zora Neale Hurston EPUB\r\n\r\nA major literary event: a never-before-published work from the author of the American classic Their Eyes Were Watching God that brilliantly illuminates the horror and injustices of slavery as it tells the true story of one of the last known survivors of the Atlantic slave trade - abducted from Africa on the last &quot;Black Cargo&quot; ship to arrive in the United States.\r\n\r\nIn 1927, Zora Neale Hurston went to Plateau, Alabama, just outside Mobile, to interview 86-year-old Cudjo Lewis. Of the millions of men, women, and children transported from Africa to America as slaves, Cudjo was then the only person alive to tell the story of this integral part of the nation&apos;s history. Hurston was there to record Cudjo&apos;s firsthand account of the raid that led to his capture and bondage 50 years after the Atlantic slave trade was outlawed in the United States.\r\n\r\nIn 1931, Hurston returned to Plateau, the African-centric community three miles from Mobile founded by Cudjo and other former slaves from his ship. Spending more than three months there, she talked in depth with Cudjo about the details of his life. During those weeks, the young writer and the elderly formerly enslaved man ate peaches and watermelon that grew in the backyard and talked about Cudjo&apos;s past - memories from his childhood in Africa, the horrors of being captured and held in a barracoon for selection by American slavers, the harrowing experience of the Middle Passage packed with more than 100 other souls aboard the Clotilda, and the years he spent in slavery until the end of the Civil War.\r\n\r\nBased on those interviews, featuring Cudjo&apos;s unique vernacular, and written from Hurston&apos;s perspective with the compassion and singular style that have made her one of the preeminent American authors of the 20th-century, Barracoon brilliantly illuminates the tragedy of slavery and of one life forever defined by it. Offering insight into the pernicious legacy that continues to haunt us all, black and white, this poignant and powerful work is an invaluable contribution to our shared history and culture.\r\n\r\nxx","last_updated":"2018-05-10T12:02:21.858Z","parsed":{"xt":"urn:btih:a9f1762177976bc030a7650c53c302bd1d779c27","dn":"Barracoon by Zora Neale Hurston EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a9f1762177976bc030a7650c53c302bd1d779c27","infoHashBuffer":{"type":"Buffer","data":[169,241,118,33,119,151,107,192,48,167,101,12,83,195,2,189,29,119,156,39]},"name":"Barracoon by Zora Neale Hurston EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}