{"title":"Rooms: A Novel by Lauren Oliver EPUB","magnet":"magnet:?xt=urn:btih:aa035a165c6269f672e1a121bc01bea8dd618d3b&dn=Rooms%3A+A+Novel+by+Lauren+Oliver+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"397371","seeders":"40","leechers":"2","description":"xx\r\n\r\nRooms: A Novel by Lauren Oliver EPUB\r\n\r\nAfter a number of highly acclaimed New York Times best sellers, including the Delirium trilogy and the standalone novels Before I Fall and Panic, Lauren Oliver returns with a spellbinding tale that confirms her place as one of our finest storytellers. Fueled by the same inspired feel for plot and character that drew readers to Oliver&apos;s earlier works, Rooms is a mesmerizing and suspenseful story of guilt, love, and family secrets.\r\n\r\nEstranged patriarch Richard Walker has died, leaving behind a country house full of rooms packed with the detritus of a lifetime. His alienated family - bitter ex-wife Caroline, troubled teenage son Trenton, and unforgiving daughter Minna - have arrived for their inheritance. But the Walkers are not alone.\r\n\r\nAlice and Sandra, two long-dead and restless ghosts, linger within the house&apos;s claustrophobic walls, bound eternally to its physical structure. Jostling for space and memory, they observe the family, trading barbs and reminiscences about their past lives. Though their voices cannot be heard, Alice and Sandra speak through the house itself - in the hiss of the radiator, a creak in the stairs, the dimming of a light bulb. The living and dead are haunted by painful truths that surface with explosive force. When a new ghost appears, and Trenton begins to communicate with her, the spirit and human worlds collide - with cataclysmic results.\r\n\r\nElegantly constructed and brilliantly paced, Rooms is an enticing and imaginative ghost story and a searing family drama that is as haunting as it is resonant.\r\n\r\nxx","last_updated":"2018-09-20T12:22:35.760Z","parsed":{"xt":"urn:btih:aa035a165c6269f672e1a121bc01bea8dd618d3b","dn":"Rooms: A Novel by Lauren Oliver EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aa035a165c6269f672e1a121bc01bea8dd618d3b","infoHashBuffer":{"type":"Buffer","data":[170,3,90,22,92,98,105,246,114,225,161,33,188,1,190,168,221,97,141,59]},"name":"Rooms: A Novel by Lauren Oliver EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}