{"title":"Gideon Crew [1-5  Fixed] - Douglas Preston, Lincoln Child","magnet":"magnet:?xt=urn:btih:aa26ba31d74d99c23f786e58a6640ef47d7b9f92&dn=Gideon+Crew+%5B1-5++Fixed%5D+-+Douglas+Preston%2C+Lincoln+Child&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ComGetMe","categoryP":"audio","categoryS":"audio_books","size":"1485482902","seeders":"50","leechers":"22","description":"Gideon&apos;s Sword:\r\nIntroducing Gideon Crew: trickster, prodigy, master thief...\r\nAt 12, Gideon Crew witnessed his father, a world class mathematician, accused of treason and gunned down. At 24, summoned to his dying mother&#x2019;s bedside, Gideon learned the truth: His father was framed. With her last breath, she begged her son to avenge him. Now, with a new purpose in his life, Gideon crafts a one time mission of vengeance, aimed at the perpetrator of his father&#x2019;s destruction. But from the shadows, someone is watching. \r\n\r\nA very powerful someone, who is impressed by Gideon&#x2019;s special skills. \r\n\r\n\r\n   Gideon&apos;s Corpse:\r\nA top nuclear scientist goes mad and takes an innocent family hostage at gunpoint, killing one and causing a massive standoff.\r\nA plume of radiation above New York City leads to a warehouse where, it seems, a powerful nuclear bomb was assembled just hours before.Sifting through the evidence, authorities determine that the unthinkable is about to happen: In ten days, a major American city will be vaporized by a terrorist attack.\r\n\r\n\r\n   The Lost Island:\r\nGideon Crew, brilliant scientist, master thief is living on borrowed time. \r\nWhen his mysterious employer, Eli Glinn, gives him a mission, he has no reason to refuse. Gideon&#x2019;s task: steal a page from the priceless Book of Kells, on display in New York City. Accomplishing the impossible, Gideon steals the parchment only to learn that beneath the illuminated image is a treasure map dating back to the timealize, the treasure it leads to is something far more precious: A discovery that could save Gideon&#x2019;s life.\r\n\r\n\r\n   Beyond the Ice Limit:\r\nFive years ago, the mysterious and inscrutable head of Effective Engineering Solutions, Eli Glinn, led a mission to recover a gigantic meteorite&#x2013;the largest ever discovered&#x2013;from a remote island off the coast of South America. The mission ended in disaster when their ship, the Rolvaag, foundered in a vicious storm in the Antarctic Sea and broke apart, sinking&#x2014;along with its unique cargo&#x2014;to the ocean floor. One hundred and eight crew members perished, and Eli Glinn was left paralyzed.\r\n\r\nBut this was not all. The tragedy revealed something truly terrifying: the meteorite they tried to retrieve was not, in fact, simply a rock. Instead, it was a complex organism from the deep reaches of space.\r\n\r\n\r\n   The Pharaoh Key:\r\n&#x201C;I just want to be crystal clear about this: if it has value, we&#x2019;re gonna steal it. Are you with me?&#x201D;\r\nGideon Crew,is shocked when his former employer, Eli Glinn, vanishes without a trace, and Glinn&#x2019;s high tech lab Effective Engineering Solutions shuts down seemingly overnight. Crew is contacted by one of his former coworkers at EES, Manuel Garza, who has a bead on one final treasure hinted at, the long awaited translation of a centuries old stone tablet of a previously undiscovered civilization: The Phaistos Disc.\r\n\r\n\r\nUnabridged\r\nNarrated By: John Glove, David Collins\r\nFormat: Stereo MP3","last_updated":"2018-09-30T12:30:18.625Z","parsed":{"xt":"urn:btih:aa26ba31d74d99c23f786e58a6640ef47d7b9f92","dn":"Gideon Crew [1-5  Fixed] - Douglas Preston, Lincoln Child","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aa26ba31d74d99c23f786e58a6640ef47d7b9f92","infoHashBuffer":{"type":"Buffer","data":[170,38,186,49,215,77,153,194,63,120,110,88,166,100,14,244,125,123,159,146]},"name":"Gideon Crew [1-5  Fixed] - Douglas Preston, Lincoln Child","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}