{"title":"Glimpse: A Novel by Jonathan Maberry EPUB","magnet":"magnet:?xt=urn:btih:aa3fed190b6fe919704bbf857435e296f5c12439&dn=Glimpse%3A+A+Novel+by+Jonathan+Maberry+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2516322","seeders":"34","leechers":"6","description":"xx\r\n\r\nGlimpse: A Novel by Jonathan Maberry EPUB\r\n\r\nBest-selling author Jonathan Maberry&apos;s Glimpse is a chilling book thriller that explores what happens when reality and nightmares converge, and how far one will go to protect the innocent when their own brain is a threat.\r\n\r\nRain Thomas is a mess. Seven years an addict and three difficult years clean. Racked by guilt for the baby she gave up for adoption when she was 16. Still grieving for the boy&#x2019;s father who died in Iraq. Alone, discarded by her family, with only the damaged members of her narcotics anonymous meetings as friends. Them, and the voices in her head. One morning, on the way to a much-needed job interview, she borrows reading glasses to review her resume. There is a small crack in one lens and through that damaged slice of glass she sees a young boy go running down the aisle of the subway train. Is he screaming with laughter or just screaming? When she tries to find the boy, he&#x2019;s gone and no one has seen him.\r\n\r\nThe day spins out of control. Rain loses whole chunks of time. The voices she hears are telling her horrible things. And Doctor Nine, a spectral boogey man conjured in drug induced hallucinogens is now hunting her in the real world. Doctor Nine is also chasing that boy. A boy who looks so much like Rain&#x2019;s dead boyfriend. Unsure whether she is insane or if the world itself is broken, Rain begins a mother&#x2019;s quest for her lost child through a world where reality and nightmare are in a head-on collision. How far will one person go to save someone they love?\r\n\r\nxx","last_updated":"2018-04-12T17:48:35.404Z","parsed":{"xt":"urn:btih:aa3fed190b6fe919704bbf857435e296f5c12439","dn":"Glimpse: A Novel by Jonathan Maberry EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aa3fed190b6fe919704bbf857435e296f5c12439","infoHashBuffer":{"type":"Buffer","data":[170,63,237,25,11,111,233,25,112,75,191,133,116,53,226,150,245,193,36,57]},"name":"Glimpse: A Novel by Jonathan Maberry EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}