{"title":"Jefferson Airplane - Signes Last,The Fillmore,SF 1966 ak","magnet":"magnet:?xt=urn:btih:aaaeffed9e4a753acc509f0c76da3bd7b82deb01&dn=Jefferson+Airplane+-+Signes+Last%2CThe+Fillmore%2CSF+1966+ak&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"analogkid6103","categoryP":"audio","categoryS":"other","size":"141304875","seeders":"2","leechers":"0","description":"Jefferson Airplane - Signes Last,The Fillmore,San Francisco 1966 ak320 \r\n\r\n\r\nMarty Balin died Sept.28th in Tampa, Florida \r\nThe dark-eyed, baby-faced Balin was an ex-folk musician who formed the Airplane in 1965 and within two years was at the heart of a nationwide wave that briefly rivaled the Beatles&apos; influence and even helped inspire the Beatles&apos; &quot;Sgt. Pepper&quot; album. The Airplane was the breakout act among such San Francisco-based artists as the Grateful Dead and Janis Joplin, many of whom played early shows at the Matrix, a ballroom Balin helped run and for which the Airplane served as house band. Balin met folk musician Paul Kantner at another local club, the Drinking Gourd. Kantner, a native San Franciscan, had started out performing on the Bay Area folk circuit in the early 1960s Balin and Kantner then recruited other musicians to form the house band at the Matrix. After hearing female vocalist Signe Toly Anderson at the Drinking Gourd, Balin invited her to be the group&apos;s co-lead singer. Anderson sang with the band for a year and performed on their first album before departing in October 1966 after the birth of her first child \r\n\r\nThe following night, Anderson&apos;s replacement Grace Slick made her first appearance. Slick was already well known to the band&#x2014;she had attended the Airplane&apos;s debut gig at the Matrix in 1965 and her previous group, the Great Society, had  supported the Airplane in concert. \r\nBill Graham took over from Bill Thompson as manager. In January the group made their first visit to the East Coast. On January 14, alongside the Grateful Dead and Quicksilver Messenger Service, Later In a incident at a concert in Amsterdam, while the Airplane was performing &quot;Plastic Fantastic Lover&quot;, Doors singer Jim Morrison, under the influence of a combination of Drugs, appeared on stage and began dancing &quot;like a pinwheel&quot;. As the group played faster and faster, Morrison spun around wildly until he finally fell senseless on the stage at Marty Balin&apos;s feet. Morrison was unable to perform his set with the Doors and was hospitalized.. Later at Altamont Marty Balin was knocked out during a scuffle with Hells Angels members who had been hired to act as &quot;security. The fatal stabbing of black teenager Meredith Hunter in front of the stage after he pulled out a revolver during the Stones&apos; performance. Gimme Shelter The Players were definitely way up in the mix and in time \r\nThe Airplane was inducted into the Rock and Roll Hall of Fame in 1996, but Balin would long have mixed feelings. \r\n\r\nmp3 ak320 [132 mb] \r\nsq: A+ \r\n\r\nTracklist \r\nSigne&apos;s Last \r\n\r\n\r\n01 Jam \r\n02 3/5th Of A Mile In 10 Seconds \r\n03 It&apos;s Alright \r\n04 Tobacco Road \r\n05 Come Up The Years \r\n06 Go To Her \r\n07 Fat Angel \r\n08 And I Like It \r\n09 Midnight Hour \r\n10 Goodbye to Signe \r\n11 Chauffeur Blues \r\n12 High Flying Bird \r\n13 Goodbye to Signe \r\n\r\ntt: 57:38 \r\n\r\nPlayers \r\nSigne Toly Anderson - vocals (Died 2016) \r\nMarti Balin - vocals (Died 2018) \r\nJorma Kaukonen - guitar \r\nPaul Kantner - guitar(Died 2016) \r\nJack Casady - bass \r\nSpencer Dryden - drums(Died 2005) \r\n\r\nMarty Balin died Thursday Sept. 28 2018.  Spencer Dryden died of colon cancer on January 11, 2005. \r\nBoth Signe Anderson and Paul Kantner died on January 28, 2016","last_updated":"2018-10-07T12:08:20.191Z","parsed":{"xt":"urn:btih:aaaeffed9e4a753acc509f0c76da3bd7b82deb01","dn":"Jefferson Airplane - Signes Last,The Fillmore,SF 1966 ak","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aaaeffed9e4a753acc509f0c76da3bd7b82deb01","infoHashBuffer":{"type":"Buffer","data":[170,174,255,237,158,74,117,58,204,80,159,12,118,218,59,215,184,45,235,1]},"name":"Jefferson Airplane - Signes Last,The Fillmore,SF 1966 ak","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}