{"title":"Science, Culture and the Search for Life on Other Worlds","magnet":"magnet:?xt=urn:btih:aaf74116363c61395ef4678cfef1b898eede9695&dn=Science%2C+Culture+and+the+Search+for+Life+on+Other+Worlds&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"bookflare","categoryP":"other","categoryS":"e_books","size":"6068350","seeders":"2","leechers":"1","description":"Description\r\nThis book explores humanity&#x2019;s thoughts and ideas about extraterrestrial life, paying close attention to the ways science and culture interact with one another to create a context of imagination and discovery related to life on other worlds. Despite the recent explosion in our knowledge of other planets and the seeming era of discovery in which we live, to date we have found no concrete evidence that we are not alone. Our thinking about life on other worlds has been and remains the product of a combination of scientific investigation and human imagination shaped by cultural values&#x2013;particularly values of exploration and discovery connected to American society. The rapid growth in our awareness of other worlds makes this a crucial moment to think about and assess the influence of cultural values on the scientific search for extraterrestrial life. Here the author considers the junction of science and culture with a focus on two main themes: (1) the underlying assumptions, many of which are tacitly based upon cultural values common in American society, that have shaped the ways researchers in astrobiology and SETI have conceptualized the nature of their endeavor and represented ideas about the potential influence contact might have on human civilization, and (2) the empirical evidence we can access as a way of thinking about the social impact that contact with alien intelligence might have for humanity","last_updated":"2018-07-12T12:05:05.319Z","parsed":{"xt":"urn:btih:aaf74116363c61395ef4678cfef1b898eede9695","dn":"Science, Culture and the Search for Life on Other Worlds","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aaf74116363c61395ef4678cfef1b898eede9695","infoHashBuffer":{"type":"Buffer","data":[170,247,65,22,54,60,97,57,94,244,103,140,254,241,184,152,238,222,150,149]},"name":"Science, Culture and the Search for Life on Other Worlds","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}