{"title":"Harry: A Biography of a Prince by Angela Levin EPUB","magnet":"magnet:?xt=urn:btih:ab52ebdf44bfafd616718b226e37063f1fdd2cdc&dn=Harry%3A+A+Biography+of+a+Prince+by+Angela+Levin+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"42907557","seeders":"0","leechers":"0","description":"xx\r\n\r\nHarry: A Biography of a Prince by Angela Levin EPUB\r\n\r\nThis book is an eye-opening, monumental biography of Prince Harry by a veteran journalist on royal affairs who accompanied the prince on his royal duties for a year and was granted privileged access to his home in Kensington Palace.\r\n\r\nOnce a reckless rebel and now a respected role model, Prince Harry is one of the world&apos;s most popular royals and the force behind giving the British royal family a 21st-century makeover. How has he done it?\r\n\r\nThis insightful new biography is a three-dimensional look at what Harry is really like as a person, both on and off royal duty. It is written by distinguished journalist and author Angela Levin who accompanied Prince Harry on many of his engagements and had exclusive access to him at Kensington Palace.\r\n\r\nThe book unwraps the real man behind the camera and his own perceptive insights. It delves into his troubled childhood and the lasting effect of losing his adored mother - Diana, Princess of Wales - so young. It explores his rebellious teenage years and the key defining moments that have enabled him to face his demons and use this experience to help others who struggle with mental, emotional, and physical pain.\r\n\r\nAngela Levin found a complex man who has inherited his late mother&apos;s extraordinary charisma and is determined to &quot;make a difference&quot;. After finding the love of his life in Meghan Markle, and in anticipation of their marriage this year, this is an investigation into the real life of Prince Harry.\r\n\r\nxx","last_updated":"2018-05-13T12:02:11.742Z","parsed":{"xt":"urn:btih:ab52ebdf44bfafd616718b226e37063f1fdd2cdc","dn":"Harry: A Biography of a Prince by Angela Levin EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ab52ebdf44bfafd616718b226e37063f1fdd2cdc","infoHashBuffer":{"type":"Buffer","data":[171,82,235,223,68,191,175,214,22,113,139,34,110,55,6,63,31,221,44,220]},"name":"Harry: A Biography of a Prince by Angela Levin EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}