{"title":"Lessons: My Path to a Meaningful Life by Gisele Bundchen EPUB","magnet":"magnet:?xt=urn:btih:ab5f9f21ebbd00f901c4ebd9a6e6174bee986f34&dn=Lessons%3A+My+Path+to+a+Meaningful+Life+by+Gisele+Bundchen+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"72253409","seeders":"0","leechers":"0","description":"xx\r\n\r\nLessons: My Path to a Meaningful Life by Gisele B&#xFC;ndchen EPUB\r\n\r\nThe supermodel, entrepreneur, activist, and philanthropist shares the lessons that have helped shape her life. \r\n\r\nGisele B&#xFC;ndchen&apos;s journey began in southern Brazil, growing up with five sisters, playing volleyball, and rescuing the dogs and cats around her hometown. In fact, she wanted to become either a professional volley player or a veterinarian. But at the age of 14, fate suddenly intervened in in the form of a modeling scout, who spotted her in S&#xE3;o Paulo. Four years later, Gisele&apos;s appearance in Alexander McQueen&apos;s memorably rain-soaked London runway show in the spring 1998 launched her spectacular career as a fashion model, and put an end to the &quot;heroin chic&quot; era of fashion. Since then, Gisele has appeared in almost 400 ad campaigns and on more than 1,200 magazine covers. She has walked in more than 470 fashion shows for the most influential brands in the world. Gisele has become an icon, leaving a lasting mark on the fashion industry.  \r\n\r\nBut until now, few people have gotten to know the real Gisele, a woman whose private life stands in dramatic contrast to her public image. In Lessons, she reveals for the first time who she really is and what she&apos;s learned over the past 37 years to help her live a meaningful life - a journey that takes readers from a childhood spent barefoot in small-town Brazil, to an internationally successful career, motherhood, and marriage to quarterback Tom Brady.  \r\n\r\nA work of great openness and vulnerability, Lessons reveals the inner life of a very public woman.\r\n\r\nxx","last_updated":"2018-10-03T12:01:13.498Z","parsed":{"xt":"urn:btih:ab5f9f21ebbd00f901c4ebd9a6e6174bee986f34","dn":"Lessons: My Path to a Meaningful Life by Gisele Bundchen EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ab5f9f21ebbd00f901c4ebd9a6e6174bee986f34","infoHashBuffer":{"type":"Buffer","data":[171,95,159,33,235,189,0,249,1,196,235,217,166,230,23,75,238,152,111,52]},"name":"Lessons: My Path to a Meaningful Life by Gisele Bundchen EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}