{"title":"iSocial v1.1 - Social Network Platform","magnet":"magnet:?xt=urn:btih:aba7c54dc0c4faaa96172c8f9172e038868181e3&dn=iSocial+v1.1+-+Social+Network+Platform&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Shadow","categoryP":"other","categoryS":"other","size":"2099496","seeders":"0","leechers":"0","description":"Visit us on:  <a href=\"\nhttps://www.nulledforums.org\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.nulledforums.org</a>\r\nIf there are no seeds, use our forum for direct download links!\r\n\r\n\r\n \r\nWith iSocial you can start your own social network. iSocial included as features: Pages, Groups, Messages, Live Chat, Comments, Share&#x2019;s, Like&#x2019;s, Real-time Notifications. Games, Marketplace, Library, etc. Users will have a private profiles, only for friends or public profiles. Also can comment in posts. Users can decide which of your posts will be public, and which posts only for friends. These are only some of the functionalities that do of &#x201C;iSocial&#x201D; the ideal social network for you to have your own community of friends.\r\n\r\nFeatures\r\n\r\n[*]Authentication: You can authenticate withTwitter, or your email.\r\n[*]Cover and Photo in User Profile: iSocial is in keeping with the trend of modern social networks. iSocial provides a user profile with photo and cover..\r\n[*]Groups and Pages: iSocial lets you create unlimited Fan Pages and unlimited Groups.\r\n[*]Notifications in Real Time: Constantly you will receive notifications in real time. When someone comments on your posts, when someone made like on your posts, etc.\r\n[*]Preview Card: You can see a &#x201C;preview&#x201D; of a user profile through an Preview Card.\r\n[*]Live Chat: Chat with your friends using a super modern and very functional chat.\r\n[*]Responsive: 100% mobile responsive design.\r\n[*]Multi Languages: Initially it comes with two languages (English and Spanish). But you can create the languages you want. This is very easy.\r\n[*]Delete and Edit Posts: So that users have control of the contents at all times.\r\n[*]Save Posts: If you do not have time to read right now, then you save it and read it when you have much more time.\r\n[*]Events: Create unlimited events for the activities that you consider necessary.\r\n[*]Marketplace: A store where users can see and publish the products they want.\r\n[*]Library: A place to read and publish articles of your inspiration.\r\n[*]Games: Have fun playing. There is always a time for fun.\r\n[*]Powerful Admin Panel: A maintenance area to be able to adjust what you think is necessary in iSocial.\r\n[*]App Android: It is including Android App (Viewer URL)","last_updated":"2018-07-01T12:00:38.059Z","parsed":{"xt":"urn:btih:aba7c54dc0c4faaa96172c8f9172e038868181e3","dn":"iSocial v1.1 - Social Network Platform","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aba7c54dc0c4faaa96172c8f9172e038868181e3","infoHashBuffer":{"type":"Buffer","data":[171,167,197,77,192,196,250,170,150,23,44,143,145,114,224,56,134,129,129,227]},"name":"iSocial v1.1 - Social Network Platform","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}