{"title":"The Person You Mean to Be.epub","magnet":"magnet:?xt=urn:btih:ac59e7a9a0bcd80d3b815724c33a34e8d6a48e32&dn=The+Person+You+Mean+to+Be.epub&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"32Skulls","categoryP":"other","categoryS":"e_books","size":"786042","seeders":"24","leechers":"5","description":"If you need a book I have uploaded that is no longer being seeded send me a message\r\n \r\n             via Suprbay:https://pirates-forum.org/User-1Edge\r\n\r\n***********************************************************************************\r\n\r\nThe Person You Mean to Be: How Good People Fight Bias\r\n\r\nBy Dolly Chugh\r\n\r\n\r\nDescription\r\n\r\nForeword by Laszlo Bock, the bestselling author of Work Rules! and former Senior Vice President of People Operations at Google\r\n\r\nAn inspiring guide from Dolly Chugh, an award-winning social psychologist at the New York University Stern School of Business, on how to confront difficult issues including sexism, racism, inequality, and injustice so that you can make the world (and yourself) better.\r\n\r\nMany of us believe in equality, diversity, and inclusion. But how do we stand up for those values in our turbulent world? The Person You Mean to Be is the smart, &quot;semi-bold&quot; person&#x2019;s guide to fighting for what you believe in.\r\n\r\nDolly reveals the surprising causes of inequality, grounded in the &quot;psychology of good people&quot;. Using her research findings in unconscious bias as well as work across psychology, sociology, economics, political science, and other disciplines, she offers practical tools to respectfully and effectively talk politics with family, to be a better colleague to people who don&#x2019;t look like you, and to avoid being a well-intentioned barrier to equality. Being the person we mean to be starts with a look at ourselves.\r\n\r\nShe argues that the only way to be on the right side of history is to be a good-ish&#x2014; rather than good&#x2014;person. Good-ish people are always growing. Second, she helps you find your &quot;ordinary privilege&quot;&#x2014;the part of your everyday identity you take for granted, such as race for a white person, sexual orientation for a straight person, gender for a man, or education for a college graduate. This part of your identity may bring blind spots, but it is your best tool for influencing change. Third, Dolly introduces the psychological reasons that make it hard for us to see the bias in and around us. She leads you from willful ignorance to willful awareness. Finally, she guides you on how, when, and whom, to engage (and not engage) in your workplaces, homes, and communities. Her science-based approach is a method any of us can put to use in all parts of our life.\r\n\r\nWhether you are a long-time activist or new to the fight, you can start from where you are. Through the compelling stories Dolly shares and the surprising science she reports, Dolly guides each of us closer to being the person we mean to be","last_updated":"2018-09-12T12:20:26.954Z","parsed":{"xt":"urn:btih:ac59e7a9a0bcd80d3b815724c33a34e8d6a48e32","dn":"The Person You Mean to Be.epub","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ac59e7a9a0bcd80d3b815724c33a34e8d6a48e32","infoHashBuffer":{"type":"Buffer","data":[172,89,231,169,160,188,216,13,59,129,87,36,195,58,52,232,214,164,142,50]},"name":"The Person You Mean to Be.epub","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}