{"title":"MomsTeachSex - Syren Demer (Spanked By My Stepmom) NEW 22 August","magnet":"magnet:?xt=urn:btih:ac635c5a9e8ba87fdff3a65b679fc708797ee99e&dn=MomsTeachSex+-+Syren+Demer+%28Spanked+By+My+Stepmom%29+NEW+22+August&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"501313389","seeders":"4","leechers":"12","description":"Syren Demer is feeling hot as she cleans the house while wearing a skimpy outfit. Kyle Mason had no idea his stepmom was such a babe until he catches a glimpse of her through the window. Pulling out his dick while he peeps, he enjoys the show as Syren keeps cleaning. His masturbation session can&#x2019;t last forever, and when Syren notices him staring through the window she&#x2019;s pissed! She pulls him into the house by his ear, then sends him to his room where she continues to yell at him.Fed up and out of ideas to parent her stepson better, Syren tells Kyle to pull down his pants so she can spank him. Getting his ass smacked just makes Kyle&#x2019;s dick harder, a fact that Syren can&#x2019;t fail to notice. As a last resort, she starts peeling off her skimpy clothes while telling Kyle to watch her if that&#x2019;s what he wants. She demands that he play with her tits when she pops them out of her bra, then shakes her ass in his direction as her thong holds on for dear life. Getting on her knees, Syren opens her mouth and switches from yelling to sucking.Grabbing Kyle by the hair, Syren pulls his face down to settle between her thighs. His tongue flicks out at her demand, licking her greedy twat until she&#x2019;s filled with sweet cream. Then Syren instructs Kyle to put it in as she bends over for a doggy style pussy pounding. When she&#x2019;s had her first climax, she positions her stepson on the bed so she can ride him as her knockers quiver right in his line of sight. She eventually cedes control back to Kyle, demanding that he get on his knees and fuck her cock hungry snatch until he gives her the creampie of hot cum that she craves.\r\nTags: Creampie, Big Boobs, Hardcore, Housewife, Milf, Girl-Boy, Blowjob, Swallow, Handjob, Girl Orgasm, Deep Throat, Trimmed, Pussy Licking, Big Tits\r\n <a href=\"\nhttp://imgdone.com/image/k6UIK\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/k6UIK</a>\r\n <a href=\"\nhttp://imgdone.com/image/k6dU2\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/k6dU2</a>","last_updated":"2018-08-22T12:03:42.725Z","parsed":{"xt":"urn:btih:ac635c5a9e8ba87fdff3a65b679fc708797ee99e","dn":"MomsTeachSex - Syren Demer (Spanked By My Stepmom) NEW 22 August","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ac635c5a9e8ba87fdff3a65b679fc708797ee99e","infoHashBuffer":{"type":"Buffer","data":[172,99,92,90,158,139,168,127,223,243,166,91,103,159,199,8,121,126,233,158]},"name":"MomsTeachSex - Syren Demer (Spanked By My Stepmom) NEW 22 August","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}