{"title":"Hans Jonas - Philosophical Works (4 books)","magnet":"magnet:?xt=urn:btih:ad4253e5b60a8773e4c1fac731aba0d079c1aabc&dn=Hans+Jonas+-+Philosophical+Works+%284+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"39086655","seeders":"9","leechers":"6","description":"\nHANS JONAS (1903-1993)  was an influential German-born American Jewish philosopher.\n\nIn 1933, having completed his doctoral work, Jonas fled Germany to London.  In 1935, he emigrated to Palestine and, at the onset of World War II, enlisted in the British Army, serving for five years in Italy and Germany.  It was not until the war&apos;s end that Jonas discovered that his mother had been executed at Auschwitz.  By his own account, the war years had a profound effect on his philosophical-theological outlook.  Through the atrocities of war, he came to be more conscious of human mortality and the fundamental similarities that human beings have with other organisms: biological life, death, hunger, and pain, and, most important, purposiveness.  This rethinking of philosophy established his philosophical agenda for the next two decades.\n\nJonas&apos;s writings had a significant impact in a number of different spheres.  THE GNOSTIC RELIGION (1958), based on his early research on the Gnosis, was for many years the standard work in English on the history of Gnosticism and interprets the religion from an existentialist viewpoint.  Jonas was also one of the pioneers in the field of biomedical ethics, making important contributions on the question of the definition of death, organ transplantation, and the moral problems of the use of human beings for medical research.  THE PHENOMENON OF LIFE (1966) formed the philosophical undergirding of one major school of bioethics in America.  Heavily influenced by Martin Heidegger, the book attempts to synthesize the philosophy of matter with the philosophy of mind, producing a rich existential understanding of biology, which ultimately argues for a simultaneously material and moral human nature.\n\nFrom his Weimar investigations of early Christian dualist mythologies to his discovery of the new field of bioethics in the baby boom-era suburbs of New York, Jonas&apos;s warning over the course of an astoundingly long philosophical career was always the same: that the unconstrained power of the human will threatens the possibility of life.\n\n\nThe following books are in PDF format unless otherwise noted:\n\n* Gnostic Religion, The (Beacon, 1970).  Second Edition.\n\n* Gnostic Religion, The (Beacon, 2001).  Third Edition. -- PDF + ePUB\n\n* Organism and Freedom: An Essay in Philosophical Biology (Rombach, 2016).  Introduction by Jens Ole Beckers und Florian Preu&#xDF;ger.\n\n* Phenomenon of Life, The: Toward a Philosophical Biology (Northwestern, 2001). Foreword by Lawrence Vogel.\n\n* Philosophical Reflections on Experimenting with Human Subjects, (1969) 98.2 Daedalus 219.\n\n* Toward a Philosophy of Technology (Hastings Center Report, Feb. 1979).\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-09-25T12:10:18.957Z","parsed":{"xt":"urn:btih:ad4253e5b60a8773e4c1fac731aba0d079c1aabc","dn":"Hans Jonas - Philosophical Works (4 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ad4253e5b60a8773e4c1fac731aba0d079c1aabc","infoHashBuffer":{"type":"Buffer","data":[173,66,83,229,182,10,135,115,228,193,250,199,49,171,160,208,121,193,170,188]},"name":"Hans Jonas - Philosophical Works (4 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}