{"title":"Who's Afraid of the Big Bad Dragon by Yong Zhao EPUB","magnet":"magnet:?xt=urn:btih:adc6e331212aaff275ef6f55d1fb679afe9d722b&dn=Who%27s+Afraid+of+the+Big+Bad+Dragon+by+Yong+Zhao+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1762487","seeders":"0","leechers":"0","description":"xx\r\n\r\nWho&apos;s Afraid of the Big Bad Dragon by Yong Zhao EPUB\r\n\r\nThe secrets behind China&apos;s extraordinary educational system - good, bad, and ugly.\r\n\r\nChinese students&apos; consistently stunning performance on the international PISA exams - where they outscore students of all other nations in math, reading, and science - have positioned China as a world education leader. American educators and pundits have declared this a &quot;Sputnik Moment&quot;, saying that we must learn from China&apos;s education system in order to maintain our status as an education leader and global superpower. Indeed, many of the reforms taking hold in United States schools, such as a greater emphasis on standardized testing and the increasing importance of core subjects like reading and math, echo the Chinese system. We&apos;re following in China&apos;s footsteps - but is this the direction we should take?\r\n\r\nWho&apos;s Afraid of the Big Bad Dragon? by award-winning writer Yong Zhao offers an entertaining, provocative insider&apos;s account of the Chinese school system, revealing the secrets that make it both &quot;the best and worst&quot; in the world. Born and raised in China&apos;s Sichuan province and a teacher in China for many years, Zhao has a unique perspective on Chinese culture and education. He explains in vivid detail how China turns out the world&apos;s highest-achieving students in reading, math, and science - yet by all accounts Chinese educators, parents, and political leaders hate the system and long to send their kids to Western schools. Filled with fascinating stories and compelling data, this book offers a nuanced and sobering tour of education in China.\r\n\r\nLearn how China is able to turn out the world&apos;s highest achieving students in math, science, and reading. Discover why, despite these amazing test scores, Chinese parents, teachers, and political leaders are desperate to leave behind their educational system. Discover how current reforms in the U.S. parallel the classic Chinese system, and how this could help (or hurt) our students&apos; prospects.\r\n\r\nxx","last_updated":"2018-05-17T12:02:29.311Z","parsed":{"xt":"urn:btih:adc6e331212aaff275ef6f55d1fb679afe9d722b","dn":"Who's Afraid of the Big Bad Dragon by Yong Zhao EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"adc6e331212aaff275ef6f55d1fb679afe9d722b","infoHashBuffer":{"type":"Buffer","data":[173,198,227,49,33,42,175,242,117,239,111,85,209,251,103,154,254,157,114,43]},"name":"Who's Afraid of the Big Bad Dragon by Yong Zhao EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}