{"title":"Extreme You by Sarah Robb O'Hagan EPUB","magnet":"magnet:?xt=urn:btih:aeb19c58a55154b09f3313078d9182dbe5285172&dn=Extreme+You+by+Sarah+Robb+O%27Hagan+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"656583","seeders":"0","leechers":"0","description":"xx\r\n\r\nExtreme You: Step Up. Stand Out. Kick Ass. Repeat. by Sarah Robb O&apos;Hagan EPUB\r\n\r\nThe former president of Gatorade and Equinox draws unconventional insights and kickass lessons from her personal and professional experiences and from a band of highly accomplished &quot;Extremers&quot; from business, sports, and entertainment to help you rock your career and live the boldest version of yourself.\r\n\r\nFrom childhood, Sarah Robb O&apos;Hagan felt destined to become a champion, but her early efforts at sports, in school, and in music made it clear she was no natural superstar. Unwilling to settle for average, she decided to go Extreme. From working with Richard Branson as a thriving Virgin Atlantic executive in her 20s to being fired and nearly deported a matter of months later, she learned through a series of surprising successes and epic fails that the extremes of her experiences were the engine of her success.\r\n\r\nMaking her way up the corporate ladder to become an executive at Nike, global president of Gatorade, and president of the luxury fitness company Equinox - as well as a wife, a mother, and an endurance athlete - she took the opportunity to learn from her relationships with extremely successful athletes, entertainers, and business and political leaders, discovering that across a wide range of pursuits - from Olympic skier to disruptive entrepreneur, from White House chef to secretary of state - Extremers follow the same method to realize their potential. She learned to develop an almost magical inner drive, challenge by challenge, until she could outperform almost any competition; to embrace her interests, talents, and idiosyncrasies and present them as unique specialties; and to step up - and step out of line - without letting her ego blow up all her hard work. She learned how to grit her teeth in the face of embarrassing failures, get over her weaknesses, and relentlessly test herself to reach her next level of success.\r\n\r\n..\r\n\r\nxx","last_updated":"2018-07-16T12:01:06.435Z","parsed":{"xt":"urn:btih:aeb19c58a55154b09f3313078d9182dbe5285172","dn":"Extreme You by Sarah Robb O'Hagan EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aeb19c58a55154b09f3313078d9182dbe5285172","infoHashBuffer":{"type":"Buffer","data":[174,177,156,88,165,81,84,176,159,51,19,7,141,145,130,219,229,40,81,114]},"name":"Extreme You by Sarah Robb O'Hagan EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}