{"title":"Elvis and Ginger by Ginger Alden EPUB","magnet":"magnet:?xt=urn:btih:aecd35a9f190d1386742e15fe75649fc95bcfc34&dn=Elvis+and+Ginger+by+Ginger+Alden+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3566332","seeders":"0","leechers":"0","description":"xx\r\n\r\nElvis and Ginger by Ginger Alden EPUB\r\n\r\n&quot;Elvis, you and I know the truth and unfortunately you&#x2019;re not here to set the record straight. With this book, I will try to.&#x2026;&quot;\r\n\r\nElvis Presley and Graceland were fixtures in the life of Ginger Alden, having been born and raised in Memphis, Tennessee. But she had no idea that she would play a part in that enduring legacy - as Elvis Presley&#x2019;s fianc&#xE9;e, and his last great love. For over three decades Ginger has held the truth of their relationship close to her heart. Now she shares her unique story, and while a lot has been written about the King, the Elvis we meet in this long-anticipated memoir is a revelation.\r\n\r\nIn her own words Ginger details their whirlwind romance - from first kiss to his stunning proposal of marriage. She details his exploration of Eastern religions, his perception of being a &quot;legend&quot;, his devotion to family and friends, and her attempt to know the insular group surrounding Elvis. And for the very first time she talks about the devastating end of it all, and the 50,000 mourners and reporters who descended on Graceland in 1977, exposing Ginger to the reality of living in the spotlight of a short, yet immortal, life.\r\n\r\nAbove it all, Alden rescues Elvis from the hearsay, rumors, and tabloid speculations of his final year by shedding a frank yet personal light on a very public legend. From a unique and intimate perspective, she reveals the man - complicated, romantic, fallible, and human - behind the enduring myth, a superstar worshipped by millions, and loved by Ginger Alden.\r\n\r\nxx","last_updated":"2018-03-13T12:03:53.882Z","parsed":{"xt":"urn:btih:aecd35a9f190d1386742e15fe75649fc95bcfc34","dn":"Elvis and Ginger by Ginger Alden EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aecd35a9f190d1386742e15fe75649fc95bcfc34","infoHashBuffer":{"type":"Buffer","data":[174,205,53,169,241,144,209,56,103,66,225,95,231,86,73,252,149,188,252,52]},"name":"Elvis and Ginger by Ginger Alden EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}