{"title":"Udemy - All about NodeJS","magnet":"magnet:?xt=urn:btih:af6430c5dc7443f84e298756af485601669cb409&dn=Udemy+-+All+about+NodeJS&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"tuts756","categoryP":"other","categoryS":"other","size":"2830485324","seeders":"7","leechers":"23","description":"Description\r\nNodeJS is a platform that allows developers to write server side high performance and networked applications. And that too using good old Javascript. But wait ! Isn&#x2019;t Javascript meant to be used for forms and stuff on web pages ?Well that was 10 years ago. The world has gone from &#x2018;Oops! You&#x2019;ve not filled up the form properly !&#x2019; days to today&#x2019;s modern web apps and social media sites that rely heavily on Javascript. Google Apps,Twitter, Google Plus and LinkedIn, being handful examples of this movement. And to think that this quantum leap would not have been possible without Javascript is not an overstatement. Today, when you socialize with your friends onor use your Gmail inbox, you&#x2019;re running thousands of lines of code written in Javascript, in your browser.\r\nWho is the target audience?\r\n    Understand the inner workings of NodeJS\r\n    Web Designers &amp; Front End Developers who wish to extend their knowledge of Javascript for building high performance network applications.\r\n    Software Developers who want to build high performance network applications.\r\n    Absolute beginners with basic knowledge of HTML, CSS and Javascript, wanting to upgrade to professional Web Development and Building Web Apps.\r\n    Anyone who wishes to get hands-on training with setting up an Amazon EC2 Instance with a host of other services like Cloudfront, Elastic IP and S3\r\n    Anyone who wishes to get hands-on training with deploying a NodeJS app on the cloud\r\n    Computer Engineering students\r\n    Tech Entrepreneurs who want to get their hands down and dirty with Web Coding &amp; App Development.\r\n    Anyone who wishes to stay on the forefront of technology !\r\n    PHP, ASPnet, Perl, Java &amp; Ruby coders wanting to leap onto the NodeJs bandwagon.\r\nRequirements\r\n    Working knowledge of HTML, CSS and Javascript\r\n    Basic Working knowledge of an image editing application such as Adobe Photoshop would also help, but is not necessarily needed","last_updated":"2018-07-23T12:09:31.379Z","parsed":{"xt":"urn:btih:af6430c5dc7443f84e298756af485601669cb409","dn":"Udemy - All about NodeJS","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"af6430c5dc7443f84e298756af485601669cb409","infoHashBuffer":{"type":"Buffer","data":[175,100,48,197,220,116,67,248,78,41,135,86,175,72,86,1,102,156,180,9]},"name":"Udemy - All about NodeJS","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}