{"title":"The Book of M by Peng Shepherd EPUB","magnet":"magnet:?xt=urn:btih:af7019586a62fd077e238132eca397a27c5afb3a&dn=The+Book+of+M+by+Peng+Shepherd+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"881612","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Book of M by Peng Shepherd EPUB\r\n\r\nSet in a dangerous near-future world, The Book of M tells the captivating story of a group of ordinary people caught in an extraordinary catastrophe who risk everything to save the ones they love. It is a sweeping debut that illuminates the power that memories have not only on the heart, but on the world itself.\r\n\r\nOne afternoon at an outdoor market in India, a man&#x2019;s shadow disappears - an occurrence science cannot explain. He is only the first. The phenomenon spreads like a plague, and while those afflicted gain a strange new power, it comes at a horrible price: the loss of all their memories.\r\n\r\nOry and his wife, Max, have escaped the Forgetting so far by hiding in an abandoned hotel deep in the woods. Their new life feels almost normal, until one day, Max&#x2019;s shadow disappears, too.\r\n\r\nKnowing that the more she forgets, the more dangerous she will become to Ory, Max runs away. But Ory refuses to give up the time they have left together. Desperate to find Max before her memory disappears completely, he follows her trail across a perilous, unrecognizable world, braving the threat of roaming bandits, the call to a new war being waged on the ruins of the capital, and the rise of a sinister cult that worships the shadowless.\r\n\r\nAs they journey, each searches for answers: for Ory, about love, about survival, about hope; and for Max, about a new force growing in the south that may hold the cure.\r\n\r\nLike The Passage and Station Eleven, this haunting, thought-provoking, and beautiful novel explores fundamental questions of memory, connection, and what it means to be human in a world turned upside down.\r\n\r\nxx","last_updated":"2018-06-06T12:02:31.548Z","parsed":{"xt":"urn:btih:af7019586a62fd077e238132eca397a27c5afb3a","dn":"The Book of M by Peng Shepherd EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"af7019586a62fd077e238132eca397a27c5afb3a","infoHashBuffer":{"type":"Buffer","data":[175,112,25,88,106,98,253,7,126,35,129,50,236,163,151,162,124,90,251,58]},"name":"The Book of M by Peng Shepherd EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}