{"title":"State of Resistance by Manuel Pastor EPUB","magnet":"magnet:?xt=urn:btih:afba5f1881ef2e8c7dcfac61887e0ffcbfa09847&dn=State+of+Resistance+by+Manuel+Pastor+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4348763","seeders":"24","leechers":"5","description":"xx\r\n\r\nState of Resistance by Manuel Pastor EPUB\r\n\r\nOnce upon a time, any mention of California triggered unpleasant reminders of Ronald Reagan and right-wing tax revolts, ballot propositions targeting undocumented immigrants, and racist policing that sparked two of the nation&apos;s most devastating riots. In fact, California confronted many of the challenges the rest of the country faces now - decades before the rest of us.  \r\n\r\nToday, California is leading the way on addressing climate change, low-wage work, immigrant integration, overincarceration, and more. As white residents became a minority and job loss drove economic uncertainty, California had its own Trump moment 25 years ago, but has become increasingly blue over each of the last seven presidential elections. How did the Golden State manage to emerge from its unsavory past to become a bellwether for the rest of the country?  \r\n\r\nThirty years after Mike Davis&apos;s hellish depiction of California in City of Quartz, the award-winning sociologist Manuel Pastor guides us through a new and improved California, complete with lessons that the nation should heed. State of Resistance makes the case for honestly engaging racial anxiety in order to address our true economic and generational challenges, a renewed commitment to public investments, the cultivation of social movements and community organizing, and more.\r\n\r\nxx","last_updated":"2018-10-24T14:22:51.719Z","parsed":{"xt":"urn:btih:afba5f1881ef2e8c7dcfac61887e0ffcbfa09847","dn":"State of Resistance by Manuel Pastor EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"afba5f1881ef2e8c7dcfac61887e0ffcbfa09847","infoHashBuffer":{"type":"Buffer","data":[175,186,95,24,129,239,46,140,125,207,172,97,136,126,15,252,191,160,152,71]},"name":"State of Resistance by Manuel Pastor EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}