{"title":"One Person, No Vote by Carol Anderson EPUB","magnet":"magnet:?xt=urn:btih:b0ce83836443b931b3544bbd92cdf301c764fe9d&dn=One+Person%2C+No+Vote+by+Carol+Anderson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1339339","seeders":"38","leechers":"3","description":"xx\r\n\r\nOne Person, No Vote: How Voter Suppression Is Destroying Our Democracy by Carol Anderson EPUB\r\n\r\nFrom the award-winning, New York Times best-selling author of White Rage, the startling - and timely - history of voter suppression in America, with a foreword by Senator Dick Durbin.\r\n\r\nIn her New York Times best seller White Rage, Carol Anderson laid bare an insidious history of policies that have systematically impeded black progress in America, from 1865 to our combustible present. With One Person, No Vote, she chronicles a related history: the rollbacks to African American participation in the vote since the 2013 Supreme Court decision that eviscerated the Voting Rights Act of 1965. Known as the Shelby ruling, this decision effectively allowed districts with a demonstrated history of racial discrimination to change voting requirements without approval from the Department of Justice. \r\n\r\nFocusing on the aftermath of Shelby, Anderson follows the astonishing story of government-dictated racial discrimination unfolding before our very eyes as more and more states adopt voter suppression laws. In gripping, enlightening detail she explains how voter suppression works, from photo ID requirements to gerrymandering to poll closures. And with vivid characters, she explores the resistance: the organising, activism, and court battles to restore the basic right to vote to all Americans as the nation gears up for the 2018 midterm elections.\r\n\r\nxx","last_updated":"2018-09-20T12:21:03.207Z","parsed":{"xt":"urn:btih:b0ce83836443b931b3544bbd92cdf301c764fe9d","dn":"One Person, No Vote by Carol Anderson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b0ce83836443b931b3544bbd92cdf301c764fe9d","infoHashBuffer":{"type":"Buffer","data":[176,206,131,131,100,67,185,49,179,84,75,189,146,205,243,1,199,100,254,157]},"name":"One Person, No Vote by Carol Anderson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}