{"title":"Steven Gimbel-Redefining Reality","magnet":"magnet:?xt=urn:btih:b0d94caac4f1c83de34d93593ae4896edb099216&dn=Steven+Gimbel-Redefining+Reality&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"user135","categoryP":"audio","categoryS":"audio_books","size":"256665624","seeders":"0","leechers":"1","description":"No subject is bigger than reality itself, and nothing is more challenging to understand, since what counts as reality is undergoing continual revision and has been for centuries. For example, the matter that comprises all stars, planets, and living things turns out to be just a fraction of what actually exists. Moreover, we think that we control our actions, but data analytics can predict, with astonishing accuracy, when we will wake up, what we will buy, and even whom we will marry.\r\n\r\nThe quest to pin down what&apos;s real and what&apos;s illusory is both philosophical and scientific, a metaphysical search for ultimate reality that goes back to the ancient Greeks. For the last 400 years, this search has been increasingly guided by scientists, who create theories and test them in order to define and redefine reality. And we have developed the power to alter our own reality in major ways - to defeat diseases, compensate for disabilities, and augment our intellect with computers. Where is that trend going?\r\n\r\nExperience the thrill of this exciting quest in 36 wide-ranging lectures that touch on many aspects of the ceaseless search for reality. From the birth of the universe to brain science, discover that separating the real from the illusory is an exhilarating intellectual adventure.\r\n\r\nScientists and philosophers are not alone in grappling, at an intellectual level, with reality. Some of the most accessible interpretations are by painters, novelists, filmmakers, and other artists whose works not only draw on the latest discoveries but also sometimes inspire them. Explore examples such as Alice in Wonderland, pointillism, cubism, surrealism, and reality TV.\r\n\r\nAnd since dealing with reality is an experience we all share, this course is designed for people of all backgrounds","last_updated":"2018-04-01T12:04:36.547Z","parsed":{"xt":"urn:btih:b0d94caac4f1c83de34d93593ae4896edb099216","dn":"Steven Gimbel-Redefining Reality","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b0d94caac4f1c83de34d93593ae4896edb099216","infoHashBuffer":{"type":"Buffer","data":[176,217,76,170,196,241,200,61,227,77,147,89,58,228,137,110,219,9,146,22]},"name":"Steven Gimbel-Redefining Reality","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}