{"title":"Fiction Writing A Complete Novel Outline Chapter by Chapter","magnet":"magnet:?xt=urn:btih:b1a12244df4404b4141a4561c7728a9f0480c531&dn=Fiction+Writing+A+Complete+Novel+Outline+Chapter+by+Chapter&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"tuts756","categoryP":"other","categoryS":"other","size":"388990187","seeders":"0","leechers":"0","description":"Description\r\n\r\nDo you have an idea for a full length novel, but don&#x2019;t know where to start? Do you want to write full-time, quit your day job, and follow your passion, but the dream seems so far away? Have you ever said to yourself, I could write a novel but I don&#x2019;t want it to take me all year! Oh man, you&#x2019;re so in the right spot. I freaking get it. See, I used to be in your shoes. Spending hours per day on writing and seeing little to no progress day after day. Staring at pages and pages of notes full of good ideas, but having virtually no idea what to do with them. Wishing I could write this darn novel already, but feeling overwhelmed at the investment of time and sacrifices to get there.I developed a system &#x2013; one that actually worked &#x2013; in order to turn my ideas in a complete novel outline and eventual manuscript in the shortest amount of time. In less than a year, I was able to write 3 full length novel outlines and manuscripts. In less than two years, I had seven full length novel outlines and manuscripts.\r\n\r\nBest of all, you don&#x2019;t need much to start the course. All you have to do is click the &#x201C;Take this Course&#x201D; button to the right, and in just moments you&#x2019;ll discover:\r\n\r\n    At last, you&#x2019;ll finally discover outlining a novel isn&#x2019;t difficult at all! Need to get a snap shot of the course? Then see page lecture 3, &#x201C;The Purpose Of This Course&#x201D; for the simple course instructions that will blow your mind!\r\n    Short on time? Then you&#x2019;ll love that this course is work at your own pace!\r\n    How to create tension tips in nearly every lecture &#x2013; you won&#x2019;t find these secrets anywhere else!\r\n    What some literary agents WANT you to understand about outlining a novel!\r\n    A surprising trick for slowing down time in a book &#x2013; no extra study required!\r\n    Outlining mistakes and how to avoid them!\r\n    A simple little way to create the characters you need required for each novel &#x2013; you won&#x2019;t believe how well this archetypal character trait guide works!\r\n    The little-known strategy for changing point of view to increase tension &#x2013; this one works so well you&#x2019;ll think it&#x2019;s magic! And so much more!\r\n\r\nHere&#x2019;s a sneak peek at what you get:\r\n\r\n    You&#x2019;ll get my one on one feedback to your current story idea before you start the course!\r\n    Get hung up in a particular area as you&#x2019;re working through the course, that&#x2019;s what I&#x2019;m here for! Ask for my help. It&#x2019;s free and I&#x2019;ve helped literally hundreds of people with their story outlines. So let me ask you&#x2026;\r\n\r\nWho is the target audience?\r\n\r\n    Fiction writers\r\n    Aspiring fiction writers\r\n    Established novelists\r\n    New Writers\r\n    Beginner Writers\r\n\r\nRequirements\r\n\r\n    A willingness to be creative and not give up!","last_updated":"2018-03-24T12:01:21.373Z","parsed":{"xt":"urn:btih:b1a12244df4404b4141a4561c7728a9f0480c531","dn":"Fiction Writing A Complete Novel Outline Chapter by Chapter","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b1a12244df4404b4141a4561c7728a9f0480c531","infoHashBuffer":{"type":"Buffer","data":[177,161,34,68,223,68,4,180,20,26,69,97,199,114,138,159,4,128,197,49]},"name":"Fiction Writing A Complete Novel Outline Chapter by Chapter","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}