{"title":"Encyclopedia of Humor Studies - Vol I+II (gnv64)","magnet":"magnet:?xt=urn:btih:b1b42f673d4062c709d43746b81c8bbef3e0fba6&dn=Encyclopedia+of+Humor+Studies+-+Vol+I%2BII+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"77301767","seeders":"0","leechers":"29","description":"Encyclopedia of Humor Studies (2 Volumes in 1)\r\nby Salvatore I. Attardo\r\nSAGE Publications | March 2014 | ISBN-10: 141299909X | PDF | 984 Pages | 73.4 mb\r\n\r\nThis book explores the concept of humor in history and modern society in the United States and internationally. This work&apos;s scope encompasses the humor of children, adults, and even nonhuman primates throughout the ages, from crude jokes and simple slapstick to sophisticated word play and ironic parody and satire. As an academic social history, it includes the perspectives of a wide range of disciplines, including sociology, child development, social psychology, life style history, communication, and entertainment media. Readers will develop an understanding of the importance of humor as it has developed globally throughout history and appreciate its effects on child and adult development, especially in the areas of health, creativity, social development, and imagination. \r\n\r\nFeatures &amp; Benefits:\r\n- The General Editor also serves as Editor-in-Chief of HUMOR: International Journal of Humor Research for The International Society for Humor Studies.\r\n- The book&apos;s 335 articles are organized in A-to-Z fashion in two volumes (approximately 1,000 pages).\r\n- This work is enhanced by an introduction by the General Editor, a Foreword, a list of the articles and contributors, and a Reader&apos;s Guide that groups related entries thematically.\r\n- A Chronology of Humor, a Resource Guide, and a detailed Index are included.\r\n- Each entry concludes with References/Further Readings and cross references to related entries.\r\n- The Index, Reader&apos;s Guide themes, and cross references between and among related entries combine to provide robust search-and-browse features in the electronic version.\r\n\r\nThis two-volume, A-to-Z set provides a general, non-technical resource for students and researchers in such diverse fields as communication and media studies, sociology and anthropology, social and cognitive psychology, history, literature and linguistics, and popular culture and folklore.\r\n <a href=\"\nhttps://i.postimg.cc/XNtS86rX/Encyclopedia-of-Humor-Studies.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://i.postimg.cc/XNtS86rX/Encyclopedia-of-Humor-Studies.jpg</a>","last_updated":"2018-11-03T12:12:25.473Z","parsed":{"xt":"urn:btih:b1b42f673d4062c709d43746b81c8bbef3e0fba6","dn":"Encyclopedia of Humor Studies - Vol I II (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b1b42f673d4062c709d43746b81c8bbef3e0fba6","infoHashBuffer":{"type":"Buffer","data":[177,180,47,103,61,64,98,199,9,212,55,70,184,28,139,190,243,224,251,166]},"name":"Encyclopedia of Humor Studies - Vol I II (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}