{"title":"Anatomies by Hugh Aldersey-Williams EPUB","magnet":"magnet:?xt=urn:btih:b24f41b06589ac786d70ac4013bef2f4a3b6cbac&dn=Anatomies+by+Hugh+Aldersey-Williams+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1461037","seeders":"6","leechers":"0","description":"xx \r\n\r\nAnatomies: A Cultural History of the Human Body by Hugh Aldersey-Williams EPUB \r\n\r\nAn eye-opening, spine-tingling, heartwarming tour through the extraordinary history and secrets of the human body. \r\n\r\nThe human body is the most fraught and fascinating, talked-about and taboo, unique yet universal fact of our lives. It is the inspiration for art, the subject of science, and the source of some of the greatest stories ever told. In Anatomies, acclaimed author of Periodic Tales Hugh Aldersey-Williams brings his entertaining blend of science, history, and culture to bear on this richest of subjects. \r\n\r\nIn an engaging narrative that ranges from ancient body art to plastic surgery today and from head to toe, Aldersey-Williams explores the corporeal mysteries that make us human: Why are some people left-handed and some blue-eyed? What is the funny bone, anyway? Why do some cultures think of the heart as the seat of our souls and passions, while others place it in the liver? \r\n\r\nA journalist with a knack for telling a story, Aldersey-Williams takes part in a drawing class, attends the dissection of a human body, and visits the doctor&apos;s office and the morgue. But Anatomies draws not just on medical science and Aldersey-Williams&apos;s reporting. It draws also on the works of philosophers, writers, and artists from throughout history. Aldersey-Williams delves into our shared cultural heritage - Shakespeare to Frankenstein, Rembrandt to 2001: A Space Odyssey - to reveal how attitudes toward the human body are as varied as human history, as he explains the origins and legacy of tattooing, shrunken heads, bloodletting, fingerprinting, X-rays, and more. \r\n\r\nFrom Adam&apos;s rib to van Gogh&apos;s ear to Einstein&apos;s brain, Anatomies is a treasure trove of surprising facts and stories and a wonderful embodiment of what Aristotle wrote more than two millennia ago: &quot;The human body is more than the sum of its parts.&quot; \r\n\r\nxx","last_updated":"2018-09-08T12:27:52.315Z","parsed":{"xt":"urn:btih:b24f41b06589ac786d70ac4013bef2f4a3b6cbac","dn":"Anatomies by Hugh Aldersey-Williams EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b24f41b06589ac786d70ac4013bef2f4a3b6cbac","infoHashBuffer":{"type":"Buffer","data":[178,79,65,176,101,137,172,120,109,112,172,64,19,190,242,244,163,182,203,172]},"name":"Anatomies by Hugh Aldersey-Williams EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}