{"title":"Far Cry","magnet":"magnet:?xt=urn:btih:b2652c535932a228eb1167fb70ff124deb66565e&dn=Far+Cry&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"freedisk","categoryP":"games","categoryS":"pc","size":"2732212158","seeders":"1","leechers":"6","description":"A tropical paradise seethes with hidden evil in Far Cry&#xAE;, a cunningly detailed action shooter that pushes the boundaries of combat to shocking new levels.\r\nFreelance mariner Jack Carver is cursing the day he ever came to this island. A week ago, a brash female reporter named Valerie had offered him an incredible sum of cash to take her to this unspoiled paradise. Shortly after docking, however, Jack&apos;s boat was greeted by artillery fire from a mysterious militia group swarming about the island.\r\n\r\nWith his boat destroyed, his money gone, and the gorgeous Valerie suddenly missing, Jack now finds himself facing an army of mercenaries amidst the wilds of the island, with nothing but a gun and his wits to survive. But the further he pushes into the lush jungle canopy, the stranger things become.\r\nJack encounters an insider within the militia group who reveals the horrific details of the mercenaries&apos; true intentions. He presents Jack with an unsettling choice: battle the deadliest mercenaries, or condemn the human race to a maniac&apos;s insidious agenda.\r\n\r\nFeel the Far Cry engine - The meticulously designed, next-generation Far Cry engine pushes the threshold of action gaming with proprietary Polybump mapping, advanced environment and character physics, destructible terrain, dynamic lighting, motion-captured animation, and total surround sound. \r\nUnparalleled long-range gunplay - Battle to the ends of the earth with Far Cry&apos;s utterly unique, 800-meter scalable view system. Lock onto enemies from a distance with motion-sensing binoculars. Then choose your style of attack - from long-range sniping to ballistic close-quarters firefights - and everything in between.\r\n\r\nCunning and complex AI tactics - Battles never become repetitive when you face Far Cry&apos;s unpredictable, intelligent AI mercenary units trained in advanced adaptive group tactics. Units include snipers, stalkers, scouts, and grenadiers who engage you from all angles, distances, and terrains in coordinated strikes. Commanders will even call for reinforcements by land, sea, or air.\r\nDiverse combat action - Master a dynamic slate of combat skills - close-quarters combat, long-range shooting, search-and-destroy tactics, stealth operations, and combat driving skills through indoor and outdoor environments.\r\nHeart-pounding atmosphere - Experience unprecedented drama and realism in a misleadingly perfect setting, with incredible lighting and shadows, adaptive audio, and weather effects","last_updated":"2018-10-06T12:41:05.768Z","parsed":{"xt":"urn:btih:b2652c535932a228eb1167fb70ff124deb66565e","dn":"Far Cry","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b2652c535932a228eb1167fb70ff124deb66565e","infoHashBuffer":{"type":"Buffer","data":[178,101,44,83,89,50,162,40,235,17,103,251,112,255,18,77,235,102,86,94]},"name":"Far Cry","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}