{"title":"Sea of Thieves","magnet":"magnet:?xt=urn:btih:b28200c2ec503e22bb4d4b72812ee87b5f11645a&dn=Sea+of+Thieves&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"HSMMaelstrom","categoryP":"games","categoryS":"pc","size":"15211715296","seeders":"0","leechers":"0","description":"Sea of Thieves is a shared world adventure game (or SWAG) with crew co-operation at its core, designed to let you be the kind of pirate you want to be. Want to follow maps and solve riddles to find legendary treasure? Assemble the mightiest, most fearsome crew to sail the seas? Set a course for the horizon and just explore? Our ambition is to build a game that lets you pursue whatever adventure your salty heart desires.\r\n\r\n\r\nA WORLD OF EXPLORATION\r\n\r\nVenture out onto a vast, open ocean, uncovering new regions scattered with unspoiled islands and the sunken ships of less agile sailors. You&apos;re free to approach this world and its wealth of challenges however you choose. Sail for the sheer joy of discovery or undertake dramatic voyages, following maps and untangling riddles, learning to expect the unexpected...\r\n\r\n\r\nA WORLD OF ACTION\r\n\r\nWhen parley is off the table, fight to protect your crew and your gold in ship-to-ship battles with cannon, pistol, blunderbuss and cutlass, pursuing rivals through raging storms. Sail in pursuit of deadly bounties, or ferry cargo through hostile waters. Clash with the skeletal remains of ancient reavers and beware marine menaces that lurk beneath the waves!\r\n\r\nA WORLD OF TEAMWORK\r\n\r\nSea of Thieves is as fun to watch and share as it is to play, bringing people together in a world that&apos;s exciting, fun and unpredictable. Whether you&apos;re questing with friends, testing the waters in a smaller ship or matchmaking to find a crew from the terrific community, great memories are easy to make in this world where every sail you see is another crew of real players.\r\n\r\nA WORLD OF ENCOUNTERS\r\n\r\nThis ocean realm is an intriguing blend of ancient and new: pirates from a bygone age, now little more than malignant bones, still guard the gold beneath its sands, even as fresh-faced adventurers set out to forge new legends. You&apos;ll cross paths with settlers too, plying their trades or looking to employ the skills of bold seafarers to further their own agendas.\r\n\r\nA WORLD OF LEGENDS\r\n\r\nOn your quest to become a pirate legend you&apos;ll amass loot and hard-earned rewards to adapt your appearance to your own liking. You&apos;ll climb the ranks and boost your reputation until other crews are awed to encounter you out at sea. The stories created through your deeds may even be reflected not just in your own surroundings, but in the wider world&apos;s lore.\r\n\r\n\r\n 1.  Extract.\r\n 2.  Wait for crack.\r\n 3.  Play game.\r\n 4.  Have fun ^^","last_updated":"2018-03-22T14:25:30.850Z","parsed":{"xt":"urn:btih:b28200c2ec503e22bb4d4b72812ee87b5f11645a","dn":"Sea of Thieves","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b28200c2ec503e22bb4d4b72812ee87b5f11645a","infoHashBuffer":{"type":"Buffer","data":[178,130,0,194,236,80,62,34,187,77,75,114,129,46,232,123,95,17,100,90]},"name":"Sea of Thieves","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}