{"title":"PureTaboo - Valentina Nappi (The Housemaids Tale) NEW 01 Novembe","magnet":"magnet:?xt=urn:btih:b2a1acb032c983b0e6bbf06fd79bb5d12358ed2b&dn=PureTaboo+-+Valentina+Nappi+%28The+Housemaids+Tale%29+NEW+01+Novembe&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"307893628","seeders":"27","leechers":"25","description":"A wealthy man (Charles Dera) comes down the stairs of his house and turns the corner into the living room. He is distracted by his phone, and without looking, he accidentally bumps into a woman (Valentina Nappi), a housemaid who was cleaning in the room. He apologizes, and remarks that she must be the new maid the cleaning company sent over. She responds yes, with a noticeable accent but her english is otherwise quite good. He welcomes her to the payroll, and she replies &apos;Thank you, Mr. Bradley&apos; in a polite and respectful tone. He tells her there&apos;s no need to be so formal, please call him Trent. He asks her for her name -- he&apos;s clearly into her. She introduces herself as Rosa. As he listens he notices her accent more, and asks her where she&apos;s from. She replies that she&apos;s Italian. &apos;Ah, Italian!&apos; he exclaims, and boasts that he speaks a little Italian himself. He recites a small phrase in French, and Rosa nervously responds that she doesn&apos;t know French. Trent dismisses his blunder, then boasts that he travels a lot for work and he&apos;s been all over the world. He asks if she likes to travel and she says that she&apos;d never been out of Italy until she moved here a few months ago, her family didn&apos;t have much money growing up and since coming to the States she&apos;s been cleaning houses for a living and sending some of her wages back to them when she can afford to. Trent misses the point, and tells her that she&apos;s missing out if she&apos;s never traveled for fun, getting uncomfortably close to Rosa. It&apos;s clear that she&apos;s unhappy with his close proximity, but he either doesn&apos;t notice or doesn&apos;t care... \r\nCategories Hardcore, Facial, Creeper, Humiliation, Reluctance, Cheating, Revenge, Exploitation, Exhibitionism, Pervert\r\n <a href=\"\nhttp://imgdone.com/image/z9mwH\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/z9mwH</a>\r\n <a href=\"\nhttp://imgdone.com/image/z9vfr\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/z9vfr</a>","last_updated":"2018-11-01T12:22:46.614Z","parsed":{"xt":"urn:btih:b2a1acb032c983b0e6bbf06fd79bb5d12358ed2b","dn":"PureTaboo - Valentina Nappi (The Housemaids Tale) NEW 01 Novembe","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b2a1acb032c983b0e6bbf06fd79bb5d12358ed2b","infoHashBuffer":{"type":"Buffer","data":[178,161,172,176,50,201,131,176,230,187,240,111,215,155,181,209,35,88,237,43]},"name":"PureTaboo - Valentina Nappi (The Housemaids Tale) NEW 01 Novembe","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}