{"title":"Planet of the Apes: Caesar's Story by Maurice, Greg Keyes EPUB","magnet":"magnet:?xt=urn:btih:b3d1af39bd5677b5f4bd1a94e4323bb3f2407ace&dn=Planet+of+the+Apes%3A+Caesar%27s+Story+by+Maurice%2C+Greg+Keyes+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"51466523","seeders":"1","leechers":"1","description":"xx\r\n\r\nPlanet of the Apes: Caesar&apos;s Story by Maurice, Greg Keyes EPUB\r\n\r\nTo celebrate the 50th anniversary of the Planet of the Apes franchise: an illustrated life story of Caesar, the brave and extraordinary leader of the apes, as told by Maurice, Caesar&apos;s best friend.\r\n\r\nAfter the events of War for the Planet of the Apes, Caesar&apos;s tribe has finally found a safe refuge from the last remnants of the humans who wish to see them wiped out. It comes at a cost, however, as Caesar dies before he can see the apes thrive and prosper in their new home. Maurice, as a gift to Caesar&apos;s son, Cornelius, for when he grows older, decides to recount and chronicle Caesar&apos;s story so his son can truly know what a unique and brave ape his father was and inspire Cornelius in turn.\r\n\r\nCaesar&apos;s Story is this chronicle and tells the story of Caesar from his earliest days under the care of scientist Will Rodman, as well his life with the ape colony in Muir Woods after the outbreak of the Simian Flu, his interactions with Malcolm and Ellie, the dangerous ape Koba, and his ultimate battle with and imprisonment by the vicious and unstable Colonel. The book also chronicles what happens in between the events of Rise and Dawn of the Planet of the Apes, as well as the events between Dawn of and War for the Planet of the Apes.\r\n\r\nThe book includes Maurice&apos;s personal thoughts and reflections of his long time spent alongside Caesar and contributions from several other key apes that knew Caesar. The result is a truly one-of-a-kind celebration of the new Planet of the Apes trilogy and the franchise as a whole.\r\n\r\nxx","last_updated":"2018-10-29T12:24:33.569Z","parsed":{"xt":"urn:btih:b3d1af39bd5677b5f4bd1a94e4323bb3f2407ace","dn":"Planet of the Apes: Caesar's Story by Maurice, Greg Keyes EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b3d1af39bd5677b5f4bd1a94e4323bb3f2407ace","infoHashBuffer":{"type":"Buffer","data":[179,209,175,57,189,86,119,181,244,189,26,148,228,50,59,179,242,64,122,206]},"name":"Planet of the Apes: Caesar's Story by Maurice, Greg Keyes EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}