{"title":"The.Sims.4.Digital.Deluxe.Edition.REPACK.v1.38.49-ElAmigos","magnet":"magnet:?xt=urn:btih:b4420afc2774a5560a59a28086c57ff6087af24f&dn=The.Sims.4.Digital.Deluxe.Edition.REPACK.v1.38.49-ElAmigos&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"z1gZaG","categoryP":"games","categoryS":"pc","size":"26371756032","seeders":"1","leechers":"3","description":"Die Sims 4 ist das mit Spannung erwartete Lebenssimulationsspiel, in dem Sie wie nie zuvor Schicksal spielen k&#xF6;nnen. Steuern Sie intelligentere Sims mit einzigartigem Aussehen, Charakter, Benehmen und Emotionen. Erleben Sie ein neues Ma&#xDF; an Kreativit&#xE4;t, wenn Sie mit dem leistungsstarken &#x201A;Erstelle einen Sim&#x2018; ihre Sims formen und mit dem taktilen, modulbasierten Bau-Modus wundersch&#xF6;ne H&#xE4;user kreieren. Betrachten Sie und teilen Sie neue Spielinhalte in der Galerie und f&#xFC;gen Sie sie ihrem Spiel hinzu. Steuern Sie K&#xF6;rper, Herz und Geist Ihrer Sims und erforschen Sie Ihre neuen Spielm&#xF6;glichkeiten in pulsierenden Nachbarschaften, in denen Ihre Geschichten zum Leben erweckt werden.\r\n\r\nDLC list: Laundry Day, Holiday Pack, Cats and Dogs, Toddler Stuff, Fitness Stuff, Parenthood, Vampires, Bowling Night Stuff, Toddlers, City Living, Vintage Glamour, Dine Out, Kids Room Stuff, Romantic Garden Stuff, Movie Hangout Stuff, Get Together, Spooky Stuff, Spa Day, Cool Kitchen Stuff, Perfect Patio Stuff, Luxury Party Stuff, Get to Work, Outdoor Retreat, The Prima Computer, Holiday Celebration Pack, Pools, Life of the Party Pack, Awesome Animal Hats, Up All Night, Digital Soundtrack, Let There Be Plumbobs Award (The Sims 3), Never Ending Reward (World Adventures), Shine On Reward (Ambitions), UV Light Reward (Late Night), Beacon Of Ages Reward (Generations), Paws Anonymous Reward (Pets), Your Name In Lights Reward (Showtime), Enchanted Aurora Reward (Supernatural), Whatever The Weather Reward (Seasons), Alma Mater Reward (University), Truly Tropical Reward (Island Paradise), Time Travelers Reward (Into the Future), The Ultimate Freezer Bunny Award.\r\n\r\nUpdated to version 1.38.49","last_updated":"2018-01-27T12:14:36.906Z","parsed":{"xt":"urn:btih:b4420afc2774a5560a59a28086c57ff6087af24f","dn":"The.Sims.4.Digital.Deluxe.Edition.REPACK.v1.38.49-ElAmigos","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b4420afc2774a5560a59a28086c57ff6087af24f","infoHashBuffer":{"type":"Buffer","data":[180,66,10,252,39,116,165,86,10,89,162,128,134,197,127,246,8,122,242,79]},"name":"The.Sims.4.Digital.Deluxe.Edition.REPACK.v1.38.49-ElAmigos","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}