{"title":"Boy on Ice by John Branch EPUB","magnet":"magnet:?xt=urn:btih:b4fd060b5855c3605fcefbb444b5189672a6a833&dn=Boy+on+Ice+by+John+Branch+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"629543","seeders":"30","leechers":"3","description":"xx\r\n\r\nBoy on Ice: The Life and Death of Derek Boogaard by John Branch EPUB\r\n\r\nThe much-anticipated debut from the Pulitzer Prize - winning New York Times reporter, Boy on Ice is a moving human story and behind-the-scenes account of a life lived in the glare of sporting fame. The tragic death of hockey star Derek Boogaard at 28 was front-page news across the country in 2011 and helped shatter the silence about violence and concussions in professional sports. Now, in a gripping work of narrative nonfiction, acclaimed reporter John Branch tells the shocking story of Boogaard&apos;s life and heartbreaking death. Boy on Ice is the richly told story of a mountain of a man who made it to the absolute pinnacle of his sport. Widely regarded as the toughest man in the NHL, Boogaard was a gentle man off the ice but a merciless fighter on it.\r\n\r\nWith great narrative drive, Branch recounts Boogaard&apos;s unlikely journey from lumbering kid playing pond-hockey on the prairies of Saskatchewan, so big his skates would routinely break beneath his feet; to his teenaged junior hockey days, when one brutal outburst of violence brought Boogaard to the attention of professional scouts; to his days and nights as a star enforcer with the Minnesota Wild and the storied New York Rangers, capable of delivering career-ending punches and intimidating entire teams. But, as Branch reveals, behind the scenes Boogaard&apos;s injuries and concussions were mounting and his mental state was deteriorating, culminating in his early death from an overdose of alcohol and painkillers. Based on months of investigation and hundreds of interviews with Boogaard&apos;s family, friends, teammates, and coaches, Boy on Ice is a brilliant work for fans of Michael Lewis&apos;s The Blind Side or Buzz Bissinger&apos;s Friday Night Lights. This is a book that raises deep and disturbing questions about the systemic brutality of contact sports - from peewees to professionals - and the damage that reaches far beyond the game.\r\n\r\nxx","last_updated":"2018-09-02T12:11:54.412Z","parsed":{"xt":"urn:btih:b4fd060b5855c3605fcefbb444b5189672a6a833","dn":"Boy on Ice by John Branch EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b4fd060b5855c3605fcefbb444b5189672a6a833","infoHashBuffer":{"type":"Buffer","data":[180,253,6,11,88,85,195,96,95,206,251,180,68,181,24,150,114,166,168,51]},"name":"Boy on Ice by John Branch EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}