{"title":"Do Zombies Dream of Undead Sheep? by Timothy Verstynen EPUB","magnet":"magnet:?xt=urn:btih:b549d520259842a2c00166b4899cb5f6ce7930fe&dn=Do+Zombies+Dream+of+Undead+Sheep%3F+by+Timothy+Verstynen+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4077673","seeders":"36","leechers":"3","description":"xx\r\n\r\nDo Zombies Dream of Undead Sheep: A Neuroscientific View of the Zombie Brain by Timothy Verstynen, Bradley Voytek EPUB\r\n\r\nEven if you&#x2019;ve never seen a zombie movie or television show, you could identify an undead ghoul if you saw one. With their endless wandering, lumbering gait, insatiable hunger, antisocial behavior, and apparently memory-less existence, zombies are the walking nightmares of our deepest fears. What do these characteristic behaviors reveal about the inner workings of the zombie mind? Could we diagnose zombism as a neurological condition by studying their behavior?\r\n\r\nIn Do Zombies Dream of Undead Sheep?, neuroscientists and zombie enthusiasts Timothy Verstynen and Bradley Voytek apply their neuro-know-how to dissect the puzzle of what has happened to the zombie brain to make the undead act differently than their human prey. Combining tongue-in-cheek analysis with modern neuroscientific principles, Verstynen and Voytek show how zombism can be understood in terms of current knowledge regarding how the brain works. In each chapter, the authors draw on zombie popular culture and identify a characteristic zombie behavior that can be explained using neuroanatomy, neurophysiology, and brain-behavior relationships. Through this exploration they shed light on fundamental neuroscientific questions such as: How does the brain function during sleeping and waking? What neural systems control movement? What is the nature of sensory perception?\r\n\r\nWalking an ingenious line between seriousness and satire, Do Zombies Dream of Undead Sheep? leverages the popularity of zombie culture in order to give readers a solid foundation in neuroscience.\r\n\r\nxx","last_updated":"2018-09-20T12:32:42.026Z","parsed":{"xt":"urn:btih:b549d520259842a2c00166b4899cb5f6ce7930fe","dn":"Do Zombies Dream of Undead Sheep? by Timothy Verstynen EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b549d520259842a2c00166b4899cb5f6ce7930fe","infoHashBuffer":{"type":"Buffer","data":[181,73,213,32,37,152,66,162,192,1,102,180,137,156,181,246,206,121,48,254]},"name":"Do Zombies Dream of Undead Sheep? by Timothy Verstynen EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}