{"title":"The Curse of Jacob Tracy by Holly Messinger EPUB","magnet":"magnet:?xt=urn:btih:b5fa7781ca91101606c19d0b2492be556a42639b&dn=The+Curse+of+Jacob+Tracy+by+Holly+Messinger+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"571206","seeders":"27","leechers":"8","description":"xx\r\n\r\nThe Curse of Jacob Tracy by Holly Messinger EPUB\r\n\r\nSt. Louis in 1880 is full of ghosts - mangled soldiers, tortured slaves, the innocent victims of war - and Jacob Tracy can see them all. Ever since Antietam, when he lay delirious among the dead and dying, Trace has been haunted by the country&apos;s restless spirits. The curse cost him his family, his calling to the church, and damn near his sanity.\r\n\r\nHe stays out of ghost-populated cities as much as possible these days, guiding wagon trains west with his pragmatic and skeptical partner, Boz. Then, just before the spring rush, Trace gets a letter from the wealthy and reclusive Sabine Fairweather. Sickly, sharp tongued, and far too clever for her own good, Miss Fairweather needs a worthy man to retrieve a dead friend&apos;s legacy from a nearby town - or so she says. When the errand proves far more sinister than advertised, Miss Fairweather admits to knowing about Trace&apos;s curse and suggests she might be able to help him - in exchange for a few more odd jobs.\r\n\r\nTrace has no interest in being her pet psychic, but he&apos;s been searching 18 years for a way to curb his unruly curse, and Miss Fairweather&apos;s knowledge of the spirit world is too tempting to ignore. As she steers him into one macabre situation after another, his powers flourish, and Trace begins to realize some good might be done with this curse of his. But Miss Fairweather is harboring some dark secrets of her own, and her meddling has brought Trace to the attention of something much older and more dangerous than any ghost.\r\n\r\nRich in historical detail and emotional depth, The Curse of Jacob Tracy is a fast-paced and inventive debut, an intriguing introduction to a bold new hero.\r\n\r\nxx","last_updated":"2018-04-13T16:06:17.899Z","parsed":{"xt":"urn:btih:b5fa7781ca91101606c19d0b2492be556a42639b","dn":"The Curse of Jacob Tracy by Holly Messinger EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b5fa7781ca91101606c19d0b2492be556a42639b","infoHashBuffer":{"type":"Buffer","data":[181,250,119,129,202,145,16,22,6,193,157,11,36,146,190,85,106,66,99,155]},"name":"The Curse of Jacob Tracy by Holly Messinger EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}