{"title":"Get the Truth","magnet":"magnet:?xt=urn:btih:b6119dbe83fdcc42b8e96fdb56b7c0e9388d5b30&dn=Get+the+Truth&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"CopperSun","categoryP":"audio","categoryS":"audio_books","size":"210159440","seeders":"25","leechers":"5","description":"Get the Truth: Former CIA Officers Teach You How to Persuade Anyone to Tell All \r\n\r\nBy Philip Houston \r\n\r\nNarrated by Jeff Gurner \r\n\r\nPublished by Macmillan Audio in 2015 \r\n\r\nEnglish, Unabridged \r\n\r\nMP3 64 kbps, 200.42 MB, 7 file(s) \r\n\r\n\r\n\r\n\r\n\r\nGetting someone to tell the truth is an essential skill that very few people possess. In the boardroom, classroom, or our own homes, every day we interact with others and try to get the truth from them. This book will show you how to do it, and do it well!\r\n\r\nPeople are often untruthful out of fear of negative consequences associated with divulging information, or they are untruthful to attempt to gain an advantage. But, if they are made to forget the long-term outcomes of lying, he or she can be influenced to disclose the information that&apos;s being withheld. The aim is to encourage the person to remain in short-term thinking mode, shifting focus away from the long-term ramifications of telling the truth.\r\n\r\nAs former CIA agents and bestselling authors of Spy the Lie, Philip Houston, Mike Floyd, and Susan Carnicero are among the world&apos;s best at detecting deceptive behavior and eliciting the truth from even the most accomplished liars. Get the Truth is a step-by-step guide that empowers readers to elicit the truth from others. It also chronicles the fascinating story of how the authors used a methodology Houston developed to elicit the truth in the counterterrorism and criminal investigation realms, and how these techniques can be applied to our daily lives. This book is complimented with the insights of Peter Romary, an internationally recognized attorney who has worked for government and private sector clients and who is an expert in applying the techniques in law, business, and negotiation.\r\n\r\nUsing thrilling anecdotes from their careers in counterintelligence, and with easy-to-follow instructions, the authors provide a foolproof means of getting absolutely anybody to give an honest answer.\r\n\r\nThe authors have appeared and provided analysis and commentary on broadcast and in print media both nationally and internationally, including CBS, MSNBC, CNBC, Fox, Forbes, BBC, Reuters, Huffington Post, The Financial Times, The Guardian and many others. They also serve government and private-sector clients, including Forbes Rich list families and Fortune 100 companies\r\n\r\nGet the Truth clearly demonstrates the easy and effective way to learn how to get the truth every time","last_updated":"2018-08-25T12:12:55.862Z","parsed":{"xt":"urn:btih:b6119dbe83fdcc42b8e96fdb56b7c0e9388d5b30","dn":"Get the Truth","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b6119dbe83fdcc42b8e96fdb56b7c0e9388d5b30","infoHashBuffer":{"type":"Buffer","data":[182,17,157,190,131,253,204,66,184,233,111,219,86,183,192,233,56,141,91,48]},"name":"Get the Truth","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}