{"title":"How to Invent Everything: A Survival Guide for the Stranded Time","magnet":"magnet:?xt=urn:btih:b61ff9666d8cd85ff471b0410a7636a42c538342&dn=How+to+Invent+Everything%3A+A+Survival+Guide+for+the+Stranded+Time&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"geolittle","categoryP":"other","categoryS":"e_books","size":"81711319","seeders":"41","leechers":"17","description":"How to Invent Everything: A Survival Guide for the Stranded Time Traveler by Ryan North\r\n\r\n&quot;How to Invent Everything is such a cool book. It&apos;s essential reading for anyone who needs to duplicate an industrial civilization quickly.&quot; --Randall Munroe, xkcd creator and New York Times-bestselling author of What If? The only book you need if you&apos;re going back in timeWhat would you do if a time machine hurled you thousands of years into the past. . . and then broke? How would you survive? Could you improve on humanity&apos;s original timeline? And how hard would it be to domesticate a giant wombat? With this book as your guide, you&apos;ll survive--and thrive--in any period in Earth&apos;s history. Bestselling author and time-travel enthusiast Ryan North shows you how to invent all the modern conveniences we take for granted--from first principles. This illustrated manual contains all the science, engineering, art, philosophy, facts, and figures required for even the most clueless time traveler to build a civilization from the ground up. Deeply researched, irreverent, and significantly more fun than being eaten by a saber-toothed tiger, How to Invent Everything will make you smarter, more competent, and completely prepared to become the most important and influential person ever. You&apos;re about to make history. . . better","last_updated":"2018-09-26T12:26:29.852Z","parsed":{"xt":"urn:btih:b61ff9666d8cd85ff471b0410a7636a42c538342","dn":"How to Invent Everything: A Survival Guide for the Stranded Time","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b61ff9666d8cd85ff471b0410a7636a42c538342","infoHashBuffer":{"type":"Buffer","data":[182,31,249,102,109,140,216,95,244,113,176,65,10,118,54,164,44,83,131,66]},"name":"How to Invent Everything: A Survival Guide for the Stranded Time","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}