{"title":"FastStone Image Viewer 6.6 Corporate Multilingual Full With Medi","magnet":"magnet:?xt=urn:btih:b62fceda0761bc27315f257a1dc4e14003b8f590&dn=FastStone+Image+Viewer+6.6+Corporate+Multilingual+Full+With+Medi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BabuPC","categoryP":"applications","categoryS":"windows","size":"7636022","seeders":"5","leechers":"1","description":"FastStone Image Viewer 6.6 Corporate\r\n\r\nFastStone Image Viewer is a fast, stable, user-friendly image browser, converter and editor. It has a nice array of features that include image viewing, management, comparison, red-eye removal, emailing, resizing, cropping and color adjustments. Its innovative but intuitive full-screen mode provides quick access to EXIF information, thumbnail browser and major functionalities via hidden toolbars that pop up when your mouse touches the four edges of the screen.\r\n\r\nOther features include a high quality magnifier and a musical slideshow with 150+ transitional effects, as well as lossless JPEG transitions, drop shadow effects, image annotation, scanner support, histogram and much more. It supports all major graphic formats (BMP, JPEG, JPEG 2000, animated GIF, PNG, PCX, TIFF, WMF, ICO and TGA) and popular digital camera RAW formats (CRW, CR2, NEF, PEF, RAF, MRW, ORF, SRF and DNG).\r\nFeatures:\r\n\r\n&#x2022; Image browser and viewer with a familiar Windows Explorer-like user interface\r\n&#x2022; Support of many popular image formats: BMP, JPEG, JPEG 2000, animated GIF, PNG, PCX, TIFF, WMF, ICO and TGA and popular digital camera RAW formats (CRW, CR2, NEF, PEF, RAF, MRW, ORF, SRF and DNG).\r\n&#x2022; True Full Screen viewer with image zoom support and unique fly-out menu panels\r\n&#x2022; Crystal-clear and customizable one-click image magnifier\r\n&#x2022; Superior Red-Eye effect removal/reduction with completely natural looking end result\r\n&#x2022; Image modification tools: Resize/resample, rotate/flip, crop, sharpen/blur, brightness/contrast, etc.\r\n&#x2022; Eleven (yes, 11) resampling algorithms to choose from when resizing images\r\n&#x2022; Image color effects: gray scale, sepia, negative, Red/Green/Blue adjustment\r\n&#x2022; Image special effects: watermark, annotation, drop shadow, framing, bump map, lens, morph, waves","last_updated":"2018-09-21T12:30:24.528Z","parsed":{"xt":"urn:btih:b62fceda0761bc27315f257a1dc4e14003b8f590","dn":"FastStone Image Viewer 6.6 Corporate Multilingual Full With Medi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b62fceda0761bc27315f257a1dc4e14003b8f590","infoHashBuffer":{"type":"Buffer","data":[182,47,206,218,7,97,188,39,49,95,37,122,29,196,225,64,3,184,245,144]},"name":"FastStone Image Viewer 6.6 Corporate Multilingual Full With Medi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}