{"title":"Belong by Radha Agrawal EPUB","magnet":"magnet:?xt=urn:btih:b69d4ec16ac4fe4ec3258984a81760c7912bae31&dn=Belong+by+Radha+Agrawal+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"14405221","seeders":"26","leechers":"5","description":"xx\r\n\r\nBelong: Find Your People, Create Community &amp; Live a More Connected Life by Radha Agrawal EPUB\r\n\r\nIt&#x2019;s the great paradox of the digital age, what Radha Agrawal calls &#x201C;community confusion&#x201D; - the Internet connects us to hundreds, thousands, even millions of people, and yet we feel more isolated than ever, with one in four Americans saying they have zero friends to confide in. Where are our people? The answer is found in Belong, a highly energetic guide to discovering where and with whom you fit. \r\n\r\nAfter suffering her own bout of community confusion, Agrawal embarked on a journey that ultimately resulted in cofounding Daybreaker, a transformative phenomenon where thousands of people get up at the crack of dawn, meet in event spaces in 22 cities around the world, and dance. Now she&#x2019;s distilled her experience for finding meaningful connections into a two-step process. \r\n\r\nThe first step is going in. This includes determining what we want in a friend and community and what we offer, becoming intentional about our relationships, gauging the type of energy we emit and respond to, and understanding how we do - or don&#x2019;t - show up for others. Then comes going out - how to find a few special friends who feed our soul; or how to find a fully engaged group with similar business, artistic, and social aims; or both. \r\n\r\nConnectedness is the most significant factor in human happiness - Belong is a creative blueprint for bringing this most important dimension back into our lives. \r\n\r\nxx","last_updated":"2018-09-09T12:21:39.583Z","parsed":{"xt":"urn:btih:b69d4ec16ac4fe4ec3258984a81760c7912bae31","dn":"Belong by Radha Agrawal EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b69d4ec16ac4fe4ec3258984a81760c7912bae31","infoHashBuffer":{"type":"Buffer","data":[182,157,78,193,106,196,254,78,195,37,137,132,168,23,96,199,145,43,174,49]},"name":"Belong by Radha Agrawal EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}