{"title":"The Mystery of Edwin Drood: Charles Dickens' Unfinished Novel","magnet":"magnet:?xt=urn:btih:b7288fd4cc4d5b44199cb88444993583c09742ed&dn=The+Mystery+of+Edwin+Drood%3A+Charles+Dickens%27+Unfinished+Novel&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"5310591","seeders":"1","leechers":"0","description":"The Mystery of Edwin Drood: Charles Dickens&apos; Unfinished Novel and Our Endless Attempts to End It - Pete Orford [epub]\r\n\r\nWhen Dickens died on 9 June 1870, he was halfway through writing his last book, &quot;The Mystery of Edwin Drood&quot;. Since that time, hundreds of academics, fans, authors, and playwrights have stepped forward to present their own ideas of how this unfinished book should end.\r\n\r\nStep into a century and half of Dickensian speculation, detection and bickering to see how our attitudes both to Dickens and his last work have developed. From early responses by his contemporaries that tried to cash in on an opportunity to finish Dickens&#x2019; book, through to the dogged attempts of the detectives in the early twentieth century to prove _Drood_ to be the greatest mystery of all time, on to the earnest academics of the mid-century who aimed to reinvent Dickens as a modernist writer, and ending in the glorious irreverence of modern continuations, the history of Drood is a tale of just how far people will go in their quest to find an ending worthy of Dickens.\r\n\r\nWhether you are a life-time &quot;Drood&quot; fan, or new to the whole controversy, this book will guide you through the tangled web of theories and counter-theories surrounding this enduring literary enigma. From novels to websites, musicals to public trials, academic tomes to erotic fiction, the one thing that can be said with certainty is that there is no end to the endless inventiveness with which we redefine Dickens&#x2019; final story in our quest to solve a 150-year old mystery.\r\n\r\nPete Orford is a lecturer in English, and Course Director of the MA in Charles Dickens Studies run by the University of Buckingham in partnership with the Charles Dickens Museum in London.\r\n\r\nHardcover: 240 pages\r\nPublisher: Pen and Sword History (September 21, 2018)","last_updated":"2018-09-22T12:35:07.506Z","parsed":{"xt":"urn:btih:b7288fd4cc4d5b44199cb88444993583c09742ed","dn":"The Mystery of Edwin Drood: Charles Dickens' Unfinished Novel","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b7288fd4cc4d5b44199cb88444993583c09742ed","infoHashBuffer":{"type":"Buffer","data":[183,40,143,212,204,77,91,68,25,156,184,132,68,153,53,131,192,151,66,237]},"name":"The Mystery of Edwin Drood: Charles Dickens' Unfinished Novel","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}