{"title":"The Most Dangerous Game by Gavin Lyall EPUB","magnet":"magnet:?xt=urn:btih:b83e6fef6911d37e7f9aad4ea47872799ee7aca2&dn=The+Most+Dangerous+Game+by+Gavin+Lyall+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"266309","seeders":"43","leechers":"5","description":"xx\r\n\r\nThe Most Dangerous Game by Gavin Lyall EPUB\r\n\r\nBill Cary is a bush pilot living in Lapland in northern Finland, making a precarious living flying aerial survey flights looking for nickel deposits, and occasional charter cargo flights of dubious legitimacy in his beat-up old de Havilland Beaver. Towards the end of the flying season, a wealthy American hunter hires him to fly into a prohibited part of Finland near the Soviet border in order to hunt bear. Subsequently, he is assaulted by thugs when he refuses a charter contract to search for a lost Tsarist treasure, comes under suspicion from the Finnish police for smuggling when Tsarist-era gold sovereigns start turning up, and from the Finnish secret police for espionage. However, things get more serious when the wealthy American&apos;s hunter&apos;s beautiful sister turns up to search for her brother, and his fellow bush pilots start getting killed off in a series of suspicious accidents. Cary suspects that the events he is increasingly involved in may stem from an incident in his wartime past. The Most Dangerous Game was a runner-up for the British Crime Writers Association Gold Dagger Award in 1964.\r\n\r\nGavin Lyall (1932-2003) lived in Hampstead and enjoyed sailing on the Thames in his motor cruiser. From 1959 to 1962 he was a newspaper reporter and the aviation correspondent for the Sunday Times. His first novel, The Wrong Side of the Sky, was published in 1961, drawing from his personal experiences in the Libyan Desert and in Greece. Lyall left journalism in 1963 to become a full-time author, writing 17 novels before his death in 2003.\r\n\r\nxx","last_updated":"2018-06-17T12:03:19.883Z","parsed":{"xt":"urn:btih:b83e6fef6911d37e7f9aad4ea47872799ee7aca2","dn":"The Most Dangerous Game by Gavin Lyall EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b83e6fef6911d37e7f9aad4ea47872799ee7aca2","infoHashBuffer":{"type":"Buffer","data":[184,62,111,239,105,17,211,126,127,154,173,78,164,120,114,121,158,231,172,162]},"name":"The Most Dangerous Game by Gavin Lyall EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}