{"title":"Visionary Women by Andrea Barnet EPUB","magnet":"magnet:?xt=urn:btih:b8f3cd53040d6bb9afe2616332016fffaaabd899&dn=Visionary+Women+by+Andrea+Barnet+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4306870","seeders":"0","leechers":"0","description":"xx\r\n\r\nVisionary Women by Andrea Barnet EPUB\r\n\r\nFour influential women we thought we knew well - Jane Jacobs, Rachel Carson, Jane Goodall, and Alice Waters - and how they spearheaded the modern progressive movement \r\n\r\nThis is the story of four visionaries who profoundly shaped the world we live in today. Together, these women - linked not by friendship or field, but by their choice to break with convention - showed what one person speaking truth to power can do. Jane Jacobs fought for livable cities and strong communities; Rachel Carson warned us about poisoning the environment; Jane Goodall demonstrated the indelible kinship between humans and animals; and Alice Waters urged us to reconsider what and how we eat. \r\n\r\nWith a keen eye for historical detail, Andrea Barnet traces the arc of each woman&apos;s career and explores how their work collectively changed the course of history. While they hailed from different generations, Carson, Jacobs, Goodall, and Waters found their voices in the early 60s. At a time of enormous upheaval, all four stood as bulwarks against 1950s corporate culture and its war on nature. Consummate outsiders, each prevailed against powerful and mostly male adversaries while also anticipating the disaffections of the emerging counterculture. \r\n\r\nAll told, their efforts ignited a transformative progressive movement while offering people a new way to think about the world and a more positive way of living in it. \r\n\r\nxx","last_updated":"2018-04-23T12:00:35.570Z","parsed":{"xt":"urn:btih:b8f3cd53040d6bb9afe2616332016fffaaabd899","dn":"Visionary Women by Andrea Barnet EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b8f3cd53040d6bb9afe2616332016fffaaabd899","infoHashBuffer":{"type":"Buffer","data":[184,243,205,83,4,13,107,185,175,226,97,99,50,1,111,255,170,171,216,153]},"name":"Visionary Women by Andrea Barnet EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}