{"title":"Creating Innovators by Tony Wagner EPUB","magnet":"magnet:?xt=urn:btih:b99d7c4803147c8d5785857af110d8d1cd8f04f4&dn=Creating+Innovators+by+Tony+Wagner+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"823328","seeders":"0","leechers":"0","description":"xx\r\n\r\nCreating Innovators by Tony Wagner EPUB\r\n\r\nIn this groundbreaking book, education expert Tony Wagner provides a powerful rationale for developing an innovation-driven economy. He explores what parents, teachers, and employers must do to develop the capacities of young people to become innovators. In profiling compelling young American innovators - such as Kirk Phelps, product manager for Apple&#x2019;s first iPhone, and Jodie Wu, who founded a company that builds bicycle-powered maize shellers in Tanzania - Wagner reveals how the adults in their lives nurtured their creativity and sparked their imaginations, while teaching them to learn from failures and persevere. Wagner identifies a pattern: a childhood of creative play leads to deep-seated interests, which in adolescence and adulthood blossom into a deeper purpose for career and life goals. Play, passion, and purpose: These are the forces that drive young innovators.\r\n\r\nWagner explains how we can apply this knowledge as educators and what parents can do to compensate for poor schooling. He takes readers into the most forward-thinking schools, colleges, and workplaces in the country, where teachers and employers are developing cultures of innovation based on collaboration, interdisciplinary problem-solving, and intrinsic motivation. The result is a timely, provocative, and inspiring manifesto that will change how we look at our schools and workplaces, and provide us with a road map for creating the change-makers of tomorrow.\r\n\r\nxx","last_updated":"2018-01-26T12:00:51.709Z","parsed":{"xt":"urn:btih:b99d7c4803147c8d5785857af110d8d1cd8f04f4","dn":"Creating Innovators by Tony Wagner EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b99d7c4803147c8d5785857af110d8d1cd8f04f4","infoHashBuffer":{"type":"Buffer","data":[185,157,124,72,3,20,124,141,87,133,133,122,241,16,216,209,205,143,4,244]},"name":"Creating Innovators by Tony Wagner EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}