{"title":"Heart Spring Mountain by Robin MacArthur EPUB","magnet":"magnet:?xt=urn:btih:baaaac29b6d672f0c636741719adfd37059ea286&dn=Heart+Spring+Mountain+by+Robin+MacArthur+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"767434","seeders":"8","leechers":"8","description":"xx\r\n\r\nHeart Spring Mountain by Robin MacArthur EPUB\r\n\r\nIn this evocative first novel, a young woman returns to her rural Vermont hometown in the wake of a devastating storm to search for her missing mother and unravel a powerful family secret.\r\n\r\nIt&apos;s August 2011, and Tropical Storm Irene has just wreaked havoc on Vermont, flooding rivers and destroying homes. One thousand miles away - while tending bar in New Orleans - Vale receives a call and is told that her mother, Bonnie, has disappeared. Despite a years-long estrangement from Bonnie, Vale drops everything and returns home to look for her.\r\n\r\nThough the hometown Vale comes back to is not the one she left eight years earlier, she finds herself falling back into the lives of the family she thought she&apos;d long since left behind. As Vale begins her search, the narrative opens up and pitches back and forth in time to follow three generations of women - a farming widow, a back-to-the-land dreamer, and an owl-loving hermit - as they seek love, bear children, and absorb losses. All the while, Vale&apos;s search has her unwittingly careening toward a family origin secret more stunning than she ever imagined.\r\n\r\nWritten with a striking sense of place, Heart Spring Mountain is an arresting novel about returning home, finding hope in the dark, and the power of the land - and the stories it harbors - to connect and to heal. It&apos;s also an absorbing exploration of the small fractures that can make families break - and the lasting ties that bind them together.\r\n\r\nxx","last_updated":"2018-02-07T12:04:32.733Z","parsed":{"xt":"urn:btih:baaaac29b6d672f0c636741719adfd37059ea286","dn":"Heart Spring Mountain by Robin MacArthur EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"baaaac29b6d672f0c636741719adfd37059ea286","infoHashBuffer":{"type":"Buffer","data":[186,170,172,41,182,214,114,240,198,54,116,23,25,173,253,55,5,158,162,134]},"name":"Heart Spring Mountain by Robin MacArthur EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}