{"title":"The Infinite Future by Tim Wirkus EPUB","magnet":"magnet:?xt=urn:btih:bb180eeecd573d26c2e70bdbc91b34c59fa986f8&dn=The+Infinite+Future+by+Tim+Wirkus+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2720711","seeders":"27","leechers":"12","description":"xx\r\n\r\nThe Infinite Future by Tim Wirkus EPUB\r\n\r\nAn exhilarating, original novel, set in Brazil, Idaho, and outer space, about an obsessive librarian, a down-at-heel author, and a disgraced historian who go on the hunt for a mystical, life-changing book - and find it.\r\n\r\nThe Infinite Future is a mind-bending novel that melds two addictive tales in one. In the first, we meet three broken people, joined by an obsession with a forgotten Brazilian science-fiction author named Salgado-MacKenzie. There&apos;s Danny, a writer who&apos;s been scammed by a shady literary award committee; Sergio, journalist turned sub-librarian in S&#xE3;o Paulo; and Harriet, an excommunicated Mormon historian in Salt Lake City, who years ago corresponded with the reclusive Brazilian writer. The motley trio sets off to discover his identity, and whether his fabled masterpiece - never published - actually exists. Did his inquiries into the true nature of the universe yield something so enormous that his mind was blown for good?\r\n\r\nIn the second half, Wirkus gives us the lost masterpiece itself - the actual text of The Infinite Future, Salgado-MacKenzie&apos;s wonderfully weird magnum opus. The two stories merge in surprising and profound ways. Part science fiction, part academic satire, and part book-lover&apos;s quest, this wholly original novel captures the heady way that stories inform and mirror our lives.\r\n\r\nxx","last_updated":"2018-01-18T19:00:21.494Z","parsed":{"xt":"urn:btih:bb180eeecd573d26c2e70bdbc91b34c59fa986f8","dn":"The Infinite Future by Tim Wirkus EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bb180eeecd573d26c2e70bdbc91b34c59fa986f8","infoHashBuffer":{"type":"Buffer","data":[187,24,14,238,205,87,61,38,194,231,11,219,201,27,52,197,159,169,134,248]},"name":"The Infinite Future by Tim Wirkus EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}