{"title":"A Rage for Order by Robert Worth EPUB","magnet":"magnet:?xt=urn:btih:bb6baf78684bfc7a98dd12876dc5e13b112b1bef&dn=A+Rage+for+Order+by+Robert+Worth+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"435656","seeders":"13","leechers":"11","description":"xx\r\n\r\nA Rage for Order by Robert Worth EPUB\r\n\r\nThe definitive work of literary journalism on the Arab Spring and its troubled aftermath.\r\n\r\nIn 2011 a wave of revolution spread through the Middle East as protesters demanded an end to tyranny, corruption, and economic decay. From Egypt to Yemen, a generation of young Arabs insisted on a new ethos of common citizenship. Five years later their utopian aspirations have taken on a darker cast as old divides reemerge and deepen. In one country after another, brutal terrorists and dictators have risen to the top.\r\n\r\nA Rage for Order is the first work of literary journalism to track the tormented legacy of what was once called the Arab Spring. In the style of V. S. Naipaul and Lawrence Wright, the distinguished New York Times correspondent Robert F. Worth brings the history of the present to life through vivid stories and portraits. We meet a Libyan rebel who must decide whether to kill the Qaddafi-regime torturer who murdered his brother; a Yemeni farmer who lives in servitude to a poetry-writing, dungeon-operating chieftain; and an Egyptian doctor who is caught between his loyalty to the Muslim Brotherhood and his hopes for a new tolerant democracy.\r\n\r\nCombining dramatic storytelling with an original analysis of the Arab world today, A Rage for Order captures the psychic and actual civil wars raging throughout the Middle East and explains how the dream of an Arab renaissance gave way to a new age of discord.\r\n\r\nxx","last_updated":"2018-01-22T21:39:59.828Z","parsed":{"xt":"urn:btih:bb6baf78684bfc7a98dd12876dc5e13b112b1bef","dn":"A Rage for Order by Robert Worth EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bb6baf78684bfc7a98dd12876dc5e13b112b1bef","infoHashBuffer":{"type":"Buffer","data":[187,107,175,120,104,75,252,122,152,221,18,135,109,197,225,59,17,43,27,239]},"name":"A Rage for Order by Robert Worth EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}