{"title":"Jan Karski.Story of a Secret State","magnet":"magnet:?xt=urn:btih:bb9d462c4d159a8f0722ab10f18d5ef253ee9c1c&dn=Jan+Karski.Story+of+a+Secret+State&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Xiadxico","categoryP":"other","categoryS":"e_books","size":"1930728","seeders":"1","leechers":"3","description":" \r\n\r\n\t\r\nStory of a Secret State\r\nMy Report to the World\r\n\r\nForeword by Madeleine Albright\r\n\r\nJan Karski&apos;s Story of a Secret State stands as one of the most poignant and inspiring memoirs of World War II and the Holocaust. With elements of a spy thriller, documenting his experiences in the Polish Underground, and as one of the first accounts of the systematic slaughter of the Jews by the German Nazis, this volume is a remarkable testimony of one man&apos;s courage and a nation&apos;s struggle for resistance against overwhelming oppression.\r\n\r\nKarski was a brilliant young diplomat when war broke out in 1939 with Hitler&apos;s invasion of Poland. Taken prisoner by the Soviet Red Army, which had simultaneously invaded from the East, Karski narrowly escaped the subsequent Katyn Forest Massacre. He became a member of the Polish Underground, the most significant resistance movement in occupied Europe, acting as a liaison and courier between the Underground and the Polish government-in-exile. He was twice smuggled into the Warsaw Ghetto, and entered the Nazi&apos;s Izbica transit camp disguised as a guard, witnessing first-hand the horrors of the Holocaust.\r\n\r\nKarski&apos;s courage and testimony, conveyed in a breathtaking manner in Story of a Secret State, offer the narrative of one of the world&apos;s greatest eyewitnesses and an inspiration for all of humanity, emboldening each of us to rise to the challenge of standing up against evil and for human rights. This definitive edition&#x2014;which includes a foreword by Madeleine Albright, a biographical essay by Yale historian Timothy Snyder, an afterword by Zbigniew Brzezinski, previously unpublished photos, notes, further reading, and a glossary&#x2014;is an apt legacy for this hero of conscience during the most fraught and fragile moment in modern history","last_updated":"2018-03-17T12:05:59.505Z","parsed":{"xt":"urn:btih:bb9d462c4d159a8f0722ab10f18d5ef253ee9c1c","dn":"Jan Karski.Story of a Secret State","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bb9d462c4d159a8f0722ab10f18d5ef253ee9c1c","infoHashBuffer":{"type":"Buffer","data":[187,157,70,44,77,21,154,143,7,34,171,16,241,141,94,242,83,238,156,28]},"name":"Jan Karski.Story of a Secret State","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}