{"title":"Don't You Ever_ My Mother and Her Secret Son by Mary Carter Bish","magnet":"magnet:?xt=urn:btih:bbf093de8ca61a4c536ed8a12f3a97e9c4e206e6&dn=Don%27t+You+Ever_+My+Mother+and+Her+Secret+Son+by+Mary+Carter+Bish&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1961854","seeders":"14","leechers":"0","description":"xx\r\n\r\nDon&apos;t You Ever: My Mother and Her Secret Son by Mary Carter Bishop EPUB\r\n\r\nFrom a prize-winning journalist, Mary Carter Bishop, a moving and beautifully rendered memoir about the half-brother she didn&#x2019;t know existed that hauntingly explores family, class, secrets, and fate.\r\n\r\nApplying for a passport as an adult, Mary Carter Bishop made a shocking discovery. She had a secret half-brother. Her mother, a farm manager&#x2019;s wife on a country estate, told Mary Carter the abandoned boy was a youthful &quot;mistake&quot; from an encounter with a married man. There had been a home for unwed mothers; foster parents; an orphanage.\r\n\r\nNine years later, Mary Carter tracked Ronnie down at the barbershop where he worked, and found a near-broken man - someone kind, and happy to meet her, but someone also deeply and irreversibly damaged by a life of neglect and abuse at the hands of an uncaring system. He was also disfigured because of a rare medical condition that would eventually kill him, three years after their reunion. During that window, Mary Carter grew close to Ronnie, and as she learned more about him she became consumed by his story. How had Ronnie&#x2019;s life gone so wrong when hers had gone so well? How could she reconcile the doting, generous mother she knew with a woman who could not bring herself to acknowledge her own son?\r\n\r\nDigging deep into her family&#x2019;s lives for understanding, Mary Carter unfolds a sweeping story of religious intolerance, poverty, fear, ambition, class, and social expectations. Don&#x2019;t You Ever is a modern Dickensian tale about a child seemingly cursed from birth; a woman shattered by guilt; a husband plagued by self-doubt; a prodigal daughter whose innocence was cruelly snatched away - all living in genteel central Virginia, a world defined by extremes of rural poverty and fabulous wealth.\r\n\r\nA riveting memoir about a family haunted by a shameful secret, Don&#x2019;t You Ever is a powerful story of a woman&#x2019;s search for her long-hidden sibling, and the factors that profoundly impact our individual destinies.\r\n\r\nxx","last_updated":"2018-07-11T12:05:42.686Z","parsed":{"xt":"urn:btih:bbf093de8ca61a4c536ed8a12f3a97e9c4e206e6","dn":"Don't You Ever_ My Mother and Her Secret Son by Mary Carter Bish","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bbf093de8ca61a4c536ed8a12f3a97e9c4e206e6","infoHashBuffer":{"type":"Buffer","data":[187,240,147,222,140,166,26,76,83,110,216,161,47,58,151,233,196,226,6,230]},"name":"Don't You Ever_ My Mother and Her Secret Son by Mary Carter Bish","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}