{"title":"The Chronicles of Riddick: Escape from Butcher Bay","magnet":"magnet:?xt=urn:btih:bc23cca94aaed3c75b19181d9f240136363ef5e9&dn=The+Chronicles+of+Riddick%3A+Escape+from+Butcher+Bay&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"3459172275","seeders":"4","leechers":"12","description":"The Chronicles of Riddick: Escape from Butcher Bay is a first-person action and stealth video game developed by Starbreeze Studios and published by Vivendi Universal Games. Released for the Xbox and Windows in 2004, the game is a tie-in prequel to the futuristic science fiction film The Chronicles of Riddick. Actor Vin Diesel&#x2014;who was involved in the game&apos;s development&#x2014;reprises his role as that film&apos;s protagonist, Richard B. Riddick.\n\nThe game follows Riddick, the anti-hero of the two films Pitch Black and The Chronicles of Riddick, as he attempts to escape from a maximum-security prison called Butcher Bay. Escape from Butcher Bay&apos;s designers focused on exploring Riddick&apos;s character in a prison break setting to differentiate the game from the film. The game&apos;s influences include the film Escape from Alcatraz, and video games such as Half-Life and Tom Clancy&apos;s Splinter Cell.\n\nEscape from Butcher Bay was praised by critics, who lauded its graphics and its implementation of stealth, action and adventure elements. However, they commonly lamented its brevity and lack of multiplayer components. The game went on to win several accolades, including the Golden Joystick Award for Unsung Hero Game of the Year and the Spike Video Game Award for Best Game Based on a Movie. An enhanced remake of the game, included in The Chronicles of Riddick: Assault on Dark Athena, was released in 2009","last_updated":"2018-10-22T12:11:18.001Z","parsed":{"xt":"urn:btih:bc23cca94aaed3c75b19181d9f240136363ef5e9","dn":"The Chronicles of Riddick: Escape from Butcher Bay","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bc23cca94aaed3c75b19181d9f240136363ef5e9","infoHashBuffer":{"type":"Buffer","data":[188,35,204,169,74,174,211,199,91,25,24,29,159,36,1,54,54,62,245,233]},"name":"The Chronicles of Riddick: Escape from Butcher Bay","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}