{"title":"John Quincy Adams: American Visionary by Fred Kaplan EPUB","magnet":"magnet:?xt=urn:btih:bcc24b0d2294d7e827b41add3f45cb1c8a49dbac&dn=John+Quincy+Adams%3A+American+Visionary+by+Fred+Kaplan+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4030685","seeders":"61","leechers":"3","description":"xx\r\n\r\nJohn Quincy Adams: American Visionary by Fred Kaplan EPUB\r\n\r\nFred Kaplan, the acclaimed, award-winning author of Lincoln, returns with John Quincy Adams, an illuminating biography of one of the most overlooked presidents in American history - a leader of sweeping perspective whose progressive values helped shape the course of the nation. In this fresh and lively biography rich in literary analysis and new historical detail, Fred Kaplan brings into focus the dramatic life of John Quincy Adams - the little known and much misunderstood sixth president of the United States and the first son of John and Abigail Adams - and persuasively demonstrates how Adams&apos;s inspiring, progressive vision guided his life and helped shape the course of America.\r\n\r\nKaplan draws on a trove of unpublished archival material to trace Adams&apos;s evolution from his childhood during the Revolutionary War to his brilliant years as Secretary of State to his time in the White House and beyond. He examines Adams&apos;s myriad sides: the public and private man, the statesman and writer, the wise thinker and passionate advocate, the leading abolitionist and fervent federalist who believed strongly in both individual liberty and the government&apos;s role as an engine of progress and prosperity. In these ways - and in his energy, empathy, sharp intellect, and powerful gift with words both spoken and written - he was a predecessor of Lincoln and, later, FDR and Obama. Indeed, this sweeping biography makes clear how Adams&apos;s forward-thinking values, his definition of leadership, and his vision for the nation&apos;s future is as much about 21st-century America as it is about Adams&apos;s own time.\r\n\r\nMeticulously researched and masterfully written, John Quincy Adams paints a rich portrait of this brilliant leader and his significance to the nation and our own lives.\r\n\r\nxx","last_updated":"2018-07-01T12:13:04.306Z","parsed":{"xt":"urn:btih:bcc24b0d2294d7e827b41add3f45cb1c8a49dbac","dn":"John Quincy Adams: American Visionary by Fred Kaplan EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bcc24b0d2294d7e827b41add3f45cb1c8a49dbac","infoHashBuffer":{"type":"Buffer","data":[188,194,75,13,34,148,215,232,39,180,26,221,63,69,203,28,138,73,219,172]},"name":"John Quincy Adams: American Visionary by Fred Kaplan EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}