{"title":"The Affinities by Robert Charles Wilson EPUB","magnet":"magnet:?xt=urn:btih:bcd9aac82fd32c89bd501bd1fa2b003ecfba0835&dn=The+Affinities+by+Robert+Charles+Wilson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"926824","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Affinities by Robert Charles Wilson EPUB\r\n\r\nIn our rapidly-changing world of &quot;social media&quot;, everyday people are more and more able to sort themselves into social groups based on finer and finer criteria. In the near future of Robert Charles Wilson&apos;s The Affinities, this process is supercharged by new analytic technologies - genetic, brain-mapping, behavioral.\r\n\r\nTo join one of the 22 Affinities is to change one&apos;s life. It&apos;s like family, and more than family. Your fellow members aren&apos;t just like you, and they aren&apos;t just people who are likely to like you. They&apos;re also the people with whom you can best cooperate in all areas of life - creative, interpersonal, even financial. At loose ends both professional and personal, young Adam Fisk takes the suite of tests to see if he qualifies for any of the Affinities, and finds that he&apos;s a match for one of the largest, the one called Tau. It&apos;s utopian - at first.\r\n\r\nProblems in all areas of his life begin to simply sort themselves out, as he becomes part of a global network of people dedicated to helping one another - to helping him. But as the differing Affinities put their new powers to the test, they begin to rapidly chip away at the power of governments, of global corporations, of all the institutions of the old world. Then, with dreadful inevitability, the different Affinities begin to go to war - with one another. What happens next will change Adam, and his world, forever.\r\n\r\nxx","last_updated":"2018-07-01T12:12:15.048Z","parsed":{"xt":"urn:btih:bcd9aac82fd32c89bd501bd1fa2b003ecfba0835","dn":"The Affinities by Robert Charles Wilson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bcd9aac82fd32c89bd501bd1fa2b003ecfba0835","infoHashBuffer":{"type":"Buffer","data":[188,217,170,200,47,211,44,137,189,80,27,209,250,43,0,62,207,186,8,53]},"name":"The Affinities by Robert Charles Wilson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}