{"title":"This Could Hurt by Jillian Medoff EPUB","magnet":"magnet:?xt=urn:btih:bcffdc9af832b183185b532681e7bc1991f5e7a4&dn=This+Could+Hurt+by+Jillian+Medoff+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5018931","seeders":"0","leechers":"0","description":"xx\r\n\r\nThis Could Hurt by Jillian Medoff EPUB\r\n\r\nA funny and deeply felt novel that illuminates the pivotal role of work in our lives - a riveting fusion of The Nest, Up in the Air, and Then We Came to the End that captures the emotional complexities of five HR colleagues trying to balance ambition, hope, and fear as their small company is buffeted by economic forces that threaten to upend them.\r\n\r\nRosa Guerrero beat the odds as she rose to the top of the corporate world. An attractive woman of a certain age, the longtime chief of human resources at Ellery Consumer Research is still a formidable presence, even if her most vital days are behind her. A leader who wields power with grace and discretion, she has earned the devotion and loyalty of her staff. No one admires Rosa more than her doting lieutenant Leo Smalls, a benefits vice president whose whole world is Ellery.\r\n\r\nWhile Rosa is consumed with trying to address the needs of her staff within the ever-constricting limits of the company&apos;s bottom line, her associate director, Rob Hirsch, a middle-aged, happily married father of two, finds himself drawing closer to his &quot;work wife&quot;, Lucy Bender, an enterprising single woman searching for something - a romance, a promotion - to fill the vacuum in her personal life. For Kenny Verville, a senior manager with an MBA, Ellery is a temporary stepping-stone to bigger and better places - that is, if his high-powered wife has her way.\r\n\r\nCompelling, flawed, and heartbreakingly human, these men and women scheme, fall in and out of love, and nurture dreams big and small. As their individual circumstances shift, one thing remains constant - Rosa, the sun around whom they all orbit. When her world begins to crumble, the implications for everyone are profound, and Leo, Rob, Lucy, and Kenny find themselves changed in ways beyond their reckoning.\r\n\r\nJillian Medoff explores the inner workings of an American company in all its brilliant, insane, comforting, and terrifying glory. Authentic, razor-sharp, and achingly funny, This Could Hurt is a novel about work, loneliness, love, and loyalty; about sudden reversals and unexpected windfalls; a novel about life.\r\n\r\nxx","last_updated":"2018-01-18T18:58:05.175Z","parsed":{"xt":"urn:btih:bcffdc9af832b183185b532681e7bc1991f5e7a4","dn":"This Could Hurt by Jillian Medoff EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bcffdc9af832b183185b532681e7bc1991f5e7a4","infoHashBuffer":{"type":"Buffer","data":[188,255,220,154,248,50,177,131,24,91,83,38,129,231,188,25,145,245,231,164]},"name":"This Could Hurt by Jillian Medoff EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}