{"title":"Judgment Before Nuremberg by Greg Dawson EPUB","magnet":"magnet:?xt=urn:btih:bd1eeb067de824f87f5392ae89c3b134c1cb1845&dn=Judgment+Before+Nuremberg+by+Greg+Dawson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1417933","seeders":"52","leechers":"11","description":"xx\r\n\r\nJudgment Before Nuremberg by Greg Dawson EPUB\r\n\r\nHere is the story of the forgotten Kharkov trials, which sought justice for the thousands killed in the Ukraine two years prior to the infamous Nuremberg trial.\r\n\r\nWhen people think of the Holocaust, they think of Auschwitz, of Dachau; and when they think of justice for this terrible chapter in history, they think of Nuremberg. Not of Russia or the Ukraine, and certainly not a town called Kharkov. But in reality, the first war-crimes trial against the Nazis was in this idyllic, peaceful Ukrainian city, which is fitting, because it is also where the Holocaust actually began.\r\n\r\nRevealing a lost chapter in Holocaust historiography, Judgment Before Nuremberg tells the story of Dawson&#x2019;s journey to this place, to the scene of the crime, and the discovery of the trial which began the tortuous process of avenging the murder of his grandparents, great-grandparents, and tens of thousands of fellow Ukrainians consumed at the dawn of the Shoah, a moment and crime now largely cloaked in darkness.\r\n\r\nEighteen months before the end of World War II - two full years before the opening statement by the prosecution at Nuremberg - three Nazi officers and a Ukrainian collaborator were tried and convicted of war crimes and hung in Kharkov&#x2019;s public square. The trial is symbolic of the larger omission of Ukraine from the popular history of the Holocaust - another deep irony as most of the first of the six million perished in Ukraine long before Hitler and his lieutenants even decided on the formalities of the Final Solution.\r\n\r\nxx","last_updated":"2018-04-12T17:52:58.793Z","parsed":{"xt":"urn:btih:bd1eeb067de824f87f5392ae89c3b134c1cb1845","dn":"Judgment Before Nuremberg by Greg Dawson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bd1eeb067de824f87f5392ae89c3b134c1cb1845","infoHashBuffer":{"type":"Buffer","data":[189,30,235,6,125,232,36,248,127,83,146,174,137,195,177,52,193,203,24,69]},"name":"Judgment Before Nuremberg by Greg Dawson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}