{"title":"The Clydach Murders by John Morris EPUB","magnet":"magnet:?xt=urn:btih:bd312089892a805ae2a68c149437d998f2eff795&dn=The+Clydach+Murders+by+John+Morris+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"16068516","seeders":"27","leechers":"2","description":"xx\r\n\r\nThe Clydach Murders: A Miscarriage of Justice by John Morris EPUB\r\n\r\nJohn Morris&apos; new book is an investigation into the Clydach murders in South Wales in 1999 in which Mandy Power, her mother and her two daughters were battered to death. \r\n\r\nDai Morris was tried twice for these cruel murders and finally convicted in 2006. Yet John Morris, a legal specialist, is certain that Dai Morris is innocent. No fingerprint evidence or DNA connected Morris to the crime; his conviction was based on the lack of a solid alibi, the presence of his gold chain in Power&apos;s house and the lies he initially told the police in explanation. \r\n\r\nMorris has always maintained his innocence, and new DNA evidence has emerged, together with evidence of falsification of police documents which supports his claim. His case is currently being investigated by the Criminal Case Review Commission. This is a process which can take years to decide if a case should be referred to a court of appeal. Significantly, previous suspects for the murders include former police officers, one of whom was having a lesbian affair with the victim, Mandy Power. \r\n\r\nIn the period between 1980 and 2010, South Wales Police was notorious for getting false convictions based on fabricated evidence, and the Morris case could well be another instance of this. There is every possibility that the man vilified as a brutal killer across the British tabloid press in this much publicised case is actually the victim of a monumental miscarriage of justice. The author has corresponded with Morris, studied all available police files and court papers, discussed the case with key witnesses and experts and examined the evidence; he is convinced that Morris is both innocent and the victim of a conspiracy to convict him.\r\n\r\nxx","last_updated":"2018-09-17T12:22:04.766Z","parsed":{"xt":"urn:btih:bd312089892a805ae2a68c149437d998f2eff795","dn":"The Clydach Murders by John Morris EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bd312089892a805ae2a68c149437d998f2eff795","infoHashBuffer":{"type":"Buffer","data":[189,49,32,137,137,42,128,90,226,166,140,20,148,55,217,152,242,239,247,149]},"name":"The Clydach Murders by John Morris EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}