{"title":"Reclaiming Conversation by Sherry Turkle EPUB","magnet":"magnet:?xt=urn:btih:bdb05848a2a37053a3b62b7447a7b802cb0af453&dn=Reclaiming+Conversation+by+Sherry+Turkle+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"656721","seeders":"28","leechers":"5","description":"xx\r\n\r\nReclaiming Conversation by Sherry Turkle EPUB\r\n\r\nRenowned media scholar Sherry Turkle investigates how a flight from conversation undermines our relationships, creativity, and productivity - and why reclaiming face-to-face conversation can help us regain lost ground.\r\n\r\nWe live in a technological universe in which we are always communicating. And yet we have sacrificed conversation for mere connection.\r\n\r\nPreeminent author and researcher Sherry Turkle has been studying digital culture for over 30 years. Long an enthusiast for its possibilities, here she investigates a troubling consequence: at work, at home, in politics, and in love, we find ways around conversation, tempted by the possibilities of a text or an email in which we don&apos;t have to look, listen, or reveal ourselves.\r\n\r\nWe develop a taste for what mere connection offers. The dinner table falls silent as children compete with phones for their parents&apos; attention. Friends learn strategies to keep conversations going when only a few people are looking up from their phones. At work we retreat to our screens although it is conversation at the water cooler that increases not only productivity but commitment to work. Online we want to share only opinions that our followers will agree with - a politics that shies away from the real conflicts and solutions of the public square.\r\n\r\nThe case for conversation begins with the necessary conversations of solitude and self-reflection. They are endangered: These days, always connected, we see loneliness as a problem that technology should solve. Afraid of being alone, we rely on other people to give us a sense of ourselves, and our capacity for empathy and relationship suffers. We see the costs of the flight from conversation everywhere: Conversation is the cornerstone for democracy, and in business it is good for the bottom line. In the private sphere, it builds empathy, friendship, love, learning, and productivity.\r\n\r\nBut there is good news: We are resilient. Conversation cures.\r\n\r\nxx","last_updated":"2018-04-11T15:08:22.488Z","parsed":{"xt":"urn:btih:bdb05848a2a37053a3b62b7447a7b802cb0af453","dn":"Reclaiming Conversation by Sherry Turkle EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bdb05848a2a37053a3b62b7447a7b802cb0af453","infoHashBuffer":{"type":"Buffer","data":[189,176,88,72,162,163,112,83,163,182,43,116,71,167,184,2,203,10,244,83]},"name":"Reclaiming Conversation by Sherry Turkle EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}