{"title":"In Pieces by Sally Field (.epub)","magnet":"magnet:?xt=urn:btih:bde68f12e7ae0b465fb244d26e572de6c2dd9752&dn=In+Pieces+by+Sally+Field+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"75321443","seeders":"13","leechers":"2","description":"In Pieces by Sally Field\r\n\r\nRequirements: .ePUB reader\r\n\r\nOverview: In this intimate, haunting literary memoir, an American icon tells her story for the first time, and in her own gorgeous words--about a challenging and lonely childhood, the craft that helped her find her voice, and a powerful emotional legacy that shaped her journey as a daughter and a mother. \r\n\r\nOne of the most celebrated, beloved, and enduring actors of our time, Sally Field has an infectious charm that has captivated the nation for more than five decades, beginning with her first TV role at the age of seventeen. From Gidget&apos;s sweet-faced &quot;girl next door&quot; to the dazzling complexity of Sybil to the Academy Award-worthy ferocity and depth of Norma Rae and Mary Todd Lincoln, Field has stunned audiences time and time again with her artistic range and emotional acuity. Yet there is one character who always remained hidden: the shy and anxious little girl within. \r\n\r\nWith raw honesty and the fresh, pitch-perfect prose of a natural-born writer, and with all the humility and authenticity her fans have come to expect, Field brings readers behind-the-scenes for not only the highs and lows of her star-studded early career in Hollywood, but deep into the truth of her lifelong relationships--including her complicated love for her own mother. Powerful and unforgettable, In Pieces is an inspiring and important account of life as a woman in the second half of the twentieth century.\r\n\r\nGenre: Non-Fiction &gt; Biographies &amp; Memoirs","last_updated":"2018-09-23T12:24:42.911Z","parsed":{"xt":"urn:btih:bde68f12e7ae0b465fb244d26e572de6c2dd9752","dn":"In Pieces by Sally Field (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bde68f12e7ae0b465fb244d26e572de6c2dd9752","infoHashBuffer":{"type":"Buffer","data":[189,230,143,18,231,174,11,70,95,178,68,210,110,87,45,230,194,221,151,82]},"name":"In Pieces by Sally Field (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}