{"title":"The Dying of the Light: A Novel by Robert Goolrick EPUB","magnet":"magnet:?xt=urn:btih:bed8e215133ecf60b5bff71e2476b521317b2805&dn=The+Dying+of+the+Light%3A+A+Novel+by+Robert+Goolrick+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"336333","seeders":"2","leechers":"3","description":"xx\r\n\r\nThe Dying of the Light: A Novel by Robert Goolrick EPUB\r\n\r\nFrom the author of the best-selling A Reliable Wife comes a dramatic, passionate tale of a glamorous Southern debutante who marries for money and ultimately suffers for love - a southern gothic as written by Dominick Dunne.\r\n\r\nIt begins with a house and ends in ashes...\r\n\r\nDiana Cooke was &quot;born with the century&quot; and came of age just after World War I. The daughter of Virginia gentry, she knew early that her parents had only one asset, besides her famous beauty: their stately house, Saratoga, the largest in the commonwealth, which has hosted the cr&#xE8;me of society and Hollywood royalty. Though they are land-rich, the Cookes do not have the means to sustain the estate. Without a wealthy husband, Diana will lose the mansion that has been the heart and soul of her family for five generations.\r\n\r\nThe mysterious Captain Copperton is an outsider with no bloodline but plenty of cash. Seeing the ravishing 19-year-old Diana for the first time, he&#x2019;s determined to have her. Diana knows that marrying him would make the Cookes solvent and ensure that Saratoga will always be theirs. Yet Copperton is cruel as well as vulgar; while she admires his money, she cannot abide him. Carrying the weight of Saratoga and generations of Cookes on her shoulders, she ultimately succumbs to duty, sacrificing everything, including love.\r\n\r\nLuckily for Diana, fate intervenes. Her union with Copperton is brief and gives her a son she adores. But when her handsome, charming Ashton, now grown, returns to Saratoga with his college roommate, the real scandal and tragedy begins.\r\n\r\nReveling in the secrets, mores, and society of 20th-century genteel Southern life, The Dying of the Light is a romance, a melodrama, and a cautionary tale told with the grandeur and sweep of an epic Hollywood classic.\r\n\r\nxx","last_updated":"2018-07-11T12:01:37.905Z","parsed":{"xt":"urn:btih:bed8e215133ecf60b5bff71e2476b521317b2805","dn":"The Dying of the Light: A Novel by Robert Goolrick EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bed8e215133ecf60b5bff71e2476b521317b2805","infoHashBuffer":{"type":"Buffer","data":[190,216,226,21,19,62,207,96,181,191,247,30,36,118,181,33,49,123,40,5]},"name":"The Dying of the Light: A Novel by Robert Goolrick EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}