{"title":"Ten Arguments for Deleting Your Social Media Accounts .. EPUB","magnet":"magnet:?xt=urn:btih:c00b9c636716cf16651a90d02d19e9cc4e1b1485&dn=Ten+Arguments+for+Deleting+Your+Social+Media+Accounts+..+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"641094","seeders":"0","leechers":"0","description":"xx\r\n\r\nTen Arguments for Deleting Your Social Media Accounts .. EPUB\r\n\r\nTen Arguments for Deleting Your Social Media Accounts Right Now is a timely call-to-arms from a Silicon Valley pioneer. \r\n\r\nYou might have trouble imagining life without your social media accounts, but virtual reality pioneer Jaron Lanier insists that we&#x2019;re better off without them. In his important new book, Lanier, who participates in no social media, offers powerful and personal reasons for all of us to leave these dangerous online platforms behind before it&#x2019;s too late. \r\n\r\nLanier&#x2019;s reasons for freeing ourselves from social media&#x2019;s poisonous grip include its tendency to bring out the worst in us, to make politics terrifying, to trick us with illusions of popularity and success, to twist our relationship with the truth, to disconnect us from other people even as we are more &#x201C;connected&#x201D; than ever, to rob us of our free will with relentless targeted ads. How can we remain autonomous in a world where we are under continual surveillance and are constantly being prodded by algorithms run by some of the richest corporations in history that have no way of making money other than being paid to manipulate our behavior? How could the &#x201C;benefits&#x201D; of social media possibly outweigh the catastrophic losses to our personal dignity, happiness, and freedom? \r\n\r\nLanier remains a tech optimist, so while demonstrating the evil that rules social media business models today, he also envisions a humanistic setting for social networking that can direct us towards richer and fuller way of living and connecting with our world.\r\n\r\nxx","last_updated":"2018-05-30T12:00:54.373Z","parsed":{"xt":"urn:btih:c00b9c636716cf16651a90d02d19e9cc4e1b1485","dn":"Ten Arguments for Deleting Your Social Media Accounts .. EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c00b9c636716cf16651a90d02d19e9cc4e1b1485","infoHashBuffer":{"type":"Buffer","data":[192,11,156,99,103,22,207,22,101,26,144,208,45,25,233,204,78,27,20,133]},"name":"Ten Arguments for Deleting Your Social Media Accounts .. EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}