{"title":"Analized - Christie Stevens (Slut Wife With A Purpose) NEW 27 Se","magnet":"magnet:?xt=urn:btih:c02017ddc4076ffa4c447db1a065fb391c25d516&dn=Analized+-+Christie+Stevens+%28Slut+Wife+With+A+Purpose%29+NEW+27+Se&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"1164327973","seeders":"12","leechers":"44","description":"Blonde anal loving MILF Christie Stevens knows she is a good whore. She admires her slutty self in a mirror. Her huge tits push up against the glass and her tight ass barely fits in her tiny shorts. Christie turns herself on thinking about what she is about to do. She knows she is here to fuck and be used like a cheap anal whore. The more this blonde fuck doll thinks about it, the nastier she gets. Christie starts to spit at her own face in the mirror. She then cleans off her pretty whore face with her tongue. She strips naked and shows the camera her ready to be used pussy and asshole. Christie Stevens isn&apos;t playing games. She wants a cock jammed into her tight asshole and to make her feel like the whore she is. Steve Holmes is quick to answer the call. He struts up to the blonde MILF. She is nude and ready to be used. He doesn&apos;t want her to be a cum dumpster. Steve wants to romance this fuck doll&apos;s asshole and make her feel like a woman. He worships her body. Christie Stevens writhes with excitement. She can barely contain herself. The more he plays with her body, the more she wants to feel his big cock push inside of her. Steve gives his slut wife what she wants. He opens up her tight asshole and soon Christie is feeling the familiar feeling of being used. This big tits blonde can&apos;t get enough. Christie Stevens goes on a wild ride of anal fucking madness. She is flipped onto her back so her asshole can be ...\r\nCATEGORIES: Anal, Big Tits, Blondes, Facial, Gaping, MILF, Petite, Rimming, Shaved Pussy\r\n <a href=\"\nhttp://imgdone.com/image/zOqsN\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/zOqsN</a>\r\n <a href=\"\nhttp://imgdone.com/image/zO0iK\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/zO0iK</a>","last_updated":"2018-09-27T12:07:42.219Z","parsed":{"xt":"urn:btih:c02017ddc4076ffa4c447db1a065fb391c25d516","dn":"Analized - Christie Stevens (Slut Wife With A Purpose) NEW 27 Se","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c02017ddc4076ffa4c447db1a065fb391c25d516","infoHashBuffer":{"type":"Buffer","data":[192,32,23,221,196,7,111,250,76,68,125,177,160,101,251,57,28,37,213,22]},"name":"Analized - Christie Stevens (Slut Wife With A Purpose) NEW 27 Se","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}