{"title":"The Corporation by T. J. English EPUB","magnet":"magnet:?xt=urn:btih:c0cc3a3da8100906cb963dfbd27ea148711e223b&dn=The+Corporation+by+T.+J.+English+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6369983","seeders":"45","leechers":"7","description":"xx\r\n\r\nThe Corporation: An Epic Story of the Cuban American Underworld by T. J. English EPUB\r\n\r\nA fascinating, cinematic, multi-generational history of the Cuban mob in the US from &quot;America&apos;s top chronicler of organized crime&quot; and New York Times best-selling author of Havana Nocturne.\r\n\r\nBy the mid 1980s, the criminal underworld in the United States had become an ethnic polyglot; one of the most powerful illicit organizations was none other than the Cuban mob. Known on both sides of the law as &quot;the Corporation&quot;, the Cuban mob&apos;s power stemmed from a criminal culture embedded in south Florida&apos;s exile community - those who had been chased from the island by Castro&apos;s revolution and planned to overthrow the Marxist dictator and reclaim their nation.\r\n\r\nAn epic story of gangsters, drugs, violence, sex, and murder rooted in the streets, The Corporation reveals how an entire generation of political exiles, refugees, racketeers, corrupt cops, hit men, and their wives and girlfriends became caught up in an American saga of desperation and empire building. T. J. English interweaves the voices of insiders speaking openly for the first time with a trove of investigative material he has gathered over many decades to tell the story of this successful criminal enterprise, setting it against the larger backdrop of revolution, exile, and ethnicity that makes it one of the great American gangster stories that has been overlooked - until now.\r\n\r\nDrawing on the detailed reporting and impressive volume of evidence that drive his best-selling works, English offers a riveting, in-depth look at this powerful and sordid crime organization and its hold in the US.\r\n\r\nxx","last_updated":"2018-07-03T12:13:50.999Z","parsed":{"xt":"urn:btih:c0cc3a3da8100906cb963dfbd27ea148711e223b","dn":"The Corporation by T. J. English EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c0cc3a3da8100906cb963dfbd27ea148711e223b","infoHashBuffer":{"type":"Buffer","data":[192,204,58,61,168,16,9,6,203,150,61,251,210,126,161,72,113,30,34,59]},"name":"The Corporation by T. J. English EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}