{"title":"Apollo 8 [Story of the First Mission to the Moon]-Jeffrey Kluger","magnet":"magnet:?xt=urn:btih:c0d31047e508f36f8da5b3f9e4c59c34cd7197f8&dn=Apollo+8+%5BStory+of+the+First+Mission+to+the+Moon%5D-Jeffrey+Kluger&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ComGetMe","categoryP":"audio","categoryS":"audio_books","size":"629881639","seeders":"13","leechers":"1","description":"\r\nThis program includes bonus archival audio from Apollo 8&#x2019;s lunar orbit and from the cockpit during the mission.\r\n\r\nThe untold story of the historic voyage to the moon that closed out one of our blackest, bloodiest years with a nearly unimaginable triumph\r\n\r\nIn August 1968, NASA made a bold decision: in just sixteen weeks, the United States would launch humankind&#x2019;s first flight to the moon. Only the year before, three astronauts had burned to death in their spacecraft, and since then the Apollo program had suffered one setback after another. Meanwhile, the Russians were winning the space race, the Cold War was getting hotter by the month, and President Kennedy&#x2019;s promise to put a man on the moon by the end of the decade seemed sure to be broken. But when Frank Borman, Jim Lovell and Bill Anders were summoned to a secret meeting and told of the dangerous mission, they instantly signed on.\r\n\r\nApollo 8 takes us from Mission Control to the astronaut&#x2019;s homes, from the test labs to the launch pad. The race to prepare an untested rocket for an unprecedented journey paves the way for the hair raising trip to the moon. Then, on Christmas Day, a nation that has suffered a horrendous year of assassinations and war is heartened by an inspiring message from the trio of astronauts in lunar orbit. And when the mission is over after the first view of the far side of the moon, the first earthrise, and the first re-entry through the earth&#x2019;s atmosphere following a flight to deep space the impossible dream of walking on the moon suddenly seems within reach.\r\n\r\nThe tale of a mission that was both a calculated risk and a wild crapshoot; a stirring account of how three American heroes forever changed our view of the home planet.\r\n\r\n\r\nRead by: Brian Troxell\r\n\r\nFormat: Stereo mp3\r\n\r\nBit Rate: 128Kbps/44.1Hz\r\n\r\n\r\nRemember to tip your uploader and seed! :)","last_updated":"2018-06-03T12:14:57.107Z","parsed":{"xt":"urn:btih:c0d31047e508f36f8da5b3f9e4c59c34cd7197f8","dn":"Apollo 8 [Story of the First Mission to the Moon]-Jeffrey Kluger","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c0d31047e508f36f8da5b3f9e4c59c34cd7197f8","infoHashBuffer":{"type":"Buffer","data":[192,211,16,71,229,8,243,111,141,165,179,249,228,197,156,52,205,113,151,248]},"name":"Apollo 8 [Story of the First Mission to the Moon]-Jeffrey Kluger","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}