{"title":"The Longest Road by Philip Caputo EPUB","magnet":"magnet:?xt=urn:btih:c21b9bf8b786468dd406998ba3e05a146a904c0b&dn=The+Longest+Road+by+Philip+Caputo+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1783134","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Longest Road by Philip Caputo EPUB\r\n\r\nSeptember 1996 found Philip Caputo on Barter Island, a wind-scoured rock in the Beaufort Sea populated by two hundred Inupiat and a handful of whites. As he gazed upon an American flag above the only school for a 150 miles, he marveled that the children in that school pledged allegiance to the same flag as the children of Cuban immigrants on Key West, almost six thousand miles away. Awed by America&#x2019;s vastness and diversity and filled with a renewed appreciation for its cohesiveness, an idea began to form. With enough time, gas money, and nerve he could drive from the southernmost point to the northernmost point of the United States that is reachable by road, talking to people as he went and trying to better understand what holds our great country together.\r\n\r\nCicada-like, the idea went dormant, not to be reawakened for 14 years. In 2011, America was struggling through the greatest economic downturn since the Depression and was more divided than it had been in living memory. Caputo, who had just turned 70, his wife, and their two English setters took off in a truck hauling an Airstream camper from Key West, Florida, en route via back roads and state routes to Deadhorse, Alaska. The journey took four months and covered 17,000 miles, during which Caputo interviewed more than 80 Americans from all walks of life to get a picture of what their lives and the life of the nation are really about in the 21st century.\r\n\r\nxx","last_updated":"2018-01-23T12:01:42.118Z","parsed":{"xt":"urn:btih:c21b9bf8b786468dd406998ba3e05a146a904c0b","dn":"The Longest Road by Philip Caputo EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c21b9bf8b786468dd406998ba3e05a146a904c0b","infoHashBuffer":{"type":"Buffer","data":[194,27,155,248,183,134,70,141,212,6,153,139,163,224,90,20,106,144,76,11]},"name":"The Longest Road by Philip Caputo EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}