{"title":"Trust: Creating the Foundation for Entrepreneurship in Developin","magnet":"magnet:?xt=urn:btih:c3b4489edab3a661527539a2390f1cd3661f2b28&dn=Trust%3A+Creating+the+Foundation+for+Entrepreneurship+in+Developin&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"bookflare","categoryP":"other","categoryS":"e_books","size":"2688225","seeders":"0","leechers":"0","description":"Description\r\nEntrepreneurial ventures often fail in the developing world because of the lack of something taken for granted in the developed world: trust. Over centuries, the developed world has built customs and institutions such as enforceable contracts, an impartial legal system, and credible regulatory bodies&#x2013;and even unofficial but respected sources of information such as Yelp and Consumer Reports&#x2013;that have created a high level of what scholar and entrepreneur Tarun Khanna calls &#x201C;ambient trust.&#x201D;\r\n\r\nThis is not the case in the developing world. But Khanna shows that rather than become casualties of mistrust, smart entrepreneurs can adopt the mindset that, like it or not, it&#x2019;s up to them to weave their own independent web of trust&#x2013;with their employees, their partners, their clients, their customers, and society as a whole. This can be challenging, and it requires innovative approaches in places where the level of societal mistrust is so high that an official certification of quality simply arouses suspicion&#x2013;and lowers sales! Using vivid examples from Brazil, China, India, Mexico, and elsewhere, Khanna&#x2019;s stories show how entrepreneurs can build on existing customs and practices instead of trying to push against them. He highlights the role new technologies can play (but cautions that these are not panaceas) and explains how entrepreneurs can find dependable partners in national and local governments to create impact at scale","last_updated":"2018-08-16T12:01:20.303Z","parsed":{"xt":"urn:btih:c3b4489edab3a661527539a2390f1cd3661f2b28","dn":"Trust: Creating the Foundation for Entrepreneurship in Developin","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c3b4489edab3a661527539a2390f1cd3661f2b28","infoHashBuffer":{"type":"Buffer","data":[195,180,72,158,218,179,166,97,82,117,57,162,57,15,28,211,102,31,43,40]},"name":"Trust: Creating the Foundation for Entrepreneurship in Developin","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}