{"title":"The Gatekeepers by Dror Moreh EPUB","magnet":"magnet:?xt=urn:btih:c49171230e7b5b53eb32af6857772ea370182a97&dn=The+Gatekeepers+by+Dror+Moreh+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1893253","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Gatekeepers by Dror Moreh EPUB\r\n\r\nThe companion to the Oscar-nominated documentary, an unparalleled look inside Israel&apos;s security establishment. Imagine the following situation: You have just received a tip that six suicide bombers are making their way into the heart of Israel&apos;s major cities, each one to a different city, to set off explosions in the most crowded centers of population. How far would you go to stop the attacks? How would you sleep at night if you failed and one of the six terrorists reached his target and murdered dozens of innocent people? What would you do the next morning to extract your country from this murderous vicious cycle?\r\n\r\nFor six former heads of the Shin Bet (Israel&apos;s internal security service), these were not hypothetical questions but the realities and tormenting way of life for decades. In The Gatekeepers, which is based on extensive and lengthy interviews conducted to produce the award-winning film of the same name, six former heads of the Shin Bet speak with unprecedented candor on how they handled the toughest and tensest moments of their lives; on matters of life and death; on the missions they were involved in; on the historic opportunities for a better future that were missed by the leaders under whom they served; and the scars each of them bears until this very day. The Gatekeepers is a piercing and cruel self-examination of Israel&apos;s security establishment and of a nation that has lived by its sword for so many years but has lost its faith in its ability to lay it down.\r\n\r\nxx","last_updated":"2018-03-19T12:00:34.539Z","parsed":{"xt":"urn:btih:c49171230e7b5b53eb32af6857772ea370182a97","dn":"The Gatekeepers by Dror Moreh EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c49171230e7b5b53eb32af6857772ea370182a97","infoHashBuffer":{"type":"Buffer","data":[196,145,113,35,14,123,91,83,235,50,175,104,87,119,46,163,112,24,42,151]},"name":"The Gatekeepers by Dror Moreh EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}