{"title":"Genius Foods: Become Smarter, Happier .. by Max Lugavere EPUB","magnet":"magnet:?xt=urn:btih:c53b81bd6a3cc95ecd9b01aa07a709ed5df22de9&dn=Genius+Foods%3A+Become+Smarter%2C+Happier+..+by+Max+Lugavere+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1051420","seeders":"41","leechers":"10","description":"xx\r\n\r\nGenius Foods: Become Smarter, Happier .. by Max Lugavere EPUB\r\n\r\nDiscover the critical link between your brain and the food you eat, change the way you think about how your brain ages, and achieve optimal brain performance with this powerful new guide from media personality and leading voice in health Max Lugavere. \r\n\r\nAfter his mother was diagnosed with a mysterious form of dementia, Max Lugavere put his successful media career on hold to learn everything he could about the workings of the human brain and his mother&apos;s condition. For the better half of a decade, he consumed the most up-to-date scientific research, talked to dozens of scientists and clinicians around the world, and visited the country&apos;s very best neurology departments. \r\n\r\nNow, in Genius Foods, Lugavere uncovers the stunning link between our dietary and lifestyle choices and our brain health, revealing how the foods you eat directly affect your ability to focus, learn, remember, create, analyze new ideas, and maintain a healthy, balanced mood. He presents ground-breaking science and distills the latest research, including:\r\n\r\nHow food is like software for our endlessly capable minds; \r\nHow select nutrients can actually boost working memory and processing speed; \r\nHow slowing down the cognitive aging process is just as much about the foods you omit from your diet as the superfoods that you consume; \r\nAnd how easy it is to modulate the quality of your thoughts and mood by food.\r\n\r\nIn the vein of groundbreaking best sellers such as David Perlmutter&apos;s Grain Brain, Tim Ferriss&apos; Four Hour Body, and Dave Asprey&apos;s Bulletproof Diet, Genius Foods presents a comprehensive, practical roadmap to optimizing the brain&apos;s health and performance today - and decades into the future.\r\n\r\nxx","last_updated":"2018-03-22T14:59:10.139Z","parsed":{"xt":"urn:btih:c53b81bd6a3cc95ecd9b01aa07a709ed5df22de9","dn":"Genius Foods: Become Smarter, Happier .. by Max Lugavere EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c53b81bd6a3cc95ecd9b01aa07a709ed5df22de9","infoHashBuffer":{"type":"Buffer","data":[197,59,129,189,106,60,201,94,205,155,1,170,7,167,9,237,93,242,45,233]},"name":"Genius Foods: Become Smarter, Happier .. by Max Lugavere EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}