{"title":"The Evolved Eater by Nick Taranto EPUB","magnet":"magnet:?xt=urn:btih:c5487f14fef0a28b3495255de5b4fdcebac2b9b1&dn=The+Evolved+Eater+by+Nick+Taranto+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3399781","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Evolved Eater by Nick Taranto EPUB\r\n\r\nFrom the cofounder of Plated, the home delivery food service, an inspirational business title that is a call to arms and investigation into the industrial American food complex.\r\n\r\nIn early 2012 Nick Taranto was 27 years old, recently married, and fresh out of the Marine Corps. He moved back to New York City, started working on Wall Street, and put on 20 pounds in under six months. He was pasty, overweight, and depressed - and he knew there had to be a better way to eat (and live).\r\n\r\nThe Evolved Eater chronicles his quest to change how we eat and what this means for the future of food. As the cofounder of Plated, which has delivered tens of millions of meals across the country in its first five years, Taranto cares about the food we eat. As evolved eaters, we strive to continually improve and evolve as we grow through life. And eating - and being close to the food you cook and consume - is an inseparable part of this evolution.\r\n\r\nAmericans throw away over 300 billion pounds of food each year while millions of children are food insecure or poorly nourished. How did the most food abundant nation in history get this vital issue so wrong?\r\n\r\nTaranto provides eye-opening facts about how we acquire and eat food and easy and practical things that you can do to improve the way you eat (and live) starting today. Eating doesn&apos;t need to be complicated or painful or overthought. We&apos;re starting the Evolved Eater revolution right here, right now.\r\n\r\nxx","last_updated":"2018-03-12T12:03:18.048Z","parsed":{"xt":"urn:btih:c5487f14fef0a28b3495255de5b4fdcebac2b9b1","dn":"The Evolved Eater by Nick Taranto EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c5487f14fef0a28b3495255de5b4fdcebac2b9b1","infoHashBuffer":{"type":"Buffer","data":[197,72,127,20,254,240,162,139,52,149,37,93,229,180,253,206,186,194,185,177]},"name":"The Evolved Eater by Nick Taranto EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}