{"title":"Pieces of Her by Karin Slaughter EPUB","magnet":"magnet:?xt=urn:btih:c5e0055e2f0c29493118fc58416e9fa5b4a36cc5&dn=Pieces+of+Her+by+Karin+Slaughter+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"712667","seeders":"0","leechers":"4","description":"xx\r\n\r\nPieces of Her by Karin Slaughter EPUB\r\n\r\nThe #1 international best-selling author returns with an electrifying novel of devastating secrets and hidden lives that probes the fraught relationship between daughters and mothers and the lengths we go to protect those we love.\r\n\r\nWhat if the person you thought you knew best turns out to be someone you never knew at all? Andrea Cooper knows everything about her mother, Laura. She knows Laura has spent nearly her whole life in the small beach town of Belle Isle, Georgia; she knows Laura&apos;s never wanted anything more than to lead a quiet, normal life in this conventional community; she knows Laura&apos;s a kind and beloved speech pathologist who helps others; she knows Laura&apos;s never kept a secret in her life. Andrea knows that Laura is everything she isn&apos;t - confident, settled, sure of herself. Feeling listless, with no direction, Andrea, unlike Laura, struggles to find her way.\r\n\r\nBut Andrea&apos;s certainty is upended when a visit to the mall is shattered by an act of horrifying violence that reveals a completely different side of Laura - a cool woman who calmly faces down a murderer. It turns out that before Andrea&apos;s mother was Laura, she was someone completely different. For nearly 30 years she&apos;s been hiding from the woman she once was, lying low in the hope that no one would ever find her. But now she&apos;s been exposed, and nothing will ever be the same again.\r\n\r\nThe assailant was a mentally troubled, teenaged scion of Georgia law enforcement royalty, and now the police want answers about what really happened in those terrifying moments at the mall. Though she&apos;s being scrutinized at every level of the criminal justice system and her innocence is on the line, Laura refuses to speak to anyone, including her own daughter. She pushes Andrea away, insisting it&apos;s time for her to stand alone and make a life for herself. To save her mother, Andrea embarks on a desperate journey following the breadcrumb trail of her mother&apos;s past. Andrea knows that if she can&apos;t uncover the secrets hidden there, there may be no future for her mother ... or her.\r\n\r\nFilled with intriguing turns, surprising revelations, and a compelling cast of characters, Pieces of Her is Slaughter&apos;s most electrifying, provocative, and suspenseful novel yet.\r\n\r\nxx","last_updated":"2018-08-22T12:04:35.131Z","parsed":{"xt":"urn:btih:c5e0055e2f0c29493118fc58416e9fa5b4a36cc5","dn":"Pieces of Her by Karin Slaughter EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c5e0055e2f0c29493118fc58416e9fa5b4a36cc5","infoHashBuffer":{"type":"Buffer","data":[197,224,5,94,47,12,41,73,49,24,252,88,65,110,159,165,180,163,108,197]},"name":"Pieces of Her by Karin Slaughter EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}