{"title":"Bachelor Girl by Kim Van Alkemade EPUB","magnet":"magnet:?xt=urn:btih:c70c7e590c868842c2b6bc48e85e9a918a90a4ad&dn=Bachelor+Girl+by+Kim+Van+Alkemade+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2907452","seeders":"3","leechers":"2","description":"xx\r\n\r\nBachelor Girl by Kim Van Alkemade EPUB\r\n\r\nFrom the New York Times best-selling author of Orphan #8 comes a fresh and intimate novel about the destructive power of secrets and the redemptive power of love - inspired by the true story of Jacob Ruppert, the millionaire owner of the New York Yankees, and his mysterious bequest in 1939 to an unknown actress, Helen Winthrope Weyant.\r\n\r\nWhen the owner of the New York Yankees baseball team, Colonel Jacob Ruppert, takes Helen Winthrope, a young actress, under his wing, she thinks it&apos;s because of his guilt over her father&apos;s accidental death - and so does Albert Kramer, Ruppert&apos;s handsome personal secretary. Helen and Albert develop a deepening bond the closer they become to Ruppert, an eccentric millionaire who demands their loyalty in return for his lavish generosity.\r\n\r\nNew York in the Jazz Age is filled with possibilities, especially for the young and single. Yet even as Helen embraces being a &quot;bachelor girl&quot; - a working woman living on her own terms - she finds herself falling in love with Albert, even after he confesses his darkest secret. When Ruppert dies, rumors swirl about his connection to Helen after the stunning revelation that he has left her the bulk of his fortune, which includes Yankee Stadium. But it is only when Ruppert&apos;s own secrets are finally revealed that Helen and Albert will be forced to confront the truth about their relationship to him - and to each other.\r\n\r\nInspired by factual events that gripped New York City in its heyday, Bachelor Girl is a hidden history gem about family, identity, and love in all its shapes and colors.\r\n\r\nxx","last_updated":"2018-05-07T12:06:52.484Z","parsed":{"xt":"urn:btih:c70c7e590c868842c2b6bc48e85e9a918a90a4ad","dn":"Bachelor Girl by Kim Van Alkemade EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c70c7e590c868842c2b6bc48e85e9a918a90a4ad","infoHashBuffer":{"type":"Buffer","data":[199,12,126,89,12,134,136,66,194,182,188,72,232,94,154,145,138,144,164,173]},"name":"Bachelor Girl by Kim Van Alkemade EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}