{"title":"A Bigger Prize by Margaret Heffernan EPUB","magnet":"magnet:?xt=urn:btih:c98474519f4a47b83681fd0b82ac2433f6dd039b&dn=A+Bigger+Prize+by+Margaret+Heffernan+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"718281","seeders":"9","leechers":"7","description":"xx\r\n\r\nA Bigger Prize by Margaret Heffernan EPUB\r\n\r\nGet into the best schools. Land your next big promotion. Dress for success. Run faster. Play tougher. Work harder. Keep score. And whatever you do make sure you win.\r\n\r\nCompetition runs through every aspect of our lives today. From the cubicle to the race track, in business and love, religion and science, what matters now is to be the biggest, fastest, meanest, toughest, richest. The upshot of all these contests? As Margaret Heffernan shows in this eye-opening book, competition regularly backfires, producing an explosion of cheating, corruption, inequality, and risk. The demolition derby of modern life has damaged our ability to work together. But it doesn&apos;t have to be this way. CEOs, scientists, engineers, investors, and inventors around the world are pioneering better ways to create great products, build enduring businesses, and grow relationships. Their secret? Generosity. Trust. Time. Theater.\r\n\r\nFrom the cranberry bogs of Massachusetts to the classrooms of Singapore and Finland, from tiny start-ups to global engineering firms and beloved American organizations like Ocean Spray, Eileen Fisher, Gore, and Boston Scientific, Heffernan discovers ways of living and working that foster creativity, spark innovation, reinforce our social fabric, and feel so much better than winning.\r\n\r\nxx","last_updated":"2018-01-28T12:04:38.720Z","parsed":{"xt":"urn:btih:c98474519f4a47b83681fd0b82ac2433f6dd039b","dn":"A Bigger Prize by Margaret Heffernan EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c98474519f4a47b83681fd0b82ac2433f6dd039b","infoHashBuffer":{"type":"Buffer","data":[201,132,116,81,159,74,71,184,54,129,253,11,130,172,36,51,246,221,3,155]},"name":"A Bigger Prize by Margaret Heffernan EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}