{"title":"Advice Not Given_ .. Getting Over Yourself by Mark Epstein EPUB","magnet":"magnet:?xt=urn:btih:ca5005e58dc00f292a077149e13e838ffa4b5c9e&dn=Advice+Not+Given_+..+Getting+Over+Yourself+by+Mark+Epstein+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"537037","seeders":"39","leechers":"8","description":"xx\r\n\r\nAdvice Not Given_ .. Getting Over Yourself by Mark Epstein EPUB\r\n\r\nRenowned psychiatrist and author Dr. Mark Epstein presents a how-to guide rooted in two traditions, Buddhism and Western psychotherapy, devoted to maximizing the human potential for living a better life.\r\n\r\nOur ego, and its accompanying sense of nagging self-doubt as we work to be bigger, better, smarter, and more in control, is one affliction we all share. And, while our ego claims to have our best interests at heart, in its never-ending pursuit of attention and power, it sabotages the very goals it sets to achieve. In Advice Not Given, Dr. Mark Epstein reveals how Buddhism and Western psychotherapy, two traditions that developed in entirely different times and places and, until recently, had nothing to do with each other, both identify the ego as the limiting factor in our well-being, and both come to the same conclusion: When we give the ego free reign, we suffer; but when it learns to let go, we are free.\r\n\r\nWith great insight, and in a deeply personal style, Epstein offers readers a how-to guide that refuses a quick fix, grounded in two traditions devoted to maximizing the human potential for living a better life. Using the Eightfold Path, eight areas of self-reflection that Buddhists believe necessary for enlightenment, as his scaffolding, Epstein looks back productively on his own experience and that of his patients. While the ideas of the Eightfold Path are as old as Buddhism itself, when informed by the sensibility of Western psychotherapy, they become something more: a road map for spiritual and psychological growth, a way of dealing with the intractable problem of the ego. Breaking down the wall between East and West, Epstein brings a Buddhist sensibility to therapy and a therapist&apos;s practicality to Buddhism. Speaking clearly and directly, he offers a rethinking of mindfulness that encourages people to be more watchful of their ego, an idea with a strong foothold in Buddhism but now for the first time applied in the context of psychotherapy.\r\n\r\nOur ego is at once our biggest obstacle and our greatest hope. We can be at its mercy or we can learn to mold it. Completely unique and practical, Epstein&apos;s advice can be used by all - each in his or her own way - and will provide wise counsel in a confusing world. After all, as he says, &quot;Our egos can use all the help they can get.&quot;\r\n\r\nxx","last_updated":"2018-01-18T19:01:18.862Z","parsed":{"xt":"urn:btih:ca5005e58dc00f292a077149e13e838ffa4b5c9e","dn":"Advice Not Given_ .. Getting Over Yourself by Mark Epstein EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ca5005e58dc00f292a077149e13e838ffa4b5c9e","infoHashBuffer":{"type":"Buffer","data":[202,80,5,229,141,192,15,41,42,7,113,73,225,62,131,143,250,75,92,158]},"name":"Advice Not Given_ .. Getting Over Yourself by Mark Epstein EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}