{"title":"The Fox Hunt by Mohammed Al Samawi EPUB","magnet":"magnet:?xt=urn:btih:cada2d3bf1528db39b2b5d6ba8dede99105e9898&dn=The+Fox+Hunt+by+Mohammed+Al+Samawi+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4981268","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Fox Hunt by Mohammed Al Samawi EPUB\r\n\r\nA young man&#x2019;s moving story of war, friendship, and hope in which he recounts his harrowing escape from a brutal civil war in Yemen with the help of a daring plan engineered on social media by a small group of interfaith activists in the West. \r\n\r\nBorn in the Old City of Sana&#x2019;a, Yemen, to a pair of middle-class doctors, Mohammed Al Samawi was a devout Muslim raised to think of Christians and Jews as his enemy. But when Mohammed was 23, he secretly received a copy of the Bible, and what he read cast doubt on everything he&#x2019;d previously believed. After connecting with Jews and Christians on social media, and at various international interfaith conferences, Mohammed became an activist, making it his mission to promote dialogue and cooperation in Yemen. \r\n\r\nThen came the death threats: first onthen through terrifying anonymous phone calls. To protect himself and his family, Mohammed fled to the southern port city of Aden. He had no way of knowing that Aden was about to become the heart of a north-south civil war, and the battleground for a well-funded proxy war between Iran and Saudi Arabia. As gunfire and grenades exploded throughout the city, Mohammed hid in the bathroom of his apartment and desperately appealed to his contacts on\r\n\r\nMiraculously, a handful of people he barely knew responded. Over 13 days, four ordinary young people with zero experience in diplomacy or military exfiltration worked across six technology platforms and 10 time zones to save this innocent young man trapped between deadly forces - rebel fighters from the north and Al Qaeda operatives from the south. \r\n\r\nThe story of an improbable escape as riveting as the best and most addictive thrillers, The Fox Hunt reminds us that goodness and decency can triumph in the darkest circumstances.\r\n\r\nxx","last_updated":"2018-04-30T12:00:47.538Z","parsed":{"xt":"urn:btih:cada2d3bf1528db39b2b5d6ba8dede99105e9898","dn":"The Fox Hunt by Mohammed Al Samawi EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cada2d3bf1528db39b2b5d6ba8dede99105e9898","infoHashBuffer":{"type":"Buffer","data":[202,218,45,59,241,82,141,179,155,43,93,107,168,222,222,153,16,94,152,152]},"name":"The Fox Hunt by Mohammed Al Samawi EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}