{"title":"LizardSystems Network Scanner 4.3.2 Build 213 + Medicine[BabuPC]","magnet":"magnet:?xt=urn:btih:cb9afe283663daa844cf84ec29d4d7a705453bcc&dn=LizardSystems+Network+Scanner+4.3.2+Build+213+%2B+Medicine%5BBabuPC%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BabuPC","categoryP":"applications","categoryS":"windows","size":"2491342","seeders":"0","leechers":"0","description":"LizardSystems Network Scanner\r\nNetwork Scanner is an IP scanner that is used for scanning both large corporate networks that have hundred thousands of computers along with small home networks with several computers. While the program can scan a list of IP addresses, computers and ranges of IP addresses, the number of computers and subnets is unlimited. Network Scanner will show you all the shared resources, including system and hidden NetBIOS (Samba) shared resources along with FTP and web resources. To audit network computers or use it to search for available network resources, both network administrators and regular users can use Network Scanner.\r\n\r\nNetwork Scanner will not only find network computers and shared resources, but also check its access rights which the user can mount as a network drive or open them in Explorer or in their browser. You can easily export the results of scanning the network to an XML, HTML or text file or store them in the program itself.\r\n\r\nKey features:\r\nEasy to use. Even an inexperienced user will be able to scan the network with just a few clicks.\r\nGood performance. The program uses multi-threaded scanning. The network scan rate achieves thousands of computers per minute.\r\nScalability. You can either scan several computers or entire subnets.\r\nFlexible filtering options. You can filter the results by type of resource or access rights.\r\nCustomizable computer status check. The program checks if the computer is on/off not only with a ping, but also with a connection to the ports specified by the user.\r\nRetrieving the NetBIOS or domain computer name (defined by the user).\r\nYou will see all available computer resources. Not only getting NetBIOS resources, but also scanning for FTP and web servers.\r\nNetwork resource audit. The program will check access rights to resources (read/write) both for the current user and for any specified user.\r\nAvailable to all users. No administrator privileges are required for scanning.\r\nExporting the scan results. You can export them to html, txt or xml.\r\n <a href=\"\nhttp://babupc.com.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://babupc.com.html</a>","last_updated":"2018-11-23T12:07:31.326Z","parsed":{"xt":"urn:btih:cb9afe283663daa844cf84ec29d4d7a705453bcc","dn":"LizardSystems Network Scanner 4.3.2 Build 213   Medicine[BabuPC]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cb9afe283663daa844cf84ec29d4d7a705453bcc","infoHashBuffer":{"type":"Buffer","data":[203,154,254,40,54,99,218,168,68,207,132,236,41,212,215,167,5,69,59,204]},"name":"LizardSystems Network Scanner 4.3.2 Build 213   Medicine[BabuPC]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}