{"title":"I Love Capitalism! by Ken Langone EPUB","magnet":"magnet:?xt=urn:btih:cbc956cf00735f1a283626b804a18367d1120f02&dn=I+Love+Capitalism%21+by+Ken+Langone+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"38887578","seeders":"0","leechers":"0","description":"xx\r\n\r\nI Love Capitalism! by Ken Langone EPUB\r\n\r\nIconoclastic entrepreneur and New York legend Ken Langone tells the compelling story of how a poor boy from Long Island became one of America&apos;s most successful businessmen.\r\n\r\nKen Langone has seen it all on his way to a net worth beyond his wildest dreams. A pillar of corporate America for decades, he&apos;s a co-founder of Home Depot, a former director of the New York Stock Exchange, and a world-class philanthropist (including $200 million for NYU&apos;s Langone Health). In this memoir he finally tells the story of his unlikely rise and controversial career. It&apos;s also a passionate defense of the American Dream - of preserving a country in which any hungry kid can reach the maximum potential of his or her talents and work ethic.\r\n\r\nIn a series of fascinating stories, Langone shows how he struggled to get an education, break into Wall Street, and scramble for an MBA at night while competing with privileged competitors by day. He shares how he learned how to evaluate what a business is worth and apply his street smarts to eight-figure and nine-figure deals. And he&apos;s not shy about discussing, for the first time, his epic legal and PR battle with former NY Governor Eliot Spitzer.\r\n\r\nHis ultimate theme is that free enterprise is the key to giving everyone a leg up. As he writes:   \r\n\r\nThis book is my love song to capitalism. Capitalism works! And I&apos;m living proof - it works for everybody. Absolutely anybody is entitled to dream big, and absolutely everybody should dream big. I did. Show me where the silver spoon was in my mouth. I&apos;ve got to argue profoundly and passionately: I&apos;m the American Dream.\r\n\r\nxx","last_updated":"2018-05-21T12:01:09.409Z","parsed":{"xt":"urn:btih:cbc956cf00735f1a283626b804a18367d1120f02","dn":"I Love Capitalism! by Ken Langone EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cbc956cf00735f1a283626b804a18367d1120f02","infoHashBuffer":{"type":"Buffer","data":[203,201,86,207,0,115,95,26,40,54,38,184,4,161,131,103,209,18,15,2]},"name":"I Love Capitalism! by Ken Langone EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}