{"title":"The Irish Americans by Jay P. Dolan EPUB","magnet":"magnet:?xt=urn:btih:ccc9151051f67e0124b6c5f7d4ab944ba65f1d38&dn=The+Irish+Americans+by+Jay+P.+Dolan+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"902006","seeders":"1","leechers":"0","description":"xx\r\n\r\nThe Irish Americans by Jay P. Dolan EPUB\r\n\r\nJay Dolan of Notre Dame University is one of America&#x2019;s most acclaimed scholars of immigration and ethnic history. In The Irish Americans, he caps his decades of writing and teaching with this magisterial history of the Irish experience in the United States. Although more than 30 million Americans claim Irish ancestry, no other general account of Irish American history has been published since the 1960s. Dolan draws on his own original research and much other recent scholarship to weave an insightful, colorful narrative. He follows the Irish from their first arrival in the American colonies through the bleak days of the potato famine that brought millions of starving immigrants; the trials of ethnic prejudice and &quot;No Irish Need Apply&quot;, the rise of Irish political power and the heyday of Tammany politics; to the election of John F. Kennedy as president, a moment of triumph when an Irish American ascended to the highest office in the land.\r\n\r\nDolan evokes the ghastly ships crowded with men and women fleeing the potato blight; the vibrant life of Catholic parishes in cities like New York and Chicago; the world of machine politics, where ward bosses often held court in the local saloon. Rich in colorful detail, balanced in judgment, and the most comprehensive work of its kind yet published, The American Irish is a lasting achievement by a master historian that will become a must-have volume for any American with an interest in the Irish-American heritage.\r\n\r\nxx","last_updated":"2018-06-03T12:01:07.241Z","parsed":{"xt":"urn:btih:ccc9151051f67e0124b6c5f7d4ab944ba65f1d38","dn":"The Irish Americans by Jay P. Dolan EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ccc9151051f67e0124b6c5f7d4ab944ba65f1d38","infoHashBuffer":{"type":"Buffer","data":[204,201,21,16,81,246,126,1,36,182,197,247,212,171,148,75,166,95,29,56]},"name":"The Irish Americans by Jay P. Dolan EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}