{"title":"Barksdale's Charge by Phillip Thomas Tucker EPUB","magnet":"magnet:?xt=urn:btih:cd18810aa86fe63b8dd6bda093fbdf764eea3410&dn=Barksdale%27s+Charge+by+Phillip+Thomas+Tucker+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5241490","seeders":"0","leechers":"0","description":"xx\r\n\r\nBarksdale&apos;s Charge by Phillip Thomas Tucker EPUB\r\n\r\nOn the third day of Gettysburg, Robert E. Lee launched a magnificent attack. For pure pageantry it was unsurpassed, and it also marked the centerpiece of the war, both time-wise and in terms of how the conflict had turned a corner - from persistent Confederate hopes to impending Rebel despair. But Pickett&#x2019;s Charge was crushed by the Union defenders that day, having never had a chance in the first place.\r\n\r\nThe Confederacy&#x2019;s real &quot;high tide&quot; at Gettysburg had come the afternoon before, during the swirling conflagration when Longstreet&#x2019;s corps first entered the battle, when the Federals just barely held on. The foremost Rebel spearhead on that second day of the battle was Barksdale&#x2019;s Mississippi brigade, which launched what one (Union) observer called the &quot;grandest charge that was ever seen by mortal man&quot;.\r\n\r\nBarksdale&#x2019;s brigade was already renowned in the Army of Northern Virginia for its stand-alone fights at Fredericksburg. On the second day of Gettysburg it was just champing at the bit to go in. The Federal left was not as vulnerable as Lee had envisioned, but had cooperated with Rebel wishes by extending its Third Corps into a salient. Hood&#x2019;s crack division was launched first, seizing Devil&#x2019;s Den, climbing Little Round Top, and hammering in the wheatfield.\r\n\r\nThen Longstreet began to launch McLaws&#x2019; division, and finally gave Barksdale the go-ahead. The Mississippians, with their white-haired commander on horseback at their head, utterly crushed the peach orchard salient and continued marauding up to Cemetery Ridge. Hancock, Meade, and other Union generals desperately struggled to find units to stem the Rebel tide. One of Barksdale&#x2019;s regiments, the 21st Mississippi, veered off from the brigade in the chaos, rampaging across the field, overrunning Union battery after battery. The collapsing Federals had to gather men from four different corps to try to stem the onslaught.\r\n\r\n..\r\n\r\nxx","last_updated":"2018-06-16T12:02:17.216Z","parsed":{"xt":"urn:btih:cd18810aa86fe63b8dd6bda093fbdf764eea3410","dn":"Barksdale's Charge by Phillip Thomas Tucker EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cd18810aa86fe63b8dd6bda093fbdf764eea3410","infoHashBuffer":{"type":"Buffer","data":[205,24,129,10,168,111,230,59,141,214,189,160,147,251,223,118,78,234,52,16]},"name":"Barksdale's Charge by Phillip Thomas Tucker EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}