{"title":"Uzodinma Iweala - Speak No Evil - 2018 (PDF, EPUB, MOBI)","magnet":"magnet:?xt=urn:btih:cd3769a43c71c0ea56d6769b2d2db4f2c3208ac2&dn=Uzodinma+Iweala+-+Speak+No+Evil+-+2018+%28PDF%2C+EPUB%2C+MOBI%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"africa_leak","categoryP":"other","categoryS":"e_books","size":"1893445","seeders":"7","leechers":"5","description":"In the long-anticipated novel from the author of the critically acclaimed Beasts of No Nation, a revelation shared between two privileged teenagers from very different backgrounds sets off a chain of events with devastating consequences.\r\n\r\nOn the surface, Niru leads a charmed life. Raised by two attentive parents in Washington, D.C., he&#x2019;s a top student and a track star at his prestigious private high school. Bound for Harvard in the fall, his prospects are bright. But Niru has a painful secret: he is queer&#x2014;an abominable sin to his conservative Nigerian parents. No one knows except Meredith, his best friend, the daughter of prominent Washington insiders&#x2014;and the one person who seems not to judge him.\r\n\r\nWhen his father accidentally discovers Niru is gay, the fallout is brutal and swift. Coping with troubles of her own, however, Meredith finds that she has little left emotionally to offer him. As the two friends struggle to reconcile their desires against the expectations and institutions that seek to define them, they find themselves speeding toward a future more violent and senseless than they can imagine. Neither will escape unscathed.\r\n\r\nIn the tradition of Junot Diaz&#x2019;s The Brief Wondrous Life of Oscar Wao and Chimamanda Ngozi Adichie&#x2019;s Americanah, Speak No Evil explores what it means to be different in a fundamentally conformist society and how that difference plays out in our inner and outer struggles. It is a novel about the power of words and self-identification, about who gets to speak and who has the power to speak for other people. As heart-wrenching and timely as his breakout debut, Beasts of No Nation, Uzodinma Iweala&#x2019;s second novel cuts to the core of our humanity and leaves us reeling in its wake.\r\n\r\nAvailable in PDF, MOBI and EPUB.\r\n\r\nI have also added a sweet note in the folder. Reach me at africa_leak@protonmail.com\r\n\r\n\r\nFor more African titles consider a small donation to me. My Bitcoin address is 3GgUQ1kCV4PsfyLVARHzYvnsQQ6K3cTFhc","last_updated":"2018-05-07T12:10:20.914Z","parsed":{"xt":"urn:btih:cd3769a43c71c0ea56d6769b2d2db4f2c3208ac2","dn":"Uzodinma Iweala - Speak No Evil - 2018 (PDF, EPUB, MOBI)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cd3769a43c71c0ea56d6769b2d2db4f2c3208ac2","infoHashBuffer":{"type":"Buffer","data":[205,55,105,164,60,113,192,234,86,214,118,155,45,45,180,242,195,32,138,194]},"name":"Uzodinma Iweala - Speak No Evil - 2018 (PDF, EPUB, MOBI)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}