{"title":"GoldWave 6.36 (x64) + Medicine[BabuPC]","magnet":"magnet:?xt=urn:btih:cd84a325a42274d62be4f142ccb63e6912a31f18&dn=GoldWave+6.36+%28x64%29+%2B+Medicine%5BBabuPC%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BabuPC","categoryP":"applications","categoryS":"windows","size":"12393995","seeders":"0","leechers":"0","description":"GoldWave\r\nGoldWave is is a top rated, a comprehensive, affordable, professional quality, digital audio editing software and multitrack audio/video mixing software. The company is named after the GoldWave Digital Audio Editor, which was released in April 1993. The program has continued to improve over the past decade and is considered one of the best available today.\r\nGoldWave is ideal for people who work with audio for CD editing, archive restoration, speech analysis, radio and TV, Java and Web pages, games, or just for fun. You can use it to make everything from elaborate answering machine messages to professional, high quality CD audio content.\r\n\r\nGoldWave can do:\r\n&#x2022; Play, edit, mix, and analyze audio\r\n&#x2022; Record audio from cassettes, vinyl records, radio, etc. through your computer&#x2019;s line-in\r\n&#x2022; Record dictation through a microphone or play dictation back at a slower speed for transcription (with foot pedal control)\r\n&#x2022; Record and edit audio for podcasting or telephone systems\r\n&#x2022; Apply special effects, such as fade, equalizer, doppler, mechanize, echo, reverse, flanger, and more\r\n&#x2022; Digitally remaster and restore old recordings with noise reduction and pop/click filters\r\n&#x2022; Convert files to/from different formats, such as iTunes, wav, wma, mp3, ogg, aiff, au, vox and even raw binary data\r\n&#x2022; Make perfect digital copies of audio CD tracks using the CD Reader tool and save them in wav, wma, mp3, or ogg files\r\n&#x2022; Edit music for dance programs, figure skating, gymnastics\r\n&#x2022; Analyze human speech, bird song, whale song\r\n&#x2022; Demonstrate digital signal processing with filter effects and the Expression Evaluator tool\r\n&#x2022; View a variety of useful real-time visuals and level meters\r\n&#x2022; Expand functionality with plug-ins\r\n&#x2022; Command line processing","last_updated":"2018-11-21T12:10:28.929Z","parsed":{"xt":"urn:btih:cd84a325a42274d62be4f142ccb63e6912a31f18","dn":"GoldWave 6.36 (x64)   Medicine[BabuPC]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cd84a325a42274d62be4f142ccb63e6912a31f18","infoHashBuffer":{"type":"Buffer","data":[205,132,163,37,164,34,116,214,43,228,241,66,204,182,62,105,18,163,31,24]},"name":"GoldWave 6.36 (x64)   Medicine[BabuPC]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}