{"title":"Headstrong: 52 Women Who Changed Science .. by Rachel Swaby EPUB","magnet":"magnet:?xt=urn:btih:cdd24cdd4a0512fcae1510253d8ac32fa87d8f61&dn=Headstrong%3A+52+Women+Who+Changed+Science+..+by+Rachel+Swaby+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5583226","seeders":"50","leechers":"12","description":"xx\r\n\r\nHeadstrong: 52 Women Who Changed Science-and the World by Rachel Swaby EPUB\r\n\r\nFifty-two inspiring and insightful profiles of history&apos;s brightest female scientists.\r\n\r\nIn 2013, the New York Times published an obituary for Yvonne Brill. It began: &quot;She made a mean beef stroganoff, followed her husband from job to job, and took eight years off from work to raise three children.&quot; It wasn&apos;t until the second paragraph that readers discovered why the Times had devoted several hundred words to her life: Brill was a brilliant rocket scientist who invented a propulsion system to keep communications satellites in orbit, and had recently been awarded the National Medal of Technology and Innovation. Among the questions the obituary - and consequent outcry - prompted were, Who are the role models for today&apos;s female scientists, and where can we find the stories that cast them in their true light?\r\n\r\nHeadstrong delivers a powerful, global, and engaging response. Covering Nobel Prize winners and major innovators, as well as lesser-known but hugely significant scientists who influence our every day, Rachel Swaby&apos;s vibrant profiles span centuries of courageous thinkers and illustrate how each one&apos;s ideas developed, from their first moment of scientific engagement through the research and discovery for which they&apos;re best known. This fascinating tour reveals these 52 women at their best - while encouraging and inspiring a new generation of girls to put on their lab coats.\r\n\r\nxx","last_updated":"2018-07-02T12:13:11.074Z","parsed":{"xt":"urn:btih:cdd24cdd4a0512fcae1510253d8ac32fa87d8f61","dn":"Headstrong: 52 Women Who Changed Science .. by Rachel Swaby EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cdd24cdd4a0512fcae1510253d8ac32fa87d8f61","infoHashBuffer":{"type":"Buffer","data":[205,210,76,221,74,5,18,252,174,21,16,37,61,138,195,47,168,125,143,97]},"name":"Headstrong: 52 Women Who Changed Science .. by Rachel Swaby EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}