{"title":"World War Two: A Short History by Norman Stone EPUB","magnet":"magnet:?xt=urn:btih:ce41f53711754e5a2e6f085946b6ab4afc6e0e1f&dn=World+War+Two%3A+A+Short+History+by+Norman+Stone+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1286724","seeders":"30","leechers":"5","description":"xx\r\n\r\nWorld War Two: A Short History by Norman Stone EPUB\r\n\r\nAfter the unprecedented destruction of the Great War, the world longed for a lasting peace. The victors, however, valued vengeance even more than stability and demanded a massive indemnity from Germany in order to keep it from rearming. The results, as eminent historian Norman Stone describes in this authoritative history, were disastrous.\r\n\r\nIn World War Two, Stone provides a remarkably concise account of the deadliest war of human history, showing how the conflict roared to life from the ashes of World War One. Adolf Hitler rode a tide of popular desperation and resentment to power in Germany, promptly making good on his promise to return the nation to its former economic and military strength. He bullied Europe into giving him his way, and in so doing backed the victors of the Great War into a corner.\r\n\r\nFollowing the invasion of Poland in 1939, Britain and France declared war on Germany - a decision that, Stone argues, was utterly irrational. Yet Hitler had driven the world mad, and the rekindling of European hostilities soon grew to a conflagration that spread across the globe, fanned by political and racial ideologies more poisonous - and weaponry more destructive - than the world had ever seen. With commanding expertise, Stone leads readers through the escalation, climax, and mournful denouement of this sprawling conflict.\r\n\r\nWorld War Two is an invaluable contribution to our understanding of the 20th century and its defining struggle.\r\n\r\nxx","last_updated":"2018-05-17T12:07:04.450Z","parsed":{"xt":"urn:btih:ce41f53711754e5a2e6f085946b6ab4afc6e0e1f","dn":"World War Two: A Short History by Norman Stone EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ce41f53711754e5a2e6f085946b6ab4afc6e0e1f","infoHashBuffer":{"type":"Buffer","data":[206,65,245,55,17,117,78,90,46,111,8,89,70,182,171,74,252,110,14,31]},"name":"World War Two: A Short History by Norman Stone EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}