{"title":"Our Crime Was Being Jewish by Anthony S. Pitch EPUB","magnet":"magnet:?xt=urn:btih:ce50285addda63ec2f32259db3deb4eec9d3e88f&dn=Our+Crime+Was+Being+Jewish+by+Anthony+S.+Pitch+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4609380","seeders":"23","leechers":"8","description":"xx\r\n\r\nOur Crime Was Being Jewish by Anthony S. Pitch EPUB\r\n\r\nIn the shouted words of a woman bound for Auschwitz to a man about to escape from a cattle car, &quot;If you get out, maybe you can tell the story! Who else will tell it?&quot;\r\n\r\nOur Crime Was Being Jewish contains 576 vivid memories of 358 Holocaust survivors. These are the true, insider stories of victims, told in their own words. They include the experiences of teenagers who saw their parents and siblings sent to the gas chambers; of starving children beaten for trying to steal a morsel of food; of people who saw their friends commit suicide to save themselves from the daily agony they endured. The recollections are from the start of the war - the home invasions, the Gestapo busts, and the ghettos - as well as the daily hell of the concentration camps and what actually happened inside.\r\n\r\nSix million Jews were killed in the Holocaust, and this hefty collection of stories told by its survivors is one of the most important books of our time. It was compiled by award-winning author Anthony S. Pitch, who worked with sources such as the United States Holocaust Memorial Museum to get survivors&apos; stories compiled together and to supplement them with images from the war. These memories must be told and held on to so what happened is documented; so the lives of those who perished are not forgotten; so history does not repeat itself.\r\n\r\nxx","last_updated":"2018-01-28T12:04:29.783Z","parsed":{"xt":"urn:btih:ce50285addda63ec2f32259db3deb4eec9d3e88f","dn":"Our Crime Was Being Jewish by Anthony S. Pitch EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ce50285addda63ec2f32259db3deb4eec9d3e88f","infoHashBuffer":{"type":"Buffer","data":[206,80,40,90,221,218,99,236,47,50,37,157,179,222,180,238,201,211,232,143]},"name":"Our Crime Was Being Jewish by Anthony S. Pitch EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}