{"title":"Claiming My Place by Planaria Price EPUB","magnet":"magnet:?xt=urn:btih:ce5e8d06fad0b344ab65263fe4d2cd43c29efcb5&dn=Claiming+My+Place+by+Planaria+Price+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"22442207","seeders":"0","leechers":"0","description":"xx\r\n\r\nClaiming My Place: Coming of Age in the Shadow of the Holocaust by Planaria Price EPUB\r\n\r\nA Junior Library Guild selection \r\n\r\nClaiming My Place is the true story of a young Jewish woman who survived the Holocaust by escaping to Nazi Germany and hiding in plain sight. \r\n\r\nMeet Barbara Reichmann, once known as Gucia Gomolinska: smart, determined, independent, and steadfast in the face of injustice. A Jew growing up in predominantly Catholic Poland during the 1920s and &#x2019;30s, Gucia studies hard, makes friends, falls in love, and dreams of a bright future. Her world is turned upside down when Nazis invade Poland and establish the first Jewish ghetto of World War II in her town of Piotrko&#xB4;w Trybunalski. \r\n\r\nAs the war escalates, Gucia and her family, friends, and neighbors suffer starvation, disease, and worse. She knows her blond hair and fair skin give her an advantage, and eventually she faces a harrowing choice: risk either the uncertain horrors of deportation to a concentration camp or certain death if she is caught resisting. She decides to hide her identity as a Jew and adopts the gentile name Danuta Barbara Tanska. Barbara, nicknamed Basia, leaves behind everything and everyone she has ever known in order to claim a new life for herself. \r\n\r\nWriting in the first person, author Planaria Price brings the immediacy of Barbara&#x2019;s voice to this true account of a young woman whose unlikely survival hinges upon the same determination and defiant spirit already evident in the six-year-old girl we meet as this story begins. The final portion of this narrative, written by Barbara&#x2019;s daughter, Helen Reichmann West, completes Barbara&#x2019;s journey from her immigration to America until her natural, timely death.\r\n\r\nxx","last_updated":"2018-09-16T12:15:23.727Z","parsed":{"xt":"urn:btih:ce5e8d06fad0b344ab65263fe4d2cd43c29efcb5","dn":"Claiming My Place by Planaria Price EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ce5e8d06fad0b344ab65263fe4d2cd43c29efcb5","infoHashBuffer":{"type":"Buffer","data":[206,94,141,6,250,208,179,68,171,101,38,63,228,210,205,67,194,158,252,181]},"name":"Claiming My Place by Planaria Price EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}