{"title":"Rescue Board by Rebecca Erbelding EPUB","magnet":"magnet:?xt=urn:btih:ceef64314ce622d5c132a2cf71f58604b9f69b2e&dn=Rescue+Board+by+Rebecca+Erbelding+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"28503087","seeders":"0","leechers":"0","description":"xx\r\n\r\nRescue Board by Rebecca Erbelding EPUB\r\n\r\nAmerica has long been criticized for refusing to give harbor to the Jews of Europe as Hitler and the Nazis closed in. Now, a US Holocaust Museum scholar tells the extraordinary story of the War Refugee Board, President Roosevelt&apos;s little-known effort late in the war to save the Jews who remained.\r\n\r\nIn January 1944, a young Treasury lawyer named John Pehle accompanied his boss to a meeting with the president. For more than a decade, the Jews of Germany had sought refuge in the US and been stymied by Congress&apos;s harsh immigration policy. Now, the State Department was refusing to authorize relief funds Pehle wanted to use to help Jews escape Nazi territory. At the meeting, Pehle made his best case - and prevailed. Within days, FDR created the War Refugee Board, empowering it to rescue the victims of Nazi persecution, and put John Pehle in charge.\r\n\r\nOver the next 20 months, Pehle pulled together a team of DC pencil pushers, international relief workers, pirates, diplomats, millionaires, confidence men, and rabble-rousers to run operations across four continents and a dozen countries. Together, they tricked Nazis; forged identity papers; smuggled food into concentration camps; recruited spies; leaked news stories; negotiated ransoms; and funneled millions of dollars into Europe. They bought weapons for the French Resistance and ships to transport Romanian refugees to Palestine. Altogether, they saved tens of thousands of lives.\r\n\r\nIn Rescue Board, US Holocaust Memorial Museum scholar Rebecca Erbelding uses unrivaled access to archival materials and fresh interviews with survivors to tell the dramatic unknown story of America&apos;s last-ditch effort to save the Jews of Europe.\r\n\r\nxx","last_updated":"2018-04-30T12:00:50.458Z","parsed":{"xt":"urn:btih:ceef64314ce622d5c132a2cf71f58604b9f69b2e","dn":"Rescue Board by Rebecca Erbelding EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ceef64314ce622d5c132a2cf71f58604b9f69b2e","infoHashBuffer":{"type":"Buffer","data":[206,239,100,49,76,230,34,213,193,50,162,207,113,245,134,4,185,246,155,46]},"name":"Rescue Board by Rebecca Erbelding EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}