{"title":"Bunch of Amateurs by Jack Hitt EPUB","magnet":"magnet:?xt=urn:btih:cfc396a2bf5c85b2b226f3a5d2a8c793bd89522a&dn=Bunch+of+Amateurs+by+Jack+Hitt+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2423466","seeders":"0","leechers":"1","description":"xx\r\n\r\nBunch of Amateurs by Jack Hitt EPUB\r\n\r\nWhat is it that drives the success of America and the identity of its people? Acclaimed writer and contributing editor to This America Life Jack Hitt thinks it&#x2019;s because we&#x2019;re all a bunch of amateurs.\r\n\r\nAmerica&#x2019;s self-invented tinkerers are back at it in their metaphorical garages - fiddling with everything from solar-powered cars to space elevators. In Bunch of Amateurs, Jack Hitt visits a number of different garages and has written a fascinating book that looks at America&#x2019;s current batch of amateurs and their pursuits. From a tattooed young woman in the Bay Area trying to splice a fish&#x2019;s glow-in-the-dark gene into common yogurt (all done in her kitchen using salad spinners) to a space fanatic on the brink of developing the next generation of telescopes from his mobile home, Hitt not only tells the stories of people in the grip of a passion but argues that America&#x2019;s history is bound up in a cycle of amateur surges.\r\n\r\nBeginning with Ben Franklin&#x2019;s kite and leading all the way to the current TV hit American Idol, Hitt argues that the nation&#x2019;s love of self-invented obsessives has always driven the country to rediscover the true heart of the American dream. Amateur pursuits are typically lamented as a world that just passed until a Sergey Brin or Mark Zuckerberg steps out of his garage (or dorm room) with the rare but crucial success story. In Bunch of Amateurs, Hitt argues that America is now poised to pioneer at another frontier that will lead, one more time, to the newest version of the American dream.\r\n\r\nxx","last_updated":"2018-06-05T12:01:13.302Z","parsed":{"xt":"urn:btih:cfc396a2bf5c85b2b226f3a5d2a8c793bd89522a","dn":"Bunch of Amateurs by Jack Hitt EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cfc396a2bf5c85b2b226f3a5d2a8c793bd89522a","infoHashBuffer":{"type":"Buffer","data":[207,195,150,162,191,92,133,178,178,38,243,165,210,168,199,147,189,137,82,42]},"name":"Bunch of Amateurs by Jack Hitt EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}