{"title":"Aetherial Worlds: Stories by Tatyana Tolstaya EPUB","magnet":"magnet:?xt=urn:btih:cfd7415fe69fef99efaaa217fb6a015290fa8cd8&dn=Aetherial+Worlds%3A+Stories+by+Tatyana+Tolstaya+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5436989","seeders":"0","leechers":"0","description":"xx\r\n\r\nAetherial Worlds: Stories by Tatyana Tolstaya EPUB\r\n\r\nFrom one of modern Russia&apos;s finest writers, a spellbinding collection of 18 stories, her first to be translated into English in more than 20 years.\r\n\r\nOrdinary realities and yearnings to transcend them lead to miraculous other worlds in this dazzling collection of stories. A woman&apos;s deceased father appears in her dreams with clues about the afterlife; a Russian professor in a small American town constructs elaborate fantasies during her cigarette break; a man falls in love with a marble statue as his marriage falls apart; a child glimpses heaven through a stained-glass window. With the emotional insight of Chekhov, the surreal satire of Gogol, and a unique blend of humor and poetry all her own, Tolstaya transmutes the quotidian into aetherial alternatives.\r\n\r\nThese tales, about politics, identity, love, and loss, cut to the core of the Russian psyche, even as they lay bare human universals. Tolstaya&apos;s characters - seekers all - are daydreaming children, lonely adults, dislocated foreigners in unfamiliar lands. Whether contemplating the strategic complexities of delivering telegrams in Leningrad or the meditative melancholy of holiday aspic, vibrant inner lives and the grim elements of existence are registered in equally sharp detail in a starkly bleak but sympathetic vision of life on Earth.\r\n\r\nA unique collection from one of the first women in years to rank among Russia&apos;s most important writers.\r\n\r\nxx","last_updated":"2018-04-24T12:07:42.841Z","parsed":{"xt":"urn:btih:cfd7415fe69fef99efaaa217fb6a015290fa8cd8","dn":"Aetherial Worlds: Stories by Tatyana Tolstaya EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cfd7415fe69fef99efaaa217fb6a015290fa8cd8","infoHashBuffer":{"type":"Buffer","data":[207,215,65,95,230,159,239,153,239,170,162,23,251,106,1,82,144,250,140,216]},"name":"Aetherial Worlds: Stories by Tatyana Tolstaya EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}