{"title":"Who is Running America? The Bankruptcy of America, the Corporate","magnet":"magnet:?xt=urn:btih:d004ffa3e64705559542e284da6b0797007622d3&dn=Who+is+Running+America%3F+The+Bankruptcy+of+America%2C+the+Corporate&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"roflcopter2110","categoryP":"other","categoryS":"e_books","size":"451572","seeders":"0","leechers":"0","description":"Who is Running America? The Bankruptcy of America, the Corporate United States and the New World Order (pdf) - roflcopter2110\r\n <a href=\"\nhttps://extraimage.net/images/2018/01/28/19670c40353e817d4cba3e1b9cb0c9e7.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://extraimage.net/images/2018/01/28/19670c40353e817d4cba3e1b9cb0c9e7.jpg</a>\r\n\r\nEXCERPTS\r\nPage 4\r\nThe Independent Treasury Act of 1920 suspended the de jure (meaning &quot;by right of legal establishment&quot;) Treasury Department of the United States government.\r\n\r\nOur Congress turned the treasury department over to a private corporation, which when seen in its true light is a fascist monopolistic cartel - the Federal Reserve and their agents.\r\n\r\nPage 5\r\nThe Federal Reserve is at the root of most of our present statutory regulations, &quot;laws&quot;, in the control an d regulation of virtually all aspects of human activity in the United States, through successively socialistic constructions laid upon the Commerce clause of the Constitution.\r\n\r\nPage 6\r\nThe Federal Register Act was created by Pres. Roosevelt in 1935. Title 3 Sec. 301 et seq. by Executive Order.\r\n\r\nHe gave himself the power to create federal agencies and appoint a head of the agency.\r\n\r\nHe then re-delegated his authority to make law (statutory regulations) to those agency heads.\r\n\r\nOne big problem there, the president has no constitutional authority to make law.\r\n\r\nUnder the Constitution re-delegation of delegated authority is a felony breach. \r\n\r\nPage 13\r\nThe Uniform Commercial Code (UCC), has been adopted in whole or substantially by all states. (See: Blacks Law, 6th Ed. pg. 1531)\r\n\r\nIn essence, all court decisions are based on commercial law or business law and has criminal penalties associated with it.\r\n\r\nRather than openly calling this new law Admiralty/Maritime Jurisdiction, it is called Statutory Jurisdiction. \r\n\r\nPage 18\r\nThere is a terrible FRAUD being perpetrated on all Americans.\r\n\r\nPlease understand that this fraud is a 24 hour, 7 days a week, year after year continuous fraud.\r\n\r\nThis fraud is constantly upon you all your life.\r\n\r\nIt doesn&apos;t just happen once in a while.\r\n\r\nThis fraud is perpetually and incessantly upon you and your family","last_updated":"2018-01-28T12:07:14.570Z","parsed":{"xt":"urn:btih:d004ffa3e64705559542e284da6b0797007622d3","dn":"Who is Running America? The Bankruptcy of America, the Corporate","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d004ffa3e64705559542e284da6b0797007622d3","infoHashBuffer":{"type":"Buffer","data":[208,4,255,163,230,71,5,85,149,66,226,132,218,107,7,151,0,118,34,211]},"name":"Who is Running America? The Bankruptcy of America, the Corporate","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}