{"title":"Walls: A History of Civilization in Blood and Brick","magnet":"magnet:?xt=urn:btih:d04a2255f168de5f6d470027cd9b7c77aad48c3b&dn=Walls%3A+A+History+of+Civilization+in+Blood+and+Brick&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"8616353","seeders":"0","leechers":"0","description":"Walls: A History of Civilization in Blood and Brick - David Frye [epub]\r\n\r\nWith Frye as our raconteur-guide, we journey back to a time before barriers of brick and stone even existed&#x2014;to an era in which nomadic tribes vied for scarce resources, and each man was bred to a life of struggle. Ultimately, those same men would create edifices of mud, brick, and stone, and with them effectively divide humanity: on one side were those the walls protected; on the other, those the walls kept out.\r\n\r\nThe stars of this narrative are the walls themselves&#x2014;rising up in places as ancient and exotic as Mesopotamia, Babylon, Greece, China, Rome, Mongolia, Afghanistan, the lower Mississippi and even Central America. As we journey across time and place, we discover a hidden, thousand-mile-long wall in Asia&#x2019;s steppes; learn of bizarre Spartan rituals; watch Mongol chieftains lead their miles-long hordes; witness the epic siege of Constantinople; chill at the fate of French explorers; marvel at the folly of the Maginot Line; tense at the gathering crisis in Cold War Berlin; gape at Hollywood&#x2019;s gated royalty; and contemplate the wall mania of our own era.\r\n\r\nA masterpiece of historical recovery and preeminent storytelling, Walls is alternately evocative, amusing, chilling, and deeply insightful as it gradually reveals the startling ways that barriers have affected our psyches. The questions this book summons are both intriguing and profound: Did walls make civilization possible? And can we live without them?\r\n\r\nDavid Frye received his PhD from Duke University and currently teaches ancient and medieval history at Eastern Connecticut State University. The author of Walls, he has participated in several international archeological digs and has contributed to Military History, MHQ, Archeological Odyssey, and McSweeney&apos;s.\r\n\r\nPrint Length: 304 pages\r\nPublisher: Scribner (August 21, 2018)","last_updated":"2018-09-22T12:35:20.682Z","parsed":{"xt":"urn:btih:d04a2255f168de5f6d470027cd9b7c77aad48c3b","dn":"Walls: A History of Civilization in Blood and Brick","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d04a2255f168de5f6d470027cd9b7c77aad48c3b","infoHashBuffer":{"type":"Buffer","data":[208,74,34,85,241,104,222,95,109,71,0,39,205,155,124,119,170,212,140,59]},"name":"Walls: A History of Civilization in Blood and Brick","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}