{"title":"Udemy - ADHD: 30 Days To The Life You Deserve","magnet":"magnet:?xt=urn:btih:d12fa68d412febd913d488f8c0f2d1017bf463a8&dn=Udemy+-+ADHD%3A+30+Days+To+The+Life+You+Deserve&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"tuts756","categoryP":"other","categoryS":"other","size":"2618503097","seeders":"8","leechers":"23","description":"Description\r\nThis is a 30 day Makeover course not for how you look, but for your ADHD. This exciting course is led by award-winning psychotherapist, international speaker, and human guinea pig Alina Kislenko MA RP, who has ADHD &amp; ASD herself and who specializes in it at her counselling centre. Though often seen as a curse, ADHD can be a HUGE gift that comes with, wait for it, SUPERPOWERS. And not dinky ones that aren&#x2019;t real, but serious powers of hyperfocus and specialization that explains why ADHDers are the industry leaders in SO MANY fields, from the Olympics (Michael Phelps &amp; Simone Biles) to hollywood (Will Smith &amp; Mary-Kate Olsen) to entrepreneurialism (Sir Richard Branson &amp; Charles Schwab). In this course, you&#x2019;ll unleash those powers and entirely change your relationship with your ADHD, your brain, and, not exaggerating, your life in general!\r\nThis is not your usual ADHD class. Sure, you&#x2019;ll learn cool bits about your brain and some tips and tricks on how to work with your learning needs, but, above all else, this is a lifestyle design course with ADHD always front of mind. Because one of the biggest elements that research shows makes or breaks an ADHDer is their environment, from their love life, to their friends, to their work, to their home. EVERYTHING needs to be on purpose, with everything from how you process info, to how often you hang out with people, to the colours you paint your walls &#x2013; you need to find your own unique way of doing everything so that your ADHD superpowers can break through all the monotony that keeps your abilities typing you in knots.\r\n\r\nWho is the target audience?\r\n    Adults or Teens with ADHD\r\n    Parents of ADHDers\r\n    Partners of those with ADHD\r\n    Practitioners working with ADHD\r\nRequirements\r\n    You should be able to use a PC at a beginner level","last_updated":"2018-07-07T12:07:27.098Z","parsed":{"xt":"urn:btih:d12fa68d412febd913d488f8c0f2d1017bf463a8","dn":"Udemy - ADHD: 30 Days To The Life You Deserve","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d12fa68d412febd913d488f8c0f2d1017bf463a8","infoHashBuffer":{"type":"Buffer","data":[209,47,166,141,65,47,235,217,19,212,136,248,192,242,209,1,123,244,99,168]},"name":"Udemy - ADHD: 30 Days To The Life You Deserve","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}