{"title":"Son Of A Bitch v0.25 ENGLISH VERSION NEW UPDATE","magnet":"magnet:?xt=urn:btih:d1a6c2a32491f1b23c62f76011e3dd7b8cb2ec36&dn=Son+Of+A+Bitch+v0.25+ENGLISH+VERSION+NEW+UPDATE&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Hvonderbank","categoryP":"porn","categoryS":"games","size":"10087006282","seeders":"0","leechers":"0","description":"v0.25\r\nIt is small but there are many corrections and corrections. There were new locations in the university and a new gift for the little guy :) + a new card for the Persian and its module, the other smaller changes, but still important will be written in the detailed list below.\r\n\r\nAlyona\r\nThe love branch gets a continuation, the English teacher has already specifically settled on our Serega, so we need to develop success and enjoy all the benefits of the current situation, of course, of course.\r\n\r\nAntonina\r\nHot Madame has not appeared in the game for a long time, go along her love branch to get a sequel. In her house, inevitable things happen, she is already sitting firmly on Serega, but do not relax, there will be a little more trick to discover new horizons :)\r\n\r\nMarina\r\nBlonde starts up in all serious of course, not without the help of our hero, to see the continuation with it, it is impossible that she flew, otherwise kaput. A lot of moves plus in this update the Persians will be linked together during the passage.\r\n\r\nDasha\r\nThis proprietress can not be out of the way in the current hands, she was not very happy to share Serega with someone else before. But time passes and as they say, change or die! So she has nowhere to go. I think that you already understood that the last three Persians are closely related :)\r\n\r\nFira\r\nGuess who it is! Do not be afraid, this is not a new Persian: D It was just decided to change the name of Mai, to Fira, because the game already has a similar name for the telochki from the senior courses of the University. Fira gets its start, card, module and schedule. From this it is almost possible to understand what kind of character she is. Since the next semantic layer with her weighty, he did not get into this update, but with her there will be a sequel immediately in the next update.\r\n\r\nDasha and Masha&apos;s Neighbors\r\nThese are, in appearance, simple calves, not so simple already! Sorry for the pun :) We get a direct sequel with them, so we&apos;ll see if they can fuck Serega or not. Moving is attached, although it is all in this update except for Fira. PY.SY can be preserved before passing a neighbor :)\r\n\r\nAs always, briefly and almost without spoilers, the stuffed post is on a fast hand, as you noticed the update came out quickly though and was late for a few hours from the scheduled, now it&apos;s Monday night, but I believe that a few hours is not a scary, enjoyable game!","last_updated":"2018-10-14T12:09:23.349Z","parsed":{"xt":"urn:btih:d1a6c2a32491f1b23c62f76011e3dd7b8cb2ec36","dn":"Son Of A Bitch v0.25 ENGLISH VERSION NEW UPDATE","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d1a6c2a32491f1b23c62f76011e3dd7b8cb2ec36","infoHashBuffer":{"type":"Buffer","data":[209,166,194,163,36,145,241,178,60,98,247,96,17,227,221,123,140,178,236,54]},"name":"Son Of A Bitch v0.25 ENGLISH VERSION NEW UPDATE","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}