{"title":"Happiness by Aminatta Forna EPUB","magnet":"magnet:?xt=urn:btih:d1a968ece1af06331872de7220fbedbca69441aa&dn=Happiness+by+Aminatta+Forna+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2675263","seeders":"0","leechers":"0","description":"xx\r\n\r\nHappiness by Aminatta Forna EPUB\r\n\r\nFrom award-winning writer Aminatta Forna, a stunning novel bringing an American scientist and a Ghanaian psychologist together in London in a hunt for a missing boy - and an expansive, subtle tale of loss, hope, love, compassion, culture, and the true meaning of happiness.\r\n\r\nLondon. A fox makes its way across Waterloo Bridge. The distraction causes two pedestrians to collide - Jean, an American studying the habits of urban foxes, and Attila, a Ghanaian psychiatrist there to deliver a keynote speech. From this chance encounter, Aminatta Forna&apos;s unerring powers of observation show how in the midst of the rush of a great city lie numerous moments of connection.\r\n\r\nAttila has arrived in London with two tasks: to deliver a keynote speech on trauma, as he has done many times before; and to contact the daughter of friends, his &quot;niece&quot; who hasn&apos;t called home in a while. Ama has been swept up in an immigration crackdown, and now her young son Tano is missing. \r\n\r\nWhen, by chance, Attila runs into Jean again, she mobilizes the network of rubbish men she uses as volunteer fox spotters. Security guards, hotel doormen, traffic wardens - mainly West African immigrants who work the myriad streets of London - come together to help. As the search for Tano continues, a deepening friendship between Attila and Jean unfolds.\r\n\r\nMeanwhile a consulting case causes Attila to question the impact of his own ideas on trauma, the values of the society he finds himself in, and a grief of his own. In this delicate tale of love and loss, of cruelty and kindness, Forna asks us to consider the interconnectedness of lives, our co-existence with one another and all living creatures, and the true nature of happiness.\r\n\r\nxx","last_updated":"2018-06-05T12:01:26.001Z","parsed":{"xt":"urn:btih:d1a968ece1af06331872de7220fbedbca69441aa","dn":"Happiness by Aminatta Forna EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d1a968ece1af06331872de7220fbedbca69441aa","infoHashBuffer":{"type":"Buffer","data":[209,169,104,236,225,175,6,51,24,114,222,114,32,251,237,188,166,148,65,170]},"name":"Happiness by Aminatta Forna EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}