{"title":"Classic Rock UK - December 2018 (gnv64)","magnet":"magnet:?xt=urn:btih:d1c0b6f35f3f205ac1a5ce231f174789d7dcb9b7&dn=Classic+Rock+UK+-+December+2018+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"39736085","seeders":"9","leechers":"3","description":"Classic Rock UK - December 2018\r\nEnglish | 124 pages | True PDF | 37.6 mb\r\n\r\nFeatures\r\n26 Eagles - It looked like it really was all over when America&#x2019;s biggest-ever band called time after the death of Glenn Frey in 2016. Now they&#x2019;re back, and an American dream continues.\r\n36 Geddy Lee - Away from the spotlight he&#x2019;s a family man, a serious collector &#x2013; wine, basses, baseballs &#x2013; and, most recently, an author. The Rush bassist/vocalist opens up in The Classic Rock Interview.\r\n46 Angry Anderson - A small man with a big voice, the latter-day politician is fronting a reboot of Rose Tattoo. And yes, he&#x2019;s still angry.\r\n50 Jimi Hendrix - As his landmark album Electric Ladyland celebrates its 50th anniversary, we look at what made him the first true star of a very &#x2018;white&#x2019; scene.\r\n54 Bon Jovi - The Jersey Syndicate tour of 1988/89 consolidated their status as one of the biggest bands in the world. It also took them perilously close to breaking point.\r\n64 Roy Buchanan - He inspired the likes of Jeff Beck, Gary Moore and Joe Bonamassa, said no to the Stones, suffered a life of addiction, died a bluesman&#x2019;s death and became a cult icon.\r\n68 Creedence Clearwater Revival - How inflated egos, brotherly hate, bitter feuds, financial ruin and tragic death brought down one of the most successful bands of their era.\r\n72 Black Stone Cherry/ The Cadillac Three/ Monster Truck - We head to Nashville to catch up with all three bands ahead of their UK tour together in December.\r\n\r\nRegulars\r\n10 The Dirt - Def Leppard up for the Hall Of Fame and headline next year&#x2019;s Download; Scorpions and Foreigner also headliners at next summer&#x2019;s festivals; Fleetwood Mac tell Lindsey Buckingham: &#x201C;See you in court&#x201D;; Nick Mason, Roger Taylor and Sting among artists warning Theresa May over Brexit&#x2026; Welcome back Kristin Hersh, Angel and Electric Boys &#x2026; Say hello to Northward and Goodbye June, say goodbye to Marty Balin, Otis Rush, Geoff Emerick, Andie Airfix&#x2026;\r\n17 Raw Power - We pluck a Warwick Thumb NT seven-string custom bass &#x2013; an instrument that&#x2019;s almost impossible to play.\r\n22 The Stories Behind The Songs - UFO Doctor Doctor became a live favourite, and the live version that gave the band their signature song and biggest hit.\r\n24 Q&amp;A - Ronnie Wood The Rolling Stone recalls the groundbreaking US guitarists who shook 60s London.\r\n\r\nand more.....\r\n <a href=\"\nhttps://i.postimg.cc/2ydrsbyd/Classic-Rock-UK-December-2018.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://i.postimg.cc/2ydrsbyd/Classic-Rock-UK-December-2018.jpg</a>","last_updated":"2018-11-14T12:23:01.205Z","parsed":{"xt":"urn:btih:d1c0b6f35f3f205ac1a5ce231f174789d7dcb9b7","dn":"Classic Rock UK - December 2018 (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d1c0b6f35f3f205ac1a5ce231f174789d7dcb9b7","infoHashBuffer":{"type":"Buffer","data":[209,192,182,243,95,63,32,90,193,165,206,35,31,23,71,137,215,220,185,183]},"name":"Classic Rock UK - December 2018 (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}