{"title":"The Road Home by Ethan Nichtern EPUB","magnet":"magnet:?xt=urn:btih:d21c95a71a8e8f33efca090a897d31e7da765ca1&dn=The+Road+Home+by+Ethan+Nichtern+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"944344","seeders":"27","leechers":"4","description":"xx\r\n\r\nThe Road Home by Ethan Nichtern EPUB\r\n\r\nA lively exploration of contemporary Buddhism from one of its most admired teachers.\r\n\r\nDo you feel at home right now? Or do you sense a hovering anxiety or uncertainty, an underlying unease that makes you feel just a bit uncomfortable, a bit distracted and disconnected from those around you? In The Road Home, Ethan Nichtern, a senior teacher in the Shambhala Buddhist tradition, investigates the journey each of us takes to find where we belong. Drawing from contemporary research on meditation and mindfulness and his experience as a Buddhist teacher and practitioner, Nichtern describes in fresh and deeply resonant terms the basic existential experience that gives rise to spiritual seeking - and to its potentially dangerous counterpart, spiritual materialism.\r\n\r\nHe reveals how our individual quests for self-awareness ripple forward into relationships, communities, and society at large. And he explains exactly how, by turning our awareness to what&apos;s happening around us and inside us, we become able to enhance our sense of connection with others and, at the same time, change for the better our individual and collective patterns of greed, apathy, and inattention.\r\n\r\nIn this wise and witty invitation to Buddhist meditation, Nichtern shows how, in order to create a truly compassionate and enlightened society, we must start with ourselves. And this means beginning by working with our own minds - in whatever state we find them.\r\n\r\nxx","last_updated":"2018-06-17T12:05:27.343Z","parsed":{"xt":"urn:btih:d21c95a71a8e8f33efca090a897d31e7da765ca1","dn":"The Road Home by Ethan Nichtern EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d21c95a71a8e8f33efca090a897d31e7da765ca1","infoHashBuffer":{"type":"Buffer","data":[210,28,149,167,26,142,143,51,239,202,9,10,137,125,49,231,218,118,92,161]},"name":"The Road Home by Ethan Nichtern EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}