{"title":"A Short History of the Universe","magnet":"magnet:?xt=urn:btih:d262b6a396690fb9e177002f66330dd39c536d1e&dn=A+Short+History+of+the+Universe&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"bookflare","categoryP":"other","categoryS":"e_books","size":"41952170","seeders":"0","leechers":"0","description":"Description\r\nIn A Short History of the Universe, Joseph Silk, a highly respected theorist, describes how cosmologists are the archaeologists of the universe: from relics of the past still visible today, they have reconstructed plausible theories of the evolution of the cosmos. The book is extraordinarily broad in scope, encompassing the history of the universe from the moment of the big bang to the present. Rather than concentrating only on the first few minutes of time, or on a narrow range of cosmological phenomena, Silk covers the spectrum of scientific knowledge and discovery and details the great controversies in cosmology in this century.\r\nSilk presents all aspects of cosmology, from the infinitesimal to the vast. He describes how physicists apply their theories of the tiniest bits of matter to re-create the first moments of the big bang, and how astronomers map huge reaches of the universe to understand the later creation of galaxies and clusters of galaxies. He offers a clear exposition of the Friedmann-Lemaitre equation, which accounts for the effect of gravity on the expansion of the universe, provides a full, modern account of the big bang theory, and explains the crucial and much-publicized discovery of fluctuations in the cosmic background radiation that corroborates it. He also brings the reader up to date on the search for the mysterious &#x201C;dark matter&#x201D; that will determine the ultimate fate of the universe","last_updated":"2018-08-16T12:03:11.780Z","parsed":{"xt":"urn:btih:d262b6a396690fb9e177002f66330dd39c536d1e","dn":"A Short History of the Universe","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d262b6a396690fb9e177002f66330dd39c536d1e","infoHashBuffer":{"type":"Buffer","data":[210,98,182,163,150,105,15,185,225,119,0,47,102,51,13,211,156,83,109,30]},"name":"A Short History of the Universe","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}