{"title":"The Relic Master by Christopher Buckley EPUB","magnet":"magnet:?xt=urn:btih:d29a6fa25c75c7fafb333a00d797ba910fb8be24&dn=The+Relic+Master+by+Christopher+Buckley+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5292118","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Relic Master by Christopher Buckley EPUB\r\n\r\nFrom New York Times best-selling author Christopher Buckley, &quot;one of the funniest writers in the English language&quot; (Tom Wolfe), a compelling and hilarious adventure featuring a 16th-century relic hunter and his best friend, Albrecht D&#xFC;rer, who conspire to forge the Shroud of Turin.\r\n\r\nThe year is 1517. Dismas is a relic hunter: one who procures &quot;authentic&quot; religious relics for wealthy and influential clients. His two most important patrons are Frederick the Wise, elector of Saxony; and soon-to-be Cardinal Albrecht of Mainz. While Frederick is drawn to the recent writing of Martin Luther, Albrecht pursues the financial and political benefits of religion and seeks to buy a cardinalship through the selling of indulgences. When Albrecht&apos;s ambitions increase his demands for grander and more marketable relics, Dismas and his artist friend, D&#xFC;rer, conspire to manufacture a shroud to sell to the unsuspecting noble. Unfortunately D&#xFC;rer&apos;s reckless pride exposes Albrecht&apos;s newly acquired shroud as a fake, so Albrecht puts Dismas and D&#xFC;rer in the custody of four loutish mercenaries and sends them all to steal Christ&apos;s burial cloth (the Shroud of Chamb&#xE9;ry), Europe&apos;s most celebrated relic.\r\n\r\nOn their journey to Savoy, where the Shroud will be displayed, they battle a lustful count and are joined by a beautiful female apothecary. It is only when they reach their destination that they realize they are not alone in their intentions to acquire a relic of dubious legitimacy. Filled with fascinating details about art, religion, politics, and science; Vatican intrigue; and Buckley&apos;s signature wit, The Relic Master is a delightfully rich and intelligent comic adventure.\r\n\r\nxx","last_updated":"2018-04-11T15:21:52.222Z","parsed":{"xt":"urn:btih:d29a6fa25c75c7fafb333a00d797ba910fb8be24","dn":"The Relic Master by Christopher Buckley EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d29a6fa25c75c7fafb333a00d797ba910fb8be24","infoHashBuffer":{"type":"Buffer","data":[210,154,111,162,92,117,199,250,251,51,58,0,215,151,186,145,15,184,190,36]},"name":"The Relic Master by Christopher Buckley EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}