{"title":"DIY Bluetooth Phone Controlled BB-8 Droid with Arduino","magnet":"magnet:?xt=urn:btih:d3a449e5d6881216819240d7514100a56ba47d4d&dn=DIY+Bluetooth+Phone+Controlled+BB-8+Droid+with+Arduino&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"tuts756","categoryP":"other","categoryS":"other","size":"247244644","seeders":"0","leechers":"0","description":"Description\r\n\r\nArduino is one of the cost effective boards you can purchase &amp; start programming with to interact with physical elements using logic &amp; create results the way you want it. It can be used in your Engineering Projects, Industrial Projects, and Home Automation related projects.The course lesson will explain you, &#x201C;How to work on your own DIY Bluetooth Phone Controlled BB-8 Droid with Arduino Mega&#x201D; using Arduino programming language. This course works best for you if you own an Arduino UNO and Arduino Mega.This course is for anyone who is interested in building functional BB-8 droid robot to control remotely via mobile application with Arduino boards. And also you will learn to play the music using SD card adapter module. The course requires basic knowledge of Arduino programming language. It is designed to introduce the Arduino hardware and programming environment to get you started on building projects.\r\n\r\nThis BB-8 model can control with a smartphone using an application downloaded from the Play Store and App Store, for both the devices. It can be controlled even with voice commands using Android application.\r\n\r\nI will also teach you how to configure the Bluetooth and SD card modules, and you can control it wirelessly. If you are a technology enthusiast and want to learn the cutting-edge technology, then this is the right course for you.I will guide you step by step how to go about building this project. I will also share the source code with you so that you can replicate the project by yourself.\r\nWho is the target audience?\r\n\r\n    People who want to try Arduino and learn more about micro-controllers\r\n    Makers who have an existing intermediate or better understanding of electronics\r\n    Engineering Students &#x2013; Electronics, Electrical &amp; Computer Science\r\n    Electronic Geeks, Hobbiest &amp; Art Students\r\n    High School Science Students\r\n\r\nRequirements\r\n\r\n    A basic understanding of electricity and electronics\r\n    A hands-on projects-based approach with step by step instructions will be used to build BB-8 Droid to control Wireless using mobile application\r\n    All theory will be explained so you understand all aspects of a project and how/why it works\r\n    Line-By-Line Code Reviews so you will understand exactly how the software and hardware play together in a project\r\n    1 x Arduino UNO, 1 x Arduino Mega, 1 x HC-06 bluetooth module, 1 x Mini speaker\r\n    3 x DC gear motors, 1 x SD card adapter module, 1 x SD card, Lithium-Ion Batteries\r\n    1 x Hamster ball, 1 x Plastic Globe, Screws and Zip Ties, Acrylic sheets, Magnets\r\n    Essential tools: Jumper wires, Multi meter, Soldering iron, Wire cutter, Glue gun, Screw Terminals","last_updated":"2018-03-25T12:14:21.465Z","parsed":{"xt":"urn:btih:d3a449e5d6881216819240d7514100a56ba47d4d","dn":"DIY Bluetooth Phone Controlled BB-8 Droid with Arduino","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d3a449e5d6881216819240d7514100a56ba47d4d","infoHashBuffer":{"type":"Buffer","data":[211,164,73,229,214,136,18,22,129,146,64,215,81,65,0,165,107,164,125,77]},"name":"DIY Bluetooth Phone Controlled BB-8 Droid with Arduino","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}