{"title":"A Killing for Christ, 50th Anniversary Ed. by Pete Hamill EPUB","magnet":"magnet:?xt=urn:btih:d49d1edfb5eb3c82e15d2aa8cbc0b8de8bafc76b&dn=A+Killing+for+Christ%2C+50th+Anniversary+Ed.+by+Pete+Hamill+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2283429","seeders":"0","leechers":"0","description":"xx\r\n\r\nA Killing for Christ, 50th Anniversary Ed. by Pete Hamill EPUB\r\n\r\nRome. Holy Thursday. A limousine carrying two pilgrims speeds toward the city. Rail, an American publisher, an obese voluptuary, perspires in the heat and shivers with the icy premonition of death. His companion, Harwell, is running a cold fever of bigotry and violence, self-indulgence, and sadism: He is an American Nazi. The two must separate soon, must not be seen together, for they are to be the instruments of a public murder.\r\n\r\nRail meets Father Malloy, who is to show him around the city. Malloy had been a chaplain in Vietnam, and he had seen too many people die. He is not aware of the murder Rail carries with him. This is to be a murder of world-shaking consequence. It is a plot on a grand scale, conceived by men of secret power: a sin-crazed, aging cardinal and a powerful Italian count. For them, Rail and Harwell are only acolytes in a monstrous ceremony; Malloy, awash in doubts about himself and his religious faith, is drawn into the drama.\r\n\r\nIn A Killing for Christ, Pete Hamill steps behind the public face of the modern Church and sees the dark grottoes within. He examines the hidden hearts of priests and prostitutes, the tortured windings of perverted thinking, the orgies of the bored and the bitter. Within the passage of the four days most holy to the Church, he traces the malignant progress of a blasphemous conspiracy to the taut moment of its ultimate act and redeems from it a unique understanding of man and of faith.\r\n\r\nxx","last_updated":"2018-03-12T12:03:16.650Z","parsed":{"xt":"urn:btih:d49d1edfb5eb3c82e15d2aa8cbc0b8de8bafc76b","dn":"A Killing for Christ, 50th Anniversary Ed. by Pete Hamill EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d49d1edfb5eb3c82e15d2aa8cbc0b8de8bafc76b","infoHashBuffer":{"type":"Buffer","data":[212,157,30,223,181,235,60,130,225,93,42,168,203,192,184,222,139,175,199,107]},"name":"A Killing for Christ, 50th Anniversary Ed. by Pete Hamill EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}