{"title":"Simone Weil - Mystical and Philosophical Works (14 books)","magnet":"magnet:?xt=urn:btih:d4addcf4c38308646f46721817810758af73b9ec&dn=Simone+Weil+-+Mystical+and+Philosophical+Works+%2814+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"69513523","seeders":"21","leechers":"41","description":"\nSIMONE WEIL (1909-1943) was a French philosopher, mystic, and political activist.  Albert Camus described her as &quot;the only great spirit of our times.&quot;\n\nIntellectually precocious, Weil expressed social awareness from an early age.  At five she refused sugar because the French soldiers at the front during World War I had none, and at six she was quoting the French dramatic poet Jean Racine.  In 1919, at 10 years of age, she declared herself a Bolshevik.  In addition to studies in philosophy, classical philology, and science, Weil embarked on new learning projects as the need arose.  She taught philosophy in several girls&#x2019; schools during the 1930s, taking several breaks due to poor health and to devote herself to political activism, including assisting in the trade union movement, taking the side of the Anarchists in the Spanish Civil War, and spending more than a year working as a labourer so she could better understand the working class.\n\nTaking a path that was unusual among twentieth-century left-leaning intellectuals, Weil became more religious and inclined towards mysticism as her life progressed.  Though born of Jewish parents and raised in a secular household, she eventually adopted a mystical theology that came very close to Roman Catholicism, although she did not limit her curiosity to Christianity.  She was keenly interested in other religious traditions and believed that they all contained elements of genuine revelation.  A moral idealist committed to a vision of social justice, Weil in her writings explored her own religious life while also analyzing the individual&#x2019;s relation with the state and God, the spiritual shortcomings of modern industrial society, and the horrors of totalitarianism.\n\nWeil&apos;s most famous works were published posthumously, the most important being GRAVITY AND GRACE (1947), a collection of religious essays and aphorisms; THE NEED FOR ROOTS (1949), an essay upon the obligations of the individual and the state; WAITING FOR GOD (1950), a spiritual autobiography, here presented in two translations; OPPRESSION AND LIBERTY (1955), a collection of political and philosophical essays on war, factory work, language, and other topics; and the volumes of her NOTEBOOKS (1951-56).\n\n\nThe following books are in ePUB and/or PDF format as noted:\n\n* An Anthology (Penguin, 2005).  Sian Miles, ed. -- PDF (by @pharmakate)\n* Awaiting God (Fresh Wind, 2012).  Bradley Jersak, trans. -- ePUB\n* First and Last Notebooks (Oxford, 1970).  Richard Rees, trans. -- PDF\n* Formative Writings, 1929-1941 (Massachusetts, 1987).  McFarland, trans. -- PDF\n* Gravity and Grace (Routledge, 2002).  Crawford &amp; von Ruhr, trans. -- ePUB + PDF\n* Iliad, or The Poem of Force (Pendle Hill, 1991).  Mary McCarthy, trans. -- PDF\n* Late Philosophical Writings (Notre Dame, 2015).  Eric O. Springsted, ed. -- ePUB\n* Lectures on Philosophy (Cambridge, 1978).  Hugh Price, trans. -- PDF\n* Need for Roots, The (Routledge, 2005).  Arthur Wills, trans. -- PDF\n* Notebooks of Simone Weil (Putnam, 1956).  2 volumes.  Arthur Wills, trans. -- PDF\n* On the Abolition of All Political Parties (NYRB, 2014).  Simon Leys, trans. -- ePUB\n* Oppression and Liberty (Routledge, 2004).  Wills &amp; Petrie, trans. -- ePUB + PDF\n* Waiting for God (Harper &amp; Row, 1973).  Craufurd, trans. -- PDF (by @pharmakate)\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-08-19T12:04:32.930Z","parsed":{"xt":"urn:btih:d4addcf4c38308646f46721817810758af73b9ec","dn":"Simone Weil - Mystical and Philosophical Works (14 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d4addcf4c38308646f46721817810758af73b9ec","infoHashBuffer":{"type":"Buffer","data":[212,173,220,244,195,131,8,100,111,70,114,24,23,129,7,88,175,115,185,236]},"name":"Simone Weil - Mystical and Philosophical Works (14 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}