{"title":"Cover-up in the Death of Ron Brown (pdf) - roflcopter2110","magnet":"magnet:?xt=urn:btih:d51d9a0e64c6745403b9bdf135f7c3c6705a4cea&dn=Cover-up+in+the+Death+of+Ron+Brown+%28pdf%29+-+roflcopter2110&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"roflcopter2110","categoryP":"other","categoryS":"e_books","size":"1479928","seeders":"13","leechers":"1","description":"Cover-up in the Death of Ron Brown (pdf) - roflcopter2110\r\n <a href=\"\nhttps://extraimage.net/images/2018/01/28/ace4e56bc6471c6457dabd675c4f59cf.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://extraimage.net/images/2018/01/28/ace4e56bc6471c6457dabd675c4f59cf.jpg</a>\r\n\r\nExcerpts:\r\nAt the time of his death on April 3, 1996, Ron Brown was the highest government official to die since the tragic death of White House deputy Counsel Vincent Foster in 1993.\r\n\r\nAs Commerce Secretary, Ron Brown was a member of the Cabinet.\r\n\r\nHe died while on a military aircraft flying an official government mission.\r\n\r\nHis plane crashed in area of the world where hostilities had been of long duration.\r\n\r\nAt the time of his death, Brown was under criminal investigation.\r\n\r\nAll of these factors would have led federal authorities to conduct:\r\na) a meticulous investigation of Brown&apos;s death and the plane crash.\r\nb) a basic investigation using standard practice and following normal procedures.\r\nc) no significant investigation.\r\n\r\nHad you answered &quot;a&quot; or &quot;b&quot;, you would be wrong.\r\n\r\nThe sad truth is that the government took action &quot;c&quot;: no significant investigation.\r\n\r\nIt has been more than two years since Brown&apos;s death, and some of the basic questions involving his death have yet to be answered:\r\n\r\nWhy did the Air Force not follow standard procedure investigating the crash?\r\n\r\nFor the first time in their history of investigations involving plane crashes on friendly territory, the Air Force ignored required procedure and immediately declared Brown&apos;s crash an accident.\r\n\r\nWhy did the Pentagon, on the day of the crash, clearly imply to the press the crash was nothing but an accident caused by bad weather?\r\n\r\nThe Pentagon made this snap announcement hours BEFORE any Americans even arrived at the crash scene.\r\n\r\nAs it turned out, the Air Force report on the crash later stated that the weather was actually fine when Brown&apos;s plane was landing and did not contribute to the crash.\r\n\r\nWhy did the White House ask the military not to conduct autopsies on Brown and the other civilians?\r\n\r\nThe ranking officer present at Dover Air Force Base when the bodies returned from Croatia was Air Force Colonel William Gormley. Gormley stated on a national television show that the White House had been a party to that decision.\r\n\r\nWhy, when evidence emerged that Brown may have suffered a gunshot wound to his head, was an autopsy not immediately conducted?\r\n\r\nAll of the pathologists agreed that the wound had the appearance of a gunshot wound.\r\n\r\nWhy were head X-rays destroyed?\r\n\r\nThe military predicates its claims that nothing foul happened to Brown because head X-rays showed no metal in his head.\r\n\r\nYet, the military also acknowledges these X-rays have simply disappeared.\r\n\r\nDestruction of evidence in a criminal case is a crime.\r\n\r\nWhy hasn&apos;t this been investigated?\r\n\r\nThese are just some of the questions that need answering","last_updated":"2018-01-28T12:05:43.305Z","parsed":{"xt":"urn:btih:d51d9a0e64c6745403b9bdf135f7c3c6705a4cea","dn":"Cover-up in the Death of Ron Brown (pdf) - roflcopter2110","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d51d9a0e64c6745403b9bdf135f7c3c6705a4cea","infoHashBuffer":{"type":"Buffer","data":[213,29,154,14,100,198,116,84,3,185,189,241,53,247,195,198,112,90,76,234]},"name":"Cover-up in the Death of Ron Brown (pdf) - roflcopter2110","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}