{"title":"The Barefoot Lawyer by Chen Guangcheng AZW","magnet":"magnet:?xt=urn:btih:d5d8a88d9b728a1616689273042beefd226d4e1e&dn=The+Barefoot+Lawyer+by+Chen+Guangcheng+AZW&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2395478","seeders":"38","leechers":"6","description":"xx\r\n\r\nThe Barefoot Lawyer: A Blind Man&apos;s Fight for Justice and Freedom in China by Chen Guangcheng AZW\r\n\r\nIt was like a scene out of a thriller: one morning in April 2012, China&apos;s most famous political activist - a blind, self-taught lawyer - climbed over the wall of his heavily guarded home and escaped. Days later, he turned up at the American embassy in Beijing, and only a furious round of high-level negotiations made it possible for him to leave China and begin a new life in the United States. Chen Guangcheng is a unique figure on the world stage, but his story is even more remarkable than anyone knew.\r\n\r\nThe son of a poor farmer in rural China, blinded by illness when he was an infant, Chen was fortunate to survive a difficult childhood. But despite his disability, he was determined to educate himself and fight for the rights of his country&apos;s poor, especially a legion of women who had endured forced sterilizations and abortions under the hated &quot;one child&quot; policy. Repeatedly harassed, beaten, and imprisoned by Chinese authorities, Chen was ultimately placed under house arrest. After nearly two years of increasing danger, he evaded his captors and fled to freedom.\r\n\r\nBoth a riveting memoir and a revealing portrait of modern China, this passionate book tells the story of a man who has never accepted limits and always believed in the power of the human spirit to overcome any obstacle.\r\n\r\nxx","last_updated":"2018-07-02T12:14:25.808Z","parsed":{"xt":"urn:btih:d5d8a88d9b728a1616689273042beefd226d4e1e","dn":"The Barefoot Lawyer by Chen Guangcheng AZW","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d5d8a88d9b728a1616689273042beefd226d4e1e","infoHashBuffer":{"type":"Buffer","data":[213,216,168,141,155,114,138,22,22,104,146,115,4,43,238,253,34,109,78,30]},"name":"The Barefoot Lawyer by Chen Guangcheng AZW","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}