{"title":"The King's Grave_ The Discovery of Richard III's Lost Burial Pla","magnet":"magnet:?xt=urn:btih:d76d955c5dd9373ce47aa5beec7a7e7617413afb&dn=The+King%27s+Grave_+The+Discovery+of+Richard+III%27s+Lost+Burial+Pla&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1952802","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe King&apos;s Grave: The Discovery of Richard III&apos;s Lost Burial Place and the Clues It Holds by Philippa Langley, Michael Jones EPUB\r\n\r\nOn 22 August 1485, Richard III was killed at Bosworth Field, the last king of England to die in battle. His victorious opponent, Henry Tudor (the future Henry VII), went on to found one of our most famous ruling dynasties. Richard&apos;s body was displayed in undignified fashion for two days in nearby Leicester and then hurriedly buried in the church of the Greyfriars. Fifty years later, at the time of the dissolution of the monasteries, the king&apos;s grave was lost - its contents believed to be emptied into the river Soar - and Richard III&apos;s reputation buried under a mound of Tudor propaganda. Its culmination was Shakespeare&apos;s compelling portrayal of a deformed and murderous villain, written over a hundred years after Richard&apos;s death. Now - in an incredible find - Richard III&apos;s remains have been uncovered beneath a car park in Leicester. The King&apos;s Grave traces this remarkable journey. In alternate chapters, Philippa Langley, whose years of research and belief that she would find Richard in this exact spot inspired the project, reveals the inside story of the search for the king&apos;s grave, and historian Michael Jones tells of Richard&apos;s fifteenth-century life and death. The result is a compelling portrayal of one of our greatest archaeological discoveries, allowing a complete re-evaluation of our most controversial monarch - one that discards the distortions of later Tudor histories and puts the man firmly back into the context of his times.\r\n\r\nxx","last_updated":"2018-07-13T12:06:12.691Z","parsed":{"xt":"urn:btih:d76d955c5dd9373ce47aa5beec7a7e7617413afb","dn":"The King's Grave_ The Discovery of Richard III's Lost Burial Pla","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d76d955c5dd9373ce47aa5beec7a7e7617413afb","infoHashBuffer":{"type":"Buffer","data":[215,109,149,92,93,217,55,60,228,122,165,190,236,122,126,118,23,65,58,251]},"name":"The King's Grave_ The Discovery of Richard III's Lost Burial Pla","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}