{"title":"Happy Down Below","magnet":"magnet:?xt=urn:btih:d7d34c7e3a69a0e62e59f597f92b7b18d6f4e43d&dn=Happy+Down+Below&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"1122791","seeders":"0","leechers":"0","description":"Happy Down Below: Everything You Want to Know About the Penis and Other Bits - Dr. Oliver Gralla\r\n\r\nPublished by Greystone Books, 2018, EPUB\r\n\r\nCover:\r\n <a href=\"\nhttps://i.imgur.com/zC7OpfC.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://i.imgur.com/zC7OpfC.jpg</a>\r\n\r\nAn informative, accessible, and funny guide to male anatomy and men&apos;s health.\r\n\r\nAs many of us know, men are notoriously reluctant to see a doctor. Indeed, only three in five men report going for an annual physical, and just over forty percent only ever visit the clinic when their symptoms become unbearable. Many know little or nothing about their bodies, with dire consequences for their wellbeing.\r\n\r\nIn Happy Down Below, men&#x2019;s health specialist Dr. Oliver Gralla provides a clever and highly entertaining remedy to that situation. Packed with colorful anecdotes and quirky illustrations, this cheeky guidebook offers practical tips and clear, accessible explanations for helping men (and women) better understand the male body, learn to care for it, and become more comfortable speaking about it with their doctors when things go wrong. With plenty of relatable metaphors, and a light, conversational tone, Dr. Gralla provides simple, research-based answers to questions such as: Do male enhancement pills actually work? Why does erectile dysfunction happen, and how is it treated? What is a &#x201C;normal&#x201D; penis&#x2014;and how big is it really? And much, much more.\r\n\r\nDR. OLIVER GRALLA is a well-known German urologist and specialist in men&#x2019;s health. Following a year of research at Harvard University, he began his career at in Berlin&#x2019;s Charit&#xE9; teaching hospital, earning himself the nickname &#x201C;The Stork of Berlin&#x201D; for his work with men facing infertility. He then moved to Cologne&#x2014;where he was greeted with a full-spread newspaper interview that called him &#x201C;Dr. Sex&#x201D;&#x2014;to manage the men&#x2019;s health center at University Clinic, and is now in private practice there.\r\n\r\nPlease seed and share. 8===D","last_updated":"2018-10-07T12:09:00.388Z","parsed":{"xt":"urn:btih:d7d34c7e3a69a0e62e59f597f92b7b18d6f4e43d","dn":"Happy Down Below","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d7d34c7e3a69a0e62e59f597f92b7b18d6f4e43d","infoHashBuffer":{"type":"Buffer","data":[215,211,76,126,58,105,160,230,46,89,245,151,249,43,123,24,214,244,228,61]},"name":"Happy Down Below","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}