{"title":"Boss Bitch by Nicole Lapin EPUB","magnet":"magnet:?xt=urn:btih:d81c81dc35bdcdb40eba11e099fa2e1de01296cb&dn=Boss+Bitch+by+Nicole+Lapin+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"11517110","seeders":"0","leechers":"0","description":"xx\r\n\r\nBoss Bitch by Nicole Lapin EPUB\r\n\r\nNew York Times best-selling author Nicole Lapin is back with a sassy and actionable guide empowering women to be the bosses of their own lives and careers.\r\n\r\nYou don&apos;t need dozens or hundreds of employees to be a boss, says financial expert and serial entrepreneur Nicole Lapin. Hell, you don&apos;t need even one. You just need to be confident, savvy, and ready to get out there and make your success happen. You need to find your inner boss bitch - your most confident, savvy, ambitious self - and own it.\r\n\r\nA boss bitch is the she-ro of her own story. She is someone who takes charge of herself and her future and embraces being a boss in all senses of the word: whether as the boss of her own life, a boss at work, or the literal boss of her own company (or all three). Whichever she chooses, being a boss bitch isn&apos;t something to apologize for - it&apos;s something to be proud of!\r\n\r\nWe all have what it takes to be a boss bitch, says Lapin. The problem is we don&apos;t learn how to do it in school. Even if we study business, we&apos;re not getting enough real-deal business education. Until now. Here, Lapin draws on raw and often hilariously real stories from her own career and experiences starting businesses - the good, the bad, and the ugly - to show what it means to be a boss in 12 easy steps. In her refreshingly honest and relatable style, she first shows how to embrace the boss of you mentality by seizing the power that comes from believing in yourself and expanding your personal skillset. Then she offers candid, no-nonsense advice on how to kill it as the boss at work, whether you have a high-up role or not. And finally, for those who want to take the plunge as an entrepreneur, she lays out the nuts and bolts of how to be the boss of your own business - from raising money and getting it off the ground to hiring a kickass staff and dealing with office drama to turning a profit.\r\n\r\n..\r\n\r\nxx","last_updated":"2018-02-05T12:00:39.823Z","parsed":{"xt":"urn:btih:d81c81dc35bdcdb40eba11e099fa2e1de01296cb","dn":"Boss Bitch by Nicole Lapin EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d81c81dc35bdcdb40eba11e099fa2e1de01296cb","infoHashBuffer":{"type":"Buffer","data":[216,28,129,220,53,189,205,180,14,186,17,224,153,250,46,29,224,18,150,203]},"name":"Boss Bitch by Nicole Lapin EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}