{"title":"House of Games (1987) 720p H.264 ENG-FRE-SPA (moviesbyrizzo)","magnet":"magnet:?xt=urn:btih:d82463092c4e76a41557c7bff09bace3c194528f&dn=House+of+Games+%281987%29+720p+H.264+ENG-FRE-SPA+%28moviesbyrizzo%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"moviesbyrizzo","categoryP":"video","categoryS":"hd___movies","size":"4493838271","seeders":"2","leechers":"2","description":" <a href=\"http://www.imdb.com/title/tt0093223/\" rel=\"nofollow\" target=\"_NEW\">http://www.imdb.com/title/tt0093223/</a>\r\n\r\nOne of most favourite movies, unfortunately not at this point as yet\r\navailable on bluray disc from which to offer you a 1080p version\r\nWe plan to do so just as soon as it is! In the meantime, we have taken the\r\nVIGI 3.11GB 720p WebDl MKV file of this movie and made several big improvements.\r\nWe have added multi language audio files so that it supports English French or Spanish needs with an audio track for each at 192k AC3 Dolby. The video is still at 1280 X 692 at 4387k bitrate H.264 720p MP4 (Our version does allow for \r\nsearching within the movie using your controls). We also have some\r\ngreat interviews with the stars of the show - Mr. Joe Mantegna, Ms. Lindsay Crouse and David Mamet - Pullitzer prize winning playwright and Director \r\nof this great film. His other great works include &quot;Glengarry Glen Ross&quot;\r\nwhich we have posted here for you in 1080p version and have more postings\r\nof this movie pending including an English-Italian version (and possibly \r\nGerman too). This MP4 version comes in at 3.5GB instead (plus extras)\r\n \r\nThis movie rated as best picture on the Ebert and Siskel for 1987\r\n\r\nIf someone tells you they aren&apos;t worthy of trust - and yet you see fit\r\nto take a chance with such a person as that - whose fault is it really-\r\n&quot;if you get took&quot;! That&apos;s the question Joe Mantegna asks in this movie\r\nas articulated in the (XviD) interview we have here included for you as a \r\n&quot;DVD extra&quot; from the Criterion version of the DVD. \r\n\r\nThis is a truly great movie to see. Lindsay Crouse is a gentle soul who is\r\ntaken for a bit of a ride by characters who are in fact alienated from her Christianly spirit in the movie as scripted. She may seem tough on the \r\nexterior at times, however she should hardly be taken advantage of, I\r\nbelieve. \r\n\r\nI also am convinced that the character played by Joe Mantegna could \r\nbe won over to actually protect her spirit in the future rather than being\r\na menace as he is cast to be in the movie as scripted as I say.\r\n\r\nThere are twists and turns which will astound you and the suspense \r\nis captivating and thrilling. It really is a movie worth seeing and \r\nowning in your personal library, worthy of a cult following even. \r\n\r\n\r\nIf psychological drama and suspense is your thing, and you enjoy an\r\nintelligent uptake on it, grab this one while we await the bluray vers.\r\n\r\nSubtitles included here for English French (we extracted this from a DVD and \r\nre-synced it for you to match this video) plus Greek Polish Portuguese Serbian \r\nand Spanish\r\n\r\nplease join in the seed\r\nwith thanks\r\n\r\nMichael Rizzo Chessman\r\n(moviesbyrizzo)","last_updated":"2018-05-04T12:13:05.525Z","parsed":{"xt":"urn:btih:d82463092c4e76a41557c7bff09bace3c194528f","dn":"House of Games (1987) 720p H.264 ENG-FRE-SPA (moviesbyrizzo)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d82463092c4e76a41557c7bff09bace3c194528f","infoHashBuffer":{"type":"Buffer","data":[216,36,99,9,44,78,118,164,21,87,199,191,240,155,172,227,193,148,82,143]},"name":"House of Games (1987) 720p H.264 ENG-FRE-SPA (moviesbyrizzo)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}