{"title":"Udemy - ARM Cortex-M (TM4C123) Complete TIMERS Cookbook","magnet":"magnet:?xt=urn:btih:d8a13cf91a296139268c8f57fdb71d4f591b7e56&dn=Udemy+-+ARM+Cortex-M+%28TM4C123%29+Complete+TIMERS+Cookbook&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"tuts756","categoryP":"other","categoryS":"other","size":"529652158","seeders":"8","leechers":"8","description":"Description\r\n\r\nWe have been receiving a bunch of questions weekly from most of you on cortex-m dot com on how to program the SysTick and General Purpose Timers so we decided to create a course detailing everything there is to know about TIMERS. The microcontroller we have chosen for this course is the Texas Instrument TM4C123 which is an ARM Cortex M4, needless to say the content of this course can be applied to all ARM Cortex Microncontrollers.\r\n\r\nWe decided to make the best course on TIMERS you can find on the internet.\r\n\r\nWe a not really looking to make a lot of money from this course- this course is to merely help reduce the number of questions we receive on TIMERS weekly. It comes with a 30-days money back guarantee.  Just try it out, if you do not like it request a refund and  send me a friendly message telling me why it wasn&#x2019;t helpful and we shall become even better friends.\r\n\r\nAt the end of this course you should be able to do the following among other things :\r\n\r\nBuild Multi-Threaded applications using TIMERS ,Write Drivers and API&#x2019;s for TIMERS, Write and test drivers for the HC-SR04 ultrasonic sensor from scratch, Precisely  count the occurrence of events using TIMERS, Measure the time between events using TIMERS, Create precise delays in milliseconds, microseconds and seconds &#x2026; and many more, just see the full course description.\r\nWho is the target audience?\r\n\r\n    Embedded systems professionals\r\n    Embedded systems students\r\n    Hobbyists\r\n\r\nRequirements\r\n\r\n    The development environment for this course is the Keil uVision 5 which can be downloaded for free from the ARM website\r\n    Our microcontroller of choice is the low cost TM4c123H6PM Tiva C LaunchPad from Texas Intruments\r\n    No prior knowledge of TIMERS is assumed","last_updated":"2018-04-25T12:10:19.265Z","parsed":{"xt":"urn:btih:d8a13cf91a296139268c8f57fdb71d4f591b7e56","dn":"Udemy - ARM Cortex-M (TM4C123) Complete TIMERS Cookbook","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d8a13cf91a296139268c8f57fdb71d4f591b7e56","infoHashBuffer":{"type":"Buffer","data":[216,161,60,249,26,41,97,57,38,140,143,87,253,183,29,79,89,27,126,86]},"name":"Udemy - ARM Cortex-M (TM4C123) Complete TIMERS Cookbook","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}