{"title":"The Templars and the Shroud of Christ.epub","magnet":"magnet:?xt=urn:btih:d952114af4081d03863a16ece3984f937a4aae1d&dn=The+Templars+and+the+Shroud+of+Christ.epub&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"CopperSun","categoryP":"other","categoryS":"e_books","size":"4606522","seeders":"34","leechers":"6","description":"The Templars and the Shroud of Christ: A Priceless Relic in the Dawn of the Christian Era and the Men Who Swore to Protect It \r\n\r\nBy Barbara Frale \r\n\r\n\r\n\r\nThe most powerful military religious order of the Middle Ages and their sacred treasure.\r\n\r\nFor a certain period in history, the Knights Templar&#x2014;the most powerful military religious order of the Middle Ages&#x2014;secretly guarded the Shroud of Turin. Worshipped in a relentlessly secret manner, and known in its intimate nature by only a handful of the order&#x2019;s officials, the swathe of fabric was kept in the central treasury of the Knights Templar, who were known for their expertise in the field of relics. The precious cloth&#x2019;s history and whereabouts were known only to the highest dignitaries of the secretive order. In an era of widespread doctrinal confusion in much of the Church, the Templars considered the Shroud to be a powerful antidote against the proliferation of heresies.\r\n\r\nEasy to read and thoroughly researched, this book tracks the Templars from their inception as warrior-monks protecting religious pilgrims to the later fascination with their secret rituals and incredible wealth, which ultimately led to their dissolution and the seizing of their assets. Following the Shroud&#x2019;s pathway through the Middle Ages, Vatican historian Barbara Frale has gone back in time, to the dawn of the Christian era, to provide a new perspective on the controversial relic. The author also includes several photos of the Shroud itself that reveal in startling detail a human face, mysterious writing, and marks of a crucifixion that many have claimed identify it as the true burial shroud of Jesus of Nazareth","last_updated":"2018-09-09T12:22:36.775Z","parsed":{"xt":"urn:btih:d952114af4081d03863a16ece3984f937a4aae1d","dn":"The Templars and the Shroud of Christ.epub","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d952114af4081d03863a16ece3984f937a4aae1d","infoHashBuffer":{"type":"Buffer","data":[217,82,17,74,244,8,29,3,134,58,22,236,227,152,79,147,122,74,174,29]},"name":"The Templars and the Shroud of Christ.epub","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}