{"title":"Bad Girls by Caitlin Davies EPUB","magnet":"magnet:?xt=urn:btih:da12805853363a6f3ffdbeb1253d99b7ddac0500&dn=Bad+Girls+by+Caitlin+Davies+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1385039","seeders":"0","leechers":"0","description":"xx\r\n\r\nBad Girls by Caitlin Davies EPUB\r\n\r\nA history of a century of women, punishment and crime in HM Prison Holloway. \r\n\r\nSociety has never known what to do with its rebellious women. Those who defied expectations about feminine behaviour have long been considered dangerous and unnatural, and ever since the Victorian era they have been removed from public view, locked up and often forgotten about. Many of these women ended up at HM Prison Holloway, the self-proclaimed &apos;terror to evil-doers&apos; which, until its closure in 2016, was Western Europe&apos;s largest women&apos;s prison. \r\n\r\nHolloway was first built in 1852 as a house of correction, and its women have come from all corners of the UK - whether a patriot from Scotland, a suffragette from Huddersfield, or a spy from the Isle of Wight - and from all walks of life - socialites and prostitutes, sporting stars and nightclub queens, refugees and freedom fighters. They were imprisoned for treason and murder, for begging, performing abortions and stealing clothing coupons, for masquerading as men, running brothels and attempting suicide. \r\n\r\nIn Bad Girls, Caitlin Davies tells their stories and shows how women have been treated in our justice system over more than a century, what crimes - real or imagined - they committed, who found them guilty and why. It is a story of victimisation and resistance, of oppression and bravery. From the women who escaped the hangman&apos;s noose - and those who didn&apos;t - to those who escaped Holloway altogether, Bad Girls is a fascinating look at how disobedient and defiant women changed not only the prison service but the course of history. \r\n\r\nxx","last_updated":"2018-04-13T16:04:11.338Z","parsed":{"xt":"urn:btih:da12805853363a6f3ffdbeb1253d99b7ddac0500","dn":"Bad Girls by Caitlin Davies EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"da12805853363a6f3ffdbeb1253d99b7ddac0500","infoHashBuffer":{"type":"Buffer","data":[218,18,128,88,83,54,58,111,63,253,190,177,37,61,153,183,221,172,5,0]},"name":"Bad Girls by Caitlin Davies EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}