{"title":"The Man Who Touched His Own Heart by Rob Dunn EPUB","magnet":"magnet:?xt=urn:btih:da16540fbcaf94e9896af61581eabde74eccde70&dn=The+Man+Who+Touched+His+Own+Heart+by+Rob+Dunn+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5462672","seeders":"41","leechers":"7","description":"xx\r\n\r\nThe Man Who Touched His Own Heart: True Tales of Science, Surgery, and Mystery by Rob Dunn EPUB\r\n\r\nThe secret history of our most vital organ - the human heart\r\n\r\nThe Man Who Touched His Own Heart tells the raucous, gory, mesmerizing story of the heart, from the first &quot;explorers&quot; who dug up cadavers and plumbed their hearts&apos; chambers, through the first heart surgeries - which had to be completed in three minutes before death arrived - to heart transplants and the latest medical efforts to prolong our hearts&apos; lives, almost defying nature in the process.\r\n\r\nThought of as the seat of our soul, then as a mysteriously animated object, the heart is still more a mystery than it is understood. Why do most animals only get one billion beats? (And how did modern humans get to over two billion - effectively letting us live out two lives?) Why are sufferers of gingivitis more likely to have heart attacks? Why do we often undergo expensive procedures when cheaper ones are just as effective? What do Da Vinci, Mary Shelley, and contemporary Egyptian archaeologists have in common? And what does it really feel like to touch your own heart, or to have someone else&apos;s beating inside your chest?\r\n\r\nRob Dunn&apos;s fascinating history of our hearts brings us deep inside the science, history, and stories of the four chambers we depend on most.\r\n\r\nxx","last_updated":"2018-07-01T12:12:13.474Z","parsed":{"xt":"urn:btih:da16540fbcaf94e9896af61581eabde74eccde70","dn":"The Man Who Touched His Own Heart by Rob Dunn EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"da16540fbcaf94e9896af61581eabde74eccde70","infoHashBuffer":{"type":"Buffer","data":[218,22,84,15,188,175,148,233,137,106,246,21,129,234,189,231,78,204,222,112]},"name":"The Man Who Touched His Own Heart by Rob Dunn EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}