{"title":"Trumpocracy_ .. Corruption of the American .. by David Frum EPUB","magnet":"magnet:?xt=urn:btih:da4ca1d68ebf4b77e998bd430aa6dc213e53daf5&dn=Trumpocracy_+..+Corruption+of+the+American+..+by+David+Frum+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1614501","seeders":"57","leechers":"11","description":"xx\r\n\r\nTrumpocracy_ .. Corruption of the American .. by David Frum EPUB\r\n\r\nBest-selling author, former White House speechwriter, and Atlantic columnist and media commentator David Frum explains why President Trump has undermined our most important institutions in ways even the most critical media has missed, in this thoughtful and hard-hitting book that is a warning for democracy and America&apos;s future.\r\n\r\n&quot;From Russia to South Africa, from Turkey to the Philippines, from Venezuela to Hungary, authoritarian leaders have smashed restraints on their power. Media freedom and judicial independence have eroded. The right to vote remains, but the right to have one&apos;s vote counted fairly may not. Until the US presidential election of 2016, the global decline of democracy seemed a concern for other peoples in other lands.... That complacent optimism has been upended by the political rise of Donald Trump. The crisis is upon Americans, here and now.&quot;\r\n\r\nQuietly, steadily, Trump and his administration are damaging the tenets and accepted practices of American democracy, perhaps irrevocably. As he and his family enrich themselves, the presidency itself falls into the hands of the generals and financiers who surround him.\r\n\r\nWhile much of the country has been focused on Russia, David Frum has been collecting the lies, obfuscations, and flagrant disregard for the traditional limits placed on the office of the presidency. In Trumpocracy, he documents how Trump and his administration are steadily damaging the tenets and accepted practices of American democracy. During his own White House tenure as George W. Bush&apos;s speechwriter, Frum witnessed the ways the presidency is limited not by law but by tradition, propriety, and public outcry, all now weakened. Whether the Trump presidency lasts two, four, or eight more years, he has changed the nature of the office for the worse, and likely for decades.\r\n\r\n..\r\n\r\nxx","last_updated":"2018-01-18T19:01:39.355Z","parsed":{"xt":"urn:btih:da4ca1d68ebf4b77e998bd430aa6dc213e53daf5","dn":"Trumpocracy_ .. Corruption of the American .. by David Frum EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"da4ca1d68ebf4b77e998bd430aa6dc213e53daf5","infoHashBuffer":{"type":"Buffer","data":[218,76,161,214,142,191,75,119,233,152,189,67,10,166,220,33,62,83,218,245]},"name":"Trumpocracy_ .. Corruption of the American .. by David Frum EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}