{"title":"Already Here by Leo Galland EPUB","magnet":"magnet:?xt=urn:btih:dba3eb0ea8fc1f8d39f375158617e25a21f3e527&dn=Already+Here+by+Leo+Galland+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4330317","seeders":"0","leechers":"0","description":"xx\r\n\r\nAlready Here by Leo Galland EPUB\r\n\r\nAlready Here tells of the death of Leo Galland&apos;s son, Christopher, at age 22; the direct visual evidence Christopher showed Leo that our souls do go on; and the communications from Christopher&apos;s spirit that dramatically changed Leo&apos;s understanding of life and its meaning.\r\n\r\nIn life, Christopher was a brain-damaged special-needs child who challenged everyone he knew with his unpredictable behavior and uncanny insights. After his death, he revealed to Leo the real purpose of his life, as a spiritual guide who taught others by confounding their assumptions and expectations. And he began to share with Leo a new perspective on everything from the nature of good and evil to the notion that the universe is, fundamentally, an act of love.\r\n\r\nChristopher&apos;s wisdom was revealed to Leo over the course of a year, coalescing into three themes: the Gift of the Opposite, the Gift of Presence, and the Gift of Timelessness. Leo quickly came to realize that these gifts were not for him alone: they contain ancient wisdom, held sacred in many traditions, that Chris intended him to share with others. He has written this book to do just that.\r\n\r\nAlready Here presents a unique dialogue in which an analytical, scientific mind tries to comprehend truths from another plane of existence. Chris describes Heaven and Earth, spirit and matter, as unified opposites that cannot exist without each other and cannot be separated from human consciousness. The book takes its title from Christopher&apos;s final message to Leo, in which he describes Heaven as an &quot;eternal present&quot; where everyone is together, even those still living earthly lives. &quot;Lighten up&quot;, Christopher says to his father. &quot;You&apos;re already here, you know.&quot;\r\n\r\nxx","last_updated":"2018-03-28T12:04:48.078Z","parsed":{"xt":"urn:btih:dba3eb0ea8fc1f8d39f375158617e25a21f3e527","dn":"Already Here by Leo Galland EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dba3eb0ea8fc1f8d39f375158617e25a21f3e527","infoHashBuffer":{"type":"Buffer","data":[219,163,235,14,168,252,31,141,57,243,117,21,134,23,226,90,33,243,229,39]},"name":"Already Here by Leo Galland EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}