{"title":"Into the Black by Rowland White, Richard Truly MOBI","magnet":"magnet:?xt=urn:btih:dcb9a395866a87da64f6cc538e15d4740fed2495&dn=Into+the+Black+by+Rowland+White%2C+Richard+Truly+MOBI&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4280725","seeders":"41","leechers":"5","description":"xx\r\n\r\nInto the Black by Rowland White, Richard Truly MOBI\r\n\r\nThe real-life techno-thriller from a best-selling author and aviation expert that recaptures the historic moments leading up to the launch of the space shuttle Columbia and the exciting story of her daring maiden flight.\r\n\r\nUsing interviews, NASA oral histories, and recently declassified material, Into the Black pieces together the dramatic untold story of the Columbia mission and the brave people who dedicated themselves to help the United States succeed in the age of space exploration. On April 12, 1981, NASA&apos;s Space Shuttle Columbia blasted off from Cape Canaveral. It was the most advanced, state-of-the-art flying machine ever built, challenging the minds and imagination of America&apos;s top engineers and pilots. Columbia was the world&apos;s first real spaceship: a winged rocket plane, the size of an airliner and capable of flying to space and back before preparing to fly again.\r\n\r\nOnboard were moonwalker John Young and test pilot Bob Crippen. Less than an hour after Young and Crippen&apos;s spectacular departure from the Cape, all was not well. Tiles designed to protect the ship from the blowtorch burn of reentry were missing from the heat shield. If the damage to Columbia was too great, the astronauts wouldn&apos;t be able to return safely to Earth. NASA turned to the National Reconnaissance Office, a spy agency hidden deep inside the Pentagon whose very existence was classified. To help the ship, the NRO would attempt something never done before. Success would require skill, perfect timing, and luck.\r\n\r\nSet against the backdrop of the Cold War, Into the Black is a thrilling race against time and the incredible true story of the first space shuttle mission that celebrates our passion for spaceflight.\r\n\r\nxx","last_updated":"2018-01-28T12:10:38.361Z","parsed":{"xt":"urn:btih:dcb9a395866a87da64f6cc538e15d4740fed2495","dn":"Into the Black by Rowland White, Richard Truly MOBI","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dcb9a395866a87da64f6cc538e15d4740fed2495","infoHashBuffer":{"type":"Buffer","data":[220,185,163,149,134,106,135,218,100,246,204,83,142,21,212,116,15,237,36,149]},"name":"Into the Black by Rowland White, Richard Truly MOBI","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}