{"title":"Lone Wolf and Cub  1-6 1080p.BluRay.Remux.","magnet":"magnet:?xt=urn:btih:de5b42c7dc5add0b40ee2eaae9592dbb8c6ba39b&dn=Lone+Wolf+and+Cub++1-6+1080p.BluRay.Remux.&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"MStryderNorth3","categoryP":"video","categoryS":"hd___movies","size":"81573638083","seeders":"0","leechers":"7","description":"Lone Wolf and Cub\r\n\r\nBased on the best-selling manga series, the six intensely kinetic Lone Wolf and Cub films elevated chanbara to bloody new heights. The shogun&#x2019;s executioner, Itto Ogami (Tomisaburo Wakayama), takes to wandering the countryside as an assassin&#x2014;along with his infant son Daigoro (Akihiro Tomikawa) and a seemingly infinitely weaponized perambulator&#x2014;helping those he encounters while seeking vengeance for his murdered wife. Delivering stylish thrills and a body count that defies belief, Lone Wolf and Cub is beloved for its brilliantly choreographed action sequences as well as its tender depiction of the bonds between a parent and a child.\r\n\r\n\r\n    Lone Wolf and Cub: Sword of Vengeance\r\n\r\n    1972\r\n\r\n    The inaugural film in the Lone Wolf and Cub series immediately thrust Itto Ogami into the ranks of the all-time great samurai movie icons. In this installment, the Shadow Yagyu clan plots to solidify its power by taking Ogami&#x2019;s coveted position of shogun&#x2019;s executioner for its own. The legendary assassin escapes with his infant son, Daigoro, and swears vengeance.\r\n\r\n    Lone Wolf and Cub: Baby Cart at the River Styx\r\n\r\n    1972\r\n\r\n    In this exploitation-cinema classic, which took the action and graphic violence of the Lone Wolf and Cub series to delirious new heights, Itto Ogami and Daigoro continue their quest for vengeance through meifumado, the spiritual way of &#x201C;demons and damnation,&#x201D; pursued constantly by the Shadow Yagyu clan and the shogun&#x2019;s spies.\r\n\r\n    Lone Wolf and Cub: Baby Cart to Hades\r\n\r\n    1972\r\n\r\n    Unfolding in an idyllic countryside that contrasts sharply with the violence that occurs within it, the third Lone Wolf and Cub film follows Itto Ogami and Daigoro as they continue their journey and stumble upon a crime scene involving a group of lowlife swordsmen from the watari-kashi class.\r\n\r\n    Lone Wolf and Cub: Baby Cart in Peril\r\n\r\n    1972\r\n\r\n    In this distinctly lowbrow entry in the Lone Wolf and Cub series, Itto Ogami is hired by the Owari clan to assassinate a tattooed woman who is killing her enemies and cutting off their topknots. Meanwhile, Daigoro is separated from his father when he follows a pair of traveling street performers outside of town.\r\n\r\n    Lone Wolf and Cub: Baby Cart in the Land of Demons\r\n\r\n    1973\r\n\r\n    Balancing physical action with Buddhist musings on life and death, the most spiritual of the Lone Wolf and Cub films finds Ogami&#x2019;s combat skills put to the test by five different warrior-messengers.\r\n\r\n    Lone Wolf and Cub: White Heaven in Hell\r\n\r\n    1974\r\n\r\n    In the final Lone Wolf and Cub film, star Tomisaburo Wakayama decided to make the sort of wild movie he&#x2019;d always wanted to: one in which Lone Wolf battles zombies and Daigoro&#x2019;s baby cart zips improbably across an icy landscape on skis","last_updated":"2018-07-17T12:08:26.595Z","parsed":{"xt":"urn:btih:de5b42c7dc5add0b40ee2eaae9592dbb8c6ba39b","dn":"Lone Wolf and Cub  1-6 1080p.BluRay.Remux.","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"de5b42c7dc5add0b40ee2eaae9592dbb8c6ba39b","infoHashBuffer":{"type":"Buffer","data":[222,91,66,199,220,90,221,11,64,238,46,170,233,89,45,187,140,107,163,155]},"name":"Lone Wolf and Cub  1-6 1080p.BluRay.Remux.","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}