{"title":"Michael Crichton-Dragon Teeth [audio]","magnet":"magnet:?xt=urn:btih:de8f3cd52b81795de658f08e5bce4f96fcf0b361&dn=Michael+Crichton-Dragon+Teeth+%5Baudio%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"twocows","categoryP":"audio","categoryS":"audio_books","size":"221402922","seeders":"6","leechers":"7","description":"Michael Crichton-Dragon Teeth\r\n\r\n\r\n\r\nMichael Crichton, the #1 New York Times bestselling author of Jurassic Park, returns to the world of paleontology in this recently discovered novel&#x2014;a thrilling adventure set in the Wild West during the golden age of fossil hunting.\r\n\r\nThe year is 1876. Warring Indian tribes still populate America&apos;s western territories even as lawless gold-rush towns begin to mark the landscape. In much of the country it is still illegal to espouse evolution. Against this backdrop two monomaniacal paleontologists pillage the Wild West, hunting for dinosaur fossils, while surveilling, deceiving and sabotaging each other in a rivalry that will come to be known as the Bone Wars.\r\n\r\nInto this treacherous territory plunges the arrogant and entitled William Johnson, a Yale student with more privilege than sense. Determined to survive a summer in the west to win a bet against his arch-rival, William has joined world-renowned paleontologist Othniel Charles Marsh on his latest expedition. But when the paranoid and secretive Marsh becomes convinced that William is spying for his nemesis, Edwin Drinker Cope, he abandons him in Cheyenne, Wyoming, a locus of crime and vice. William is forced to join forces with Cope and soon stumbles upon a discovery of historic proportions. With this extraordinary treasure, however, comes exceptional danger, and William&apos;s newfound resilience will be tested in his struggle to protect his cache, which pits him against some of the West&apos;s most notorious characters","last_updated":"2018-10-01T12:47:12.391Z","parsed":{"xt":"urn:btih:de8f3cd52b81795de658f08e5bce4f96fcf0b361","dn":"Michael Crichton-Dragon Teeth [audio]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"de8f3cd52b81795de658f08e5bce4f96fcf0b361","infoHashBuffer":{"type":"Buffer","data":[222,143,60,213,43,129,121,93,230,88,240,142,91,206,79,150,252,240,179,97]},"name":"Michael Crichton-Dragon Teeth [audio]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}