{"title":"The Making of Modern Australia Documentary Series","magnet":"magnet:?xt=urn:btih:dea009f3c2393869646b46d8b7c813648031ac33&dn=The+Making+of+Modern+Australia+Documentary+Series&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Ravenwilde","categoryP":"video","categoryS":"tv_shows","size":"3163509598","seeders":"0","leechers":"23","description":"A Post-war 4 part documentary series charting the changes to Australia in the decades following WW2. Using archive footage, personal stories and photographs. \r\n\r\nEpisode one The Australian Child\r\n\r\nAustralia celebrated the end of the Second World War with an enthusiastic urge to procreate. Between 1946 and 1966, the population exploded from 7.5 million to 11.5 million. This was the era of the &quot;baby boomers&quot;, a generation of children whose rock &apos;n&apos; roll rebellion would sweep aside pre-war conservatism and change things forever.\r\n\r\nEpisode 2 The Australian Dream\r\n\r\n\r\nThe Australian obsession to own your own home is so entrenched in our culture, there&apos;s even a phrase for it &#x2026; The Australian Dream. It began immediately after the Second World War and continues to this day. At first &apos;the Dream&apos; was modest &#x2013; a 2 bedroom dwelling in the suburbs just like everyone else&#x2019;s, with enough land for a vegie patch and a spot for the kids to play. But then the population exploded, the suburbs sprawled, the fashions changed, and &apos;the Dream&apos; did too. Today a &apos;modest&apos; Australian home is at least twice the size of the post-war model. It used to be possible to buy a house for three times your annual salary, now it&apos;s nine times. And where once &quot;home&quot; was about shelter and security, now it&apos;s also a means of accumulating wealth and status for which many are finding it impossible to pay. \r\n\r\nEpisode 3 The Australian Heart\r\n\r\nFalling in love is a dance we all know the steps to. But what happens when the first flush of romance is over? In the 1940s and 50s, the rules of the game were strict, but clear to everyone... you got married and stayed married. Then came the swinging sixties and the sexual revolution. Today, you can live with who you want, when you want and how you want. \r\n\r\nEpisode 4 The Australian Soul\r\n\r\nThe Church once dominated the Australian landscape. \r\n\r\nOf all the great shifts in Australian life since World War II, perhaps religion has travelled farthest. Back in the 1940s and 50s Australians dutifully attended church and Sunday school. Christianity had a firm grip on the Australian soul. But from the late sixties, bad boys and girls were finding spiritual fulfilment elsewhere and the Churches struggled to keep up. Nowadays only about 8% of Australians go to church every Sunday and over 18% say they have no religion. So are we a nation of lost souls?","last_updated":"2018-03-31T12:09:36.497Z","parsed":{"xt":"urn:btih:dea009f3c2393869646b46d8b7c813648031ac33","dn":"The Making of Modern Australia Documentary Series","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dea009f3c2393869646b46d8b7c813648031ac33","infoHashBuffer":{"type":"Buffer","data":[222,160,9,243,194,57,56,105,100,107,70,216,183,200,19,100,128,49,172,51]},"name":"The Making of Modern Australia Documentary Series","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}