{"title":"Frederick Douglass: Prophet of Freedom by David W. Blight EPUB","magnet":"magnet:?xt=urn:btih:df2c14242fa6782fd93145abce5289326a404bd9&dn=Frederick+Douglass%3A+Prophet+of+Freedom+by+David+W.+Blight+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"41333318","seeders":"0","leechers":"0","description":"xx\r\n\r\nFrederick Douglass: Prophet of Freedom by David W. Blight EPUB\r\n\r\nThe definitive, dramatic biography of the most important African American of the 19th century: Frederick Douglass, the escaped slave who became the greatest orator of his day and one of the leading abolitionists and writers of the era.\r\n\r\nAs a young man, Frederick Douglass (1818-1895) escaped from slavery in Baltimore, Maryland. He was fortunate to have been taught to read by his slave owner mistress, and he would go on to become one of the major literary figures of his time. He wrote three versions of his autobiography over the course of his lifetime and published his own newspaper. His very existence gave the lie to slave owners: with dignity and great intelligence, he bore witness to the brutality of slavery. \r\n\r\nInitially mentored by William Lloyd Garrison, Douglass spoke widely, often to large crowds, using his own story to condemn slavery. He broke with Garrison to become a political abolitionist, a Republican, and eventually a Lincoln supporter. By the Civil War and during Reconstruction, Douglass became the most famed and widely traveled orator in the nation. He denounced the premature end of Reconstruction and the emerging Jim Crow era. In his unique and eloquent voice, written and spoken, Douglass was a fierce critic of the US as well as a radical patriot. He sometimes argued politically with younger African Americans, but he never forsook either the Republican party or the cause of black civil and political rights. \r\n\r\nIn this remarkable biography, David Blight has drawn on new information held in a private collection that few other historian have consulted, as well as recently discovered issues of Douglass&#x2019; newspapers. Blight tells the fascinating story of Douglass&#x2019; two marriages and his complex extended family. Douglass was not only an astonishing man of words, but a thinker steeped in Biblical story and theology. There has not been a major biography of Douglass in a quarter century. David Blight&#x2019;s Frederick Douglass affords this important American the distinguished biography he deserves.\r\n\r\nxx","last_updated":"2018-10-17T12:01:20.822Z","parsed":{"xt":"urn:btih:df2c14242fa6782fd93145abce5289326a404bd9","dn":"Frederick Douglass: Prophet of Freedom by David W. Blight EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"df2c14242fa6782fd93145abce5289326a404bd9","infoHashBuffer":{"type":"Buffer","data":[223,44,20,36,47,166,120,47,217,49,69,171,206,82,137,50,106,64,75,217]},"name":"Frederick Douglass: Prophet of Freedom by David W. Blight EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}