{"title":"In Pursuit of the Essex by Ben Hughes (.epub)","magnet":"magnet:?xt=urn:btih:dfef356014dcd0741dfe372b65ee799794deca61&dn=In+Pursuit+of+the+Essex+by+Ben+Hughes+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"16813377","seeders":"3","leechers":"0","description":"In Pursuit of the Essex: Heroism and Hubris on the High Seas in the War of 1812 by Ben Hughes \r\n\r\nRequirements: .ePUB Reader\r\n\r\nOverview: On 26 October 1812, during the war between Britain and the United States, the frigate USS Essex set sail on the most remarkable voyage in the early history of the US navy. After rounding Cape Horn, she proceeded to systematically destroy the British South Seas whaling fleet. When news reached the Royal Navy&#x2019;s South American station at Rio de Janeiro, HMS Phoebe was sent off in pursuit. So began one of the most extraordinary chases in naval history.\r\nIn Pursuit of the Essex follows the adventures of both hunter and hunted as well as a host of colourful characters that crossed their paths. Traitorous Nantucket whalers, Chilean revolutionaries, British spies, a Peruvian viceroy and bellicose Polynesian islanders all make an appearance. The brilliant yet vainglorious Captain Porter of the Essex, his nemesis Captain James Hillyar of the Phoebe, and two young midshipmen, David Farragut and Allen Gardiner, are the principal narrators.\r\nFrom giant-tortoise turning expeditions on the Galapagos to the perils of rounding Cape Horn, via desperate skirmishes with spear-toting natives on the Marquesas and a defeated duellist bleeding his life out onto black, volcanic sands, the reader is immersed in the fantastical world of the British and American seamen who struggled for supremacy over the world&#x2019;s oceans in the sunset years of the age of sail.\r\nBen Hughes&#x2019;s graphic account is a work of non-fiction, yet reads like a novel, from the opening view of the Essex preparing for her cruise on the Delaware River to the story&#x2019;s bloody denouement in Valparaiso Bay.\r\n\r\nGenre: Non Fiction &gt; History, Military","last_updated":"2018-10-15T12:28:35.143Z","parsed":{"xt":"urn:btih:dfef356014dcd0741dfe372b65ee799794deca61","dn":"In Pursuit of the Essex by Ben Hughes (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dfef356014dcd0741dfe372b65ee799794deca61","infoHashBuffer":{"type":"Buffer","data":[223,239,53,96,20,220,208,116,29,254,55,43,101,238,121,151,148,222,202,97]},"name":"In Pursuit of the Essex by Ben Hughes (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}