{"title":"Japanese Designs and Motifs by Carol Belanger Grafton (.epub)","magnet":"magnet:?xt=urn:btih:e0c5f2c2d5a62c3874861d81bd7cf15cd4ac4724&dn=Japanese+Designs+and+Motifs+by+Carol+Belanger+Grafton+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"6940773","seeders":"48","leechers":"9","description":"Treasury of Japanese Designs and Motifs for Artists and Craftsmen by Carol Belanger Grafton\r\n\r\nRequirements: .ePUB reader, 7 MB\r\n\r\nGenre: Non-Fiction &gt; General\r\n\r\nOverview: \r\n\r\nA profound sense of the aesthetic beauty in all things pervades the whole of Japanese culture, finding perhaps its clearest expression in the decorative, applied, and pictorial arts. Characterized by a mastery of line and composition, and noted for lyrical scenes of exquisite beauty, the genius of Japanese art has bequeathed to the world a remarkable and distinctive design legacy. This exceptionally versatile collection of traditional Japanese designs and motifs presents the working artist with a treasury of 360 copyright-free designs. All have been especially adapted by noted artist Carol Belanger Grafton for ready use by illustrators, designers, and craftspeople. Painstaking effort has been made to preserve the original spirit and subtlety of detail while simultaneously sharpening the lines and enhancing the reproducibility of the designs and motifs. There are several lovely ceramic and textile patterns. However, most of the design motifs in this compendium were taken from woodblock prints. This particular medium was invented in China and introduced to Japan before 1000 A.D., flourishing thereafter and reaching its zenith in the Ukiyo-e (&quot;floating world&quot;) school of the 17th, 18th, and 19th centuries. Accompanying these depictions of people in traditional garb, and accessories such as fans, keys, kites, and umbrellas, are many charmingly decorative family crests arranged in mostly circular configurations. Also included are full-page compositions of bold geometric design, vignettes of ethereal delicacy, as well as a generous sampling of nature&apos;s bounty: cherries, radishes, plum blossoms, lions, elephants, dogs, cranes, parrots, turtles, butterflies, even demons and dragons, and much more&#x2015;often in several arrangements, many with reversed images. Artists, designers, illustrators, students, and teachers will find this indispensable collection of 360 traditional Japanese designs and motifs rendered in clean, crisp, black-and-white, copyright-free illustrations to be a remarkably fertile source of illustrative inspiration and design solutions","last_updated":"2018-09-02T12:13:12.687Z","parsed":{"xt":"urn:btih:e0c5f2c2d5a62c3874861d81bd7cf15cd4ac4724","dn":"Japanese Designs and Motifs by Carol Belanger Grafton (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e0c5f2c2d5a62c3874861d81bd7cf15cd4ac4724","infoHashBuffer":{"type":"Buffer","data":[224,197,242,194,213,166,44,56,116,134,29,129,189,124,241,92,212,172,71,36]},"name":"Japanese Designs and Motifs by Carol Belanger Grafton (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}