{"title":"The Healing Power of Mindfulness by Jon Kabat Zinn (.epub)","magnet":"magnet:?xt=urn:btih:e1d31af3cb67fa345b2b881be9219ab28e5d31b6&dn=The+Healing+Power+of+Mindfulness+by+Jon+Kabat+Zinn+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"1545131","seeders":"0","leechers":"0","description":"The Healing Power of Mindfulness: A New Way of Being by Jon Kabat-Zinn\r\n\r\nRequirements: .ePUB reader\r\n\r\nOverview: Discover how mindfulness can help you with healing.\r\n\r\nMore than twenty years ago, Jon Kabat-Zinn showed us the value of cultivating greater awareness in everyday life with his now-classic introduction to mindfulness, Wherever You Go, There You Are. Now, in The Healing Power of Mindfulness, he shares a cornucopia of specific examples as to how the cultivation of mindfulness can reshape your relationship with your own body and mind&#x2013;explaining what we&apos;re learning about neuroplasticity and the brain, how meditation can affect our biology and our health, and what mindfulness can teach us about coming to terms with all sorts of life challenges, including our own mortality, so we can make the most of the moments that we have. \r\n\r\nOriginally published in 2005 as part of a larger book titled Coming to Our Senses, The Healing Power of Mindfulness features a new foreword by the author and timely updates throughout the text. If you are interested in learning more about how mindfulness as a way of being can help us to heal, physically and emotionally, look no further than this deeply personal and also &quot;deeply optimistic book, grounded in good science and filled with practical recommendations for moving in the right direction&quot; (Andrew Weil, MD), from one of the pioneers of the worldwide mindfulness movement.\r\n\r\nGenre: Non-Fiction &gt; Health, Fitness &amp; Medical","last_updated":"2018-11-21T12:18:38.817Z","parsed":{"xt":"urn:btih:e1d31af3cb67fa345b2b881be9219ab28e5d31b6","dn":"The Healing Power of Mindfulness by Jon Kabat Zinn (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e1d31af3cb67fa345b2b881be9219ab28e5d31b6","infoHashBuffer":{"type":"Buffer","data":[225,211,26,243,203,103,250,52,91,43,136,27,233,33,154,178,142,93,49,182]},"name":"The Healing Power of Mindfulness by Jon Kabat Zinn (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}