{"title":"Shook One: Anxiety Playing Tricks .. by Charlamagne Tha God EPUB","magnet":"magnet:?xt=urn:btih:e1e3a8dbefee3b04eb2bcdd8194824e0f5d1aec7&dn=Shook+One%3A+Anxiety+Playing+Tricks+..+by+Charlamagne+Tha+God+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4830739","seeders":"0","leechers":"0","description":"xx\r\n\r\nShook One: Anxiety Playing Tricks on Me by Charlamagne Tha God EPUB\r\n\r\nCharlamagne Tha God, New York Times best-selling author of Black Privilege and cohost of Power 105.1&#x2019;s The Breakfast Club, reveals his blueprint for breaking free from your fears and anxiety to reach that elusive next level of success.\r\n\r\nFear is holding you back. It&#x2019;s time to turn the tables and channel your fears to actually fuel your success.\r\n\r\nBeing &#x201C;shook&#x201D; is more than a rap lyric for Charlamagne; it&#x2019;s his mission to overcome. While it may seem like he is ahead of the game and should have nothing to worry about, he is still plagued by anxieties - fear of being weak; fear of being a bad dad; fear of being a worse husband; and, ultimately, fear of failure. Shook One chronicles his journey to beat back those fears and empowers you to no longer be held back from your potential.\r\n\r\nShook One details the ways anxiety has been a driving force in Charlamagne&#x2019;s life since childhood. For many years, he stressed over what he thought were personal shortcomings: being unpopular in school, potential rejection by women, being ugly, and, worst of all, falling into the life of stagnation or crime that caught up so many of his friends and family in his hometown of Moncks Corner, South Carolina.\r\n\r\nEven after achieving national prominence as a radio personality, Charlamagne still found himself paralyzed by thoughts that he wouldn&#x2019;t be able to take his career to the next level. But now, in Shook One, he is working through these problems with help from mentors, guests on his show, and therapy. He knows therapy and showing weakness are anxiety-producing in the black community, but this is one of the reasons he wants to own his truth - to clear a path for others in hopes they won&#x2019;t feel shame while dealing openly with their mental health. \r\n\r\nxx","last_updated":"2018-10-25T12:33:47.197Z","parsed":{"xt":"urn:btih:e1e3a8dbefee3b04eb2bcdd8194824e0f5d1aec7","dn":"Shook One: Anxiety Playing Tricks .. by Charlamagne Tha God EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e1e3a8dbefee3b04eb2bcdd8194824e0f5d1aec7","infoHashBuffer":{"type":"Buffer","data":[225,227,168,219,239,238,59,4,235,43,205,216,25,72,36,224,245,209,174,199]},"name":"Shook One: Anxiety Playing Tricks .. by Charlamagne Tha God EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}