{"title":"PC.Building.Simulator.v0.8.1.4.Multilang","magnet":"magnet:?xt=urn:btih:e1f1b2229071b89ec843283c939ff604413363ba&dn=PC.Building.Simulator.v0.8.1.4.Multilang&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"mrding2","categoryP":"games","categoryS":"pc","size":"990633530","seeders":"7","leechers":"1","description":"Have you ever wanted to build a gaming PC but didn&apos;t want to go through the hassle of buying components and unpacking boxes?\r\nWouldn&apos;t the whole process be easier if you could just select your parts from a menu and slot them into place with the click of a mouse?\r\nNo, I&apos;m not talking about using a custom pre-built service. The answer is PC Building Simulator\r\n\r\nTrue to the legacy of classic flight sims or the more modern trucking simulators, PC Building Simulator is relatively realistic when it comes to simulating putting together a gaming PC.\r\nSure, all you&apos;re doing is selecting parts from a menu and clicking them into place, but just as flight sims make you flip all the switches and turn all the knobs,\r\n PCBS has you screwing in motherboard standoffs and manually connecting MOLEX cables. \r\n\r\nThe game&apos;s still in a pretty rough state there isn&apos;t more than one option available for most parts, and some are just placeholder items that&apos;s fairly understandable\r\n considering it&apos;s listed as being in a pre-alpha state.\r\nJudging by the menus, it looks like there&apos;s a full career mode planned, presumably where you&apos;ll try to eke out a living as a custom PC builder,\r\n accepting incoming purchase orders and assembling rigs for your customers.\r\nIt remains to be seen how much more the current systems will be fleshed out, as well. For my part, \r\nI think it&apos;d be pretty cool to have options for manual cable management critical but often overlooked aspect of a well-put-together PC build. \r\n\r\nEither way, it&apos;s a pretty cool little game, especially if you dig tinkering simulators like My Summer Car.\r\nAnd if the part inventory gets fleshed out considerably, it&apos;d be really cool to have this sort of 3D testing interface to complement the process of putting together a rig on PC Part Picker","last_updated":"2018-05-28T12:07:57.011Z","parsed":{"xt":"urn:btih:e1f1b2229071b89ec843283c939ff604413363ba","dn":"PC.Building.Simulator.v0.8.1.4.Multilang","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e1f1b2229071b89ec843283c939ff604413363ba","infoHashBuffer":{"type":"Buffer","data":[225,241,178,34,144,113,184,158,200,67,40,60,147,159,246,4,65,51,99,186]},"name":"PC.Building.Simulator.v0.8.1.4.Multilang","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}