{"title":"For my Father (Israel) 2008 480p H.264 (moviesbyrizzo upload)","magnet":"magnet:?xt=urn:btih:e27da450e6e840ab2d717eee73fbf55c27493eb5&dn=For+my+Father+%28Israel%29+2008+480p+H.264+%28moviesbyrizzo+upload%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"moviesbyrizzo","categoryP":"video","categoryS":"movies","size":"999482260","seeders":"0","leechers":"0","description":"Stars Israeli actors  Shredi Jabarin and  Hili Yalon\r\n\r\n720 X 400 H.264 MP4 video viewed tonight at kanopy.com\r\nIn Arabic and Hebrew with hardcoded English subtitles\r\n\r\nThis is a movie about a misguided Arab man who is sent into Israel in order to cause harm to people there by detonating and explosive and blowing himself up with as many people he might find in a crowd at a market in what would be indiscriminate killing of innocent people by such means as this. The people who send him in seem bent on killing with little regard even to this man&apos;s life also as they are desperate we are told given the lack of progress with their political demands mainly, historically .\r\n\r\nThe movie is titled &quot;For my father&quot; as it is, we are told for the financial benefit promised his ailing father and dependent mother - from a poor Arab family given their living conditions there often with little prospect of maintaining their spirit in dignity at times no doubt I believe in any event.\r\n\r\nThe Arab man sent in to kill befriends a few of the people in the Jewish community\r\nhe enters into, and most especially a beautifully spirited and charmingly attractive Jewish gal (Hili Yalon) who he is certainly not wanting to kill as we can see from his attentiveness to her, and kindness with caution for her safety at appropriate times as we see.\r\n\r\nI have met some lovely folks from Lebanon etc in my time and I must say\r\nthat all too many Arabs are often tainted with negativity in western media\r\nwho just don&apos;t deserve to be as they are beautiful human beings I find\r\nin many respects and numbers too I would add.\r\n\r\nBut there are those that give everyone there a bad rap - like the terrorists\r\nwe hear about now and then (ISIS militants and the like). I do hope\r\nthe world will find a way eventually to cleanse the area of this element\r\nwhich causes harm to arabs and non arabs alike and help bring\r\na lasting peace to the middle east benefiting both good Arab and Jewish\r\nfolks such as the stars in our movie here  Shredi Jabarin and  Hili Yalon\r\nI certainly would never stand for any harm to come to either of them\r\n(her especially of course - speaking as a man of chivalry after all) if there\r\nwas anything I could do as a well wisher to all good and decent of our\r\ngenuinely greatly spirited folks there - whoever they may be too.\r\n\r\nPlease seed if you can\r\n\r\nMichael Rizzo Chessman\r\n(moviesbyrizzo)","last_updated":"2018-09-08T12:05:57.145Z","parsed":{"xt":"urn:btih:e27da450e6e840ab2d717eee73fbf55c27493eb5","dn":"For my Father (Israel) 2008 480p H.264 (moviesbyrizzo upload)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e27da450e6e840ab2d717eee73fbf55c27493eb5","infoHashBuffer":{"type":"Buffer","data":[226,125,164,80,230,232,64,171,45,113,126,238,115,251,245,92,39,73,62,181]},"name":"For my Father (Israel) 2008 480p H.264 (moviesbyrizzo upload)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}