{"title":"A Force for Good by Daniel Goleman EPUB","magnet":"magnet:?xt=urn:btih:e2abbcec8e80f8d357be9e8e884323ab3ee1cd6e&dn=A+Force+for+Good+by+Daniel+Goleman+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"975930","seeders":"0","leechers":"0","description":"xx\r\n\r\nA Force for Good by Daniel Goleman EPUB\r\n\r\nFor more than half a century, in such books as The Art of Happiness and The Dalai Lama&apos;s Little Book of Inner Peace, the Dalai Lama has guided us along the path to compassion and taught us how to improve our inner lives. In A Force for Good, with the help of his longtime friend Daniel Goleman, the New York Times best-selling author of Emotional Intelligence, the Dalai Lama explains how to turn our compassionate energy outward. This revelatory and inspiring work provides a singular vision for transforming the world in practical and positive ways.\r\n\r\nMuch more than just the most prominent exponent of Tibetan Buddhism, the 14th Dalai Lama is also a futurist who possesses a profound understanding of current events and a remarkable canniness for modern social issues. When he takes the stage worldwide, people listen. A Force for Good combines the central concepts of the Dalai Lama, empirical evidence that supports them, and true stories of people who are putting his ideas into action - showing how harnessing positive energies and directing them outward has lasting and meaningful effects. Goleman details the science of compassion and how this singular guiding motivation has the power to:\r\n\r\nBreak such destructive social forces as corruption, collusion, and bias\r\n\r\nHeal the planet by refocusing our concerns toward our impact on the systems that support all life\r\n\r\nReverse the tendency toward systemic inequity through transparency and accountability\r\n\r\nReplace violence with dialogue\r\n\r\nCounter us-and-them thinking by recognizing human oneness\r\n\r\nCreate new economic systems that work for everyone, not just the powerful and rich\r\n\r\nDesign schooling that teaches empathy, self-mastery, and ethics\r\n\r\nxx","last_updated":"2018-05-20T12:01:14.861Z","parsed":{"xt":"urn:btih:e2abbcec8e80f8d357be9e8e884323ab3ee1cd6e","dn":"A Force for Good by Daniel Goleman EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e2abbcec8e80f8d357be9e8e884323ab3ee1cd6e","infoHashBuffer":{"type":"Buffer","data":[226,171,188,236,142,128,248,211,87,190,158,142,136,67,35,171,62,225,205,110]},"name":"A Force for Good by Daniel Goleman EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}