{"title":"RadioMaximus Pro 2.23.5 Multilingual + Medicine[BabuPC]","magnet":"magnet:?xt=urn:btih:e2c7f6d8c31004146e9b6f91051c1025a25cc36d&dn=RadioMaximus+Pro+2.23.5+Multilingual+%2B+Medicine%5BBabuPC%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BabuPC","categoryP":"applications","categoryS":"windows","size":"39012180","seeders":"6","leechers":"2","description":"\r\n[img]http://babupc.com/wp-content/uploads/2018/10/RadioMaximus-Pro.gif[/img]\r\n\r\nRadioMaximus Pro\r\n\r\nRadioMaximus &#x2013; Maximum radio and a whole lot more. With RadioMaximus you can receive and record thousands of radio stations available on the Internet.\r\n\r\nRadioMaximus is a comprehensive application that integrates online radio stations for your entertainment. It is oriented toward users of any skill level.\r\nAt the beginning of the installation procedure, RadioMaximus gives you the possibility of installing it as a portable product.\r\nThe tool is wrapped in a standard interface with a well-organized layout and intuitive features. The radio library allows you to select new, featured, recently played or currently playing stations, as well as to use a search function.\r\n\r\nYou can sort radio channels by their name, genre or tags, country of origin, stream type, bit rate or by the last played date. Adding a new station to the list can be done by specifying all these fields, together with the URL in question and comment on your behalf.\r\nAdditional features of RadioMaximus let you view connection log details, create favorite lists, record stream and schedule recordings (to RAW, MP3, AAC, WMA or OGG), clean up recordings, import and export XML Database files, as well as schedule a timer for stopping the playback, exiting or for power management functions (shutdown, sleep, hibernate).\r\n\r\nRadioMaximus supports volume normalization and toolbar customization, along with multiple themes and languages for the GUI. It is backed by a help file and consumes a moderate quantity of CPU and system memory. We have not across any issues throughout our testing, since the program did not hang, crash or display error notifications. To sum it up, RadioMaximus includes some rich feature to please the entire audience.\r\nFeatures","last_updated":"2018-10-28T12:19:56.736Z","parsed":{"xt":"urn:btih:e2c7f6d8c31004146e9b6f91051c1025a25cc36d","dn":"RadioMaximus Pro 2.23.5 Multilingual   Medicine[BabuPC]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e2c7f6d8c31004146e9b6f91051c1025a25cc36d","infoHashBuffer":{"type":"Buffer","data":[226,199,246,216,195,16,4,20,110,155,111,145,5,28,16,37,162,92,195,109]},"name":"RadioMaximus Pro 2.23.5 Multilingual   Medicine[BabuPC]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}