{"title":"The Map of Salt and Stars by Jennifer Zeynab Joukhadar EPUB","magnet":"magnet:?xt=urn:btih:e3119bc16b9cb1c6a97931b7c07a0b23168b36ae&dn=The+Map+of+Salt+and+Stars+by+Jennifer+Zeynab+Joukhadar+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"8616311","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Map of Salt and Stars by Jennifer Zeynab Joukhadar EPUB\r\n\r\nThis rich, moving, and lyrical debut novel is to Syria what The Kite Runner was to Afghanistan; the story of two girls living 800 years apart - a modern-day Syrian refugee seeking safety and a medieval adventurer apprenticed to a legendary mapmaker - places today&apos;s headlines in the sweep of history, where the pain of exile and the triumph of courage echo again and again. \r\n\r\nIt is the summer of 2011, and Nour has just lost her father to cancer. Her mother, a cartographer who creates unusual, hand-painted maps, decides to move Nour and her sisters from New York City back to Syria to be closer to their family. But the country Nour&apos;s mother once knew is changing, and it isn&apos;t long before protests and shelling threaten their quiet Homs neighborhood. When a shell destroys Nour&apos;s house and almost takes her life, she and her family are forced to choose: stay and risk more violence or flee as refugees across seven countries of the Middle East and North Africa in search of safety. As their journey becomes more and more challenging, Nour&apos;s idea of home becomes a dream she struggles to remember and a hope she cannot live without. \r\n\r\nMore than 800 years earlier, Rawiya, 16 and a widow&apos;s daughter, knows she must do something to help her impoverished mother. Restless and longing to see the world, she leaves home to seek her fortune. Disguising herself as a boy named Rami, she becomes an apprentice to al-Idrisi, who has been commissioned by King Roger II of Sicily to create a map of the world. In his employ, Rawiya embarks on an epic journey across the Middle East and the north of Africa, where she encounters ferocious mythical beasts, epic battles, and real historical figures. \r\n\r\nA deep immersion into the richly varied cultures of the Middle East and North Africa, The Map of Salt and Stars follows the journeys of Nour and Rawiya as they travel along identical paths across the region 800 years apart, braving the unknown beside their companions as they are pulled by the promise of reaching home at last. \r\n\r\nxx","last_updated":"2018-05-03T12:00:38.684Z","parsed":{"xt":"urn:btih:e3119bc16b9cb1c6a97931b7c07a0b23168b36ae","dn":"The Map of Salt and Stars by Jennifer Zeynab Joukhadar EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e3119bc16b9cb1c6a97931b7c07a0b23168b36ae","infoHashBuffer":{"type":"Buffer","data":[227,17,155,193,107,156,177,198,169,121,49,183,192,122,11,35,22,139,54,174]},"name":"The Map of Salt and Stars by Jennifer Zeynab Joukhadar EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}