{"title":"A Better Me: The Official Autobiography by Gary Barlow EPUB","magnet":"magnet:?xt=urn:btih:e37d763a6c659ffbc378c997cb2c1acec5ccfaa7&dn=A+Better+Me%3A+The+Official+Autobiography+by+Gary+Barlow+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"9336229","seeders":"1","leechers":"0","description":"xx\r\n\r\nA Better Me: The Official Autobiography by Gary Barlow EPUB\r\n\r\nGary Barlow is one of the most successful British musicians and songwriters of all time, but 15 years ago, as he himself admits, he hit rock bottom - he was out of shape, out of work, depressed. Food for him had become an addiction, a means not only of comfort but almost of self-medication as he grappled with the cruel twists of fate of musical stardom. In 2003, as he struggled with the disappointment of an underperforming solo career alongside the tireless media taunts, Gary turned to food. Relentlessly. In the space of nine years he had been on 20 diets in the hopes of a resolution to all his woes. After asking the doctor what the &apos;cure&apos; for obesity was, it sunk in that he was the only one who could take control of his health. Gary describes this realisation and the task that lay ahead - &apos;it was like being at the foot of a massive mountain&apos;.\r\n\r\nSo how did he go from an obese, out-of-work and depressed pop icon to a superstar of music and TV and an accomplished musical songwriter and producer who is full of vitality, fitter, happier and more successful than ever before? What happened?\r\n\r\nIn his extraordinarily honest memoir, A Better Me, Gary tells of his journey back to professional success and mental and physical health. From reforming Take That to critical and commercial acclaim and reigniting his own legendary songwriting career; to overcoming his weight problems and crippling obsession with food; to TV judging panel stardom on The X Factor and Let It Shine and at last finding balance in both his personal and professional lives.\r\n\r\nA Better Me is a remarkably frank memoir of Gary&apos;s life as he battled with weight, stress, fitness and depression and staged one of the most thrilling professional comebacks in years. In his warm, witty and authentic voice, he recounts his story with compelling insight, captivating honesty and a human side that people rarely see. Here is one of the UK&apos;s most beloved pop stars, open, honest and raw and as we&apos;ve never seen him before.\r\n\r\n&apos;This is the book I wished I&apos;d had to turn to.&apos; (Gary Barlow)\r\n\r\nxx","last_updated":"2018-10-23T12:15:14.293Z","parsed":{"xt":"urn:btih:e37d763a6c659ffbc378c997cb2c1acec5ccfaa7","dn":"A Better Me: The Official Autobiography by Gary Barlow EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e37d763a6c659ffbc378c997cb2c1acec5ccfaa7","infoHashBuffer":{"type":"Buffer","data":[227,125,118,58,108,101,159,251,195,120,201,151,203,44,26,206,197,204,250,167]},"name":"A Better Me: The Official Autobiography by Gary Barlow EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}