{"title":"I nostri ragazzi (Italian - 2014) 720p H.264 (moviesbyrizzo)  ","magnet":"magnet:?xt=urn:btih:e43ae0997d0d752e101e13c35df0344aa00a2aef&dn=I+nostri+ragazzi+%28Italian+-+2014%29+720p+H.264+%28moviesbyrizzo%29++&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"moviesbyrizzo","categoryP":"video","categoryS":"hd___movies","size":"1730771428","seeders":"0","leechers":"0","description":" <a href=\"https://www.imdb.com/title/tt3561348/\" rel=\"nofollow\" target=\"_NEW\">https://www.imdb.com/title/tt3561348/</a>\r\n\r\nThis movie set in Italy opens with a shooting by an undercover policeman of\r\na man in a road rage incident involving the policeman too.\r\n\r\nWhen a similar attack brings the son and daughter of two Italian professional \r\n(lawyer and doctor) family men into a potentially murder situation, their conflicting conflicts between duty to the state and decency and that of filial protection of an ancient mindset which still is strongly believed in on the \r\nplanet in many parts although not with as much fervour perhaps as is depicted considering the final outcome of this movie.\r\n\r\nThere are some truly disturbing words spoken by the teenage girl depicted as she is scripted to have amused herself with a thought that they might perhaps have even gone so far as &quot;setting their victim on fire&quot; in what was already deemed pretty much a display of gratuitous lethal violence by the two teenagers involved. That&apos;s a display of an ugly spirit that may in fact be harboured by some such gals on the planet, no doubt, but its a dangerous stereotype to indulge with if it isn&apos;t valid enough to posit as depicted for the hidden personality \r\nof the girl in question, which requires an educated attitude in response (for all thereby concerned).\r\n\r\nThen there is the comment by the wife of the doctor that she wished she had a\r\nscalpel from her husbands medical kit so that she could perhaps cut off someones\r\n(a waiter) finger in a moment of anger and or frustration it would appear.\r\n\r\nItalian men shown as quite often venting openly about their frustrations so as to get an issue resolved honestly and completely and without reservation does have its merits as a style when combating evil in their midst or a lack of sanity\r\nbeing shown perhaps by those there that don&apos;t engage the right mindset against\r\nothers of their community members at times. No harm done if good folks don&apos;t suffer from such outbursts and good prevails in the end.\r\n\r\nUltimately I do think we will end up finding that the best sanity could potentially be seen prevailing for the folks in Italy provided resources\r\nto combat unfairness in resource allocation on the planet in favour of \r\nthe most idealistic disposition is adopted instead, and clear efforts are made \r\nto eliminate all instances of evil in their midst towards the best human spirit \r\nand anywhere else on the planet, thereby benefitting the best of men certainly\r\nthat you fill find there and elsewhere such minds exist, I&apos;m sure, along with\r\nsuch others that have their best intentions at heart as I for one fully believe will be most greatly shown by the men of Italy and related ones on the planet\r\nwhen the chips are finally down I say. These are the best of men I believe at\r\nthe end of it all, when right thinking prevails at some point on the planet too.\r\n\r\nPlease seed kindly, grazie\r\n\r\nMichael Rizzo Chessman\r\n(moviesbyrizzo)","last_updated":"2018-10-03T12:05:46.298Z","parsed":{"xt":"urn:btih:e43ae0997d0d752e101e13c35df0344aa00a2aef","dn":"I nostri ragazzi (Italian - 2014) 720p H.264 (moviesbyrizzo)  ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e43ae0997d0d752e101e13c35df0344aa00a2aef","infoHashBuffer":{"type":"Buffer","data":[228,58,224,153,125,13,117,46,16,30,19,195,93,240,52,74,160,10,42,239]},"name":"I nostri ragazzi (Italian - 2014) 720p H.264 (moviesbyrizzo)  ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}