{"title":"Commander X - Mind Matrix: Covert Electronic Harassment Mind Co","magnet":"magnet:?xt=urn:btih:e4c9d401acb6143f7ca612d86d247b6d2fc3dc1a&dn=Commander+X+-+Mind+Matrix%3A+Covert+Electronic+Harassment+Mind+Co&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"roflcopter2110","categoryP":"other","categoryS":"e_books","size":"3459223","seeders":"20","leechers":"6","description":"Commander X - Mind Matrix: Covert Electronic Harassment Mind Control Program (pdf) - roflcopter2110\r\n <a href=\"\nhttps://extraimage.net/images/2018/01/28/e3b6b52e015bd304aa53df7e18df816d.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://extraimage.net/images/2018/01/28/e3b6b52e015bd304aa53df7e18df816d.jpg</a>\r\n\r\nARE YOU THE VICTIM OF ELECTRONIC WARFARE?\r\n\r\nAs one researcher put it, Electromagnetic weapons operate at the speed of light, they can kill, torture and enslave, but the public is largely unaware that they exist, because these weapons operate by stealth and leave no physical evidence.\r\n\r\nDo you feel as if Big Brother is watching you?\r\n\r\nIs that voice in your head getting louder and louder?\r\n\r\nIs your TV talking back to you?\r\n\r\nAre you seeing things, that are not supposed to be there, but are?\r\n\r\nAnd what about that satellite that passes by your window at least twice a day?\r\n\r\nIf you have serious concerns about such issues, you may be part of the New World Order&apos;s Mind Matrix Maintenance Program that is responsible for keeping tabs on thousands of individuals and which can remotely monitor and alter your brain waves to make you part of a global enslavement movement.\r\n\r\nA Former Intelligence Officer put it quite simply: They don&apos;t have to come inside your house.\r\n\r\nThe eavesdropper can simply use a GPS tracking device to perform electronic harassment and view everything about your life while you are in your car, shopping, or eating at a restaurant.\r\n\r\nThey have full view of the inside of your home or business office online and it doesn&apos;t matter if the lights are off or what room you are in.\r\n\r\nIt is all in full view for your enemies and their allies, complete with your telephone conversations!\r\n\r\nMIND MATRIX: COVERT ELECTRONIC HARASSMENT MIND CONTROL PROGRAM is without a doubt the most complete work on the subject of electronic mind control techniques, mind games, case studies of individuals stricken by a super secret intelligence bent on destroying individual lives, as well as a detailed list of 100 U.S. Patents involving psychotronic devices that can impinge on your personal freedom","last_updated":"2018-01-28T12:05:34.468Z","parsed":{"xt":"urn:btih:e4c9d401acb6143f7ca612d86d247b6d2fc3dc1a","dn":"Commander X - Mind Matrix: Covert Electronic Harassment Mind Co","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e4c9d401acb6143f7ca612d86d247b6d2fc3dc1a","infoHashBuffer":{"type":"Buffer","data":[228,201,212,1,172,182,20,63,124,166,18,216,109,36,123,109,47,195,220,26]},"name":"Commander X - Mind Matrix: Covert Electronic Harassment Mind Co","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}