{"title":"American Wife by Taya Kyle, Jim DeFelice AZW","magnet":"magnet:?xt=urn:btih:e4ebf1ede0421be4b12738a80adaafc1b8570f6e&dn=American+Wife+by+Taya+Kyle%2C+Jim+DeFelice+AZW&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2099167","seeders":"29","leechers":"1","description":"xx\r\n\r\nAmerican Wife by Taya Kyle, Jim DeFelice AZW\r\n\r\nThe widow of American Sniper Chris Kyle shares their private journey, a moving and universal chronicle of love and family, service and patriotism, grief and sacrifice, faith and purpose.\r\n\r\nHow does someone carry on after the death of a hero?\r\n\r\nBy becoming a hero herself.\r\n\r\nThough Chris and Taya Kyle&apos;s marriage had its difficult moments, it was always a love story. Together they&apos;d endured military service, a best-selling book, unexpected fame, and a film deal starring a hot Hollywood actor. But just when Taya thought that she and Chris were finally going to live their dream together, her husband was murdered. In the wake of his death, a grieving Taya was left to raise her two young children and handle the many things Chris left behind: the business, the book, the movie, and a myriad of legal issues.\r\n\r\nMatching the straightforward, soul-baring style of American Sniper, Taya talks with honesty about the trials and triumphs of her life with and without Chris - the sleepless nights as a military spouse, the exhilaration as her husband was lionized, the quiet moments when family sheltered them from the madness of fame, the joy of discovering her own purpose in harmony with Chris&apos; own legacy. In American Wife she recounts the struggles and looks toward the future, revealing the intimate story of her marriage and the inspirations that have given her strength. She speaks out on the effects of fame, both good and bad, and provides a road map for others faced with difficulties big and small.\r\n\r\nAmerican Wife is a startling and affecting portrait of a woman of grit and determination - an example we can all follow to become heroes in our own lives.\r\n\r\nxx","last_updated":"2018-06-17T12:03:16.672Z","parsed":{"xt":"urn:btih:e4ebf1ede0421be4b12738a80adaafc1b8570f6e","dn":"American Wife by Taya Kyle, Jim DeFelice AZW","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e4ebf1ede0421be4b12738a80adaafc1b8570f6e","infoHashBuffer":{"type":"Buffer","data":[228,235,241,237,224,66,27,228,177,39,56,168,10,218,175,193,184,87,15,110]},"name":"American Wife by Taya Kyle, Jim DeFelice AZW","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}