{"title":"The Third Door by Alex Banayan EPUB","magnet":"magnet:?xt=urn:btih:e7efe73b8df66af7ecefb1802faeb6769cb421cd&dn=The+Third+Door+by+Alex+Banayan+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1290928","seeders":"0","leechers":"1","description":"xx\r\n\r\nThe Third Door by Alex Banayan EPUB\r\n\r\nThe larger-than-life journey of an 18-year-old college freshman who set out from his dorm room to track down Bill Gates, Lady Gaga, and dozens more of the world&#x2019;s most successful people to uncover how they broke through and launched their careers. \r\n\r\nThe Third Door takes readers on an unprecedented adventure - from hacking Warren Buffett&#x2019;s shareholders meeting to chasing Larry King through a grocery store to celebrating in a nightclub with Lady Gaga - as Alex Banayan travels from icon to icon, decoding their success. After remarkable one-on-one interviews with Bill Gates, Maya Angelou, Steve Wozniak, Jane Goodall, Larry King, Jessica Alba, Pitbull, Tim Ferriss, Quincy Jones, and many more, Alex discovered the one key they have in common: they all took the Third Door.  \r\n\r\nLife, business, success&#x2026; it&#x2019;s just like a nightclub. There are always three ways in. There&#x2019;s the First Door: the main entrance, where 99 percent of people wait in line, hoping to get in. The Second Door: the VIP entrance, where the billionaires and celebrities slip through. But what no one tells you is that there is always, always&#x2026; the Third Door. It&#x2019;s the entrance where you have to jump out of line, run down the alley, bang on the door 100 times, climb over the dumpster, crack open the window, sneak through the kitchen - there&#x2019;s always a way in. Whether it&#x2019;s how Bill Gates sold his first piece of software or how Steven Spielberg became the youngest studio director in Hollywood history, they all took the Third Door.\r\n\r\nxx","last_updated":"2018-06-11T12:00:44.896Z","parsed":{"xt":"urn:btih:e7efe73b8df66af7ecefb1802faeb6769cb421cd","dn":"The Third Door by Alex Banayan EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e7efe73b8df66af7ecefb1802faeb6769cb421cd","infoHashBuffer":{"type":"Buffer","data":[231,239,231,59,141,246,106,247,236,239,177,128,47,174,182,118,156,180,33,205]},"name":"The Third Door by Alex Banayan EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}