{"title":"The Deep State [2018] - Jason Chaffetz","magnet":"magnet:?xt=urn:btih:e8590be3e80e32b38c23fa801f9dc6586567c6e5&dn=The+Deep+State+%5B2018%5D+-+Jason+Chaffetz&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ComGetMe","categoryP":"audio","categoryS":"audio_books","size":"218028632","seeders":"2","leechers":"2","description":"\r\n [How an Army of Bureaucrats protected Barack Obama and is Working to Destroy the Trump Agenda]\r\n\r\nFormer Congressman Jason Chaffetz explains how we ended up with a politicized federal bureaucracy that actively works to promote the Democrat party agenda and undermine Donald Trump.\r\n\r\nThe liberal media loves to characterize the Obama years as free of scandal. They pretend this is true because virtually every office in the executive branch worked to withhold evidence of wrongdoing, silence witness testimony, destroy federal records and classify embarrassing information. These same lifers leaked like a sieve once President Trump was sworn in, promoting the illusion that everything he does is the new Watergate.\r\n\r\nIn Deep State, Jason Chaffetz reveals an entrenched leadership within the civil service that resists exposure, accountability, and responsibility. At the highest levels, they fight back, outlast, and work the system for their own advantage. And they certainly don&#x2019;t like disruptive forces such as Donald Trump.\r\n\r\nAs Chairman of the House Oversight Committee, Chaffetz was the tip of the spear challenging the Deep State and trying to hold them accountable. He and his colleagues took on the powerful forces at the IRS, the EPA, the DOJ, the Department of State, and more. The deeper he dove in, the more shocking he found the brazen approach by the power brokers.\r\n\r\nChaffetz highlights the Deep State&#x2019;s tactics, illuminates the problems, and offers a way to fight back and win.\r\n\r\nNarrated By: Jason Chaffetz","last_updated":"2018-09-20T12:03:55.657Z","parsed":{"xt":"urn:btih:e8590be3e80e32b38c23fa801f9dc6586567c6e5","dn":"The Deep State [2018] - Jason Chaffetz","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e8590be3e80e32b38c23fa801f9dc6586567c6e5","infoHashBuffer":{"type":"Buffer","data":[232,89,11,227,232,14,50,179,140,35,250,128,31,157,198,88,101,103,198,229]},"name":"The Deep State [2018] - Jason Chaffetz","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}