{"title":"BlueGriffon EPUB 3.0.1 (x86x64) Multilingual Full With Medicine[","magnet":"magnet:?xt=urn:btih:e864f2365e4930e8d3f5d1c153552a370bee989f&dn=BlueGriffon+EPUB+3.0.1+%28x86x64%29+Multilingual+Full+With+Medicine%5B&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BabuPC","categoryP":"applications","categoryS":"windows","size":"124558831","seeders":"2","leechers":"1","description":"Description: BlueGriffon is a multilingual web editor that provides a forthright working environment for creating professional-looking webpages. Its compatibility range extends to the latest standards and technologies, allowing the creation of HTML 4 and 5 documents, as well as XHTML 1, 1.1 and 5, compatible with all major browsers. What is more, the application makes it possible for you to easily create and edit EPUB2, EPUB3 and EPUB 3.1 ebooks.\r\n\r\nFeature-packed yet very novice-accessible web content editor\r\nThe application bundles a diverse collection of templates that can represent the starting point in new web design endeavors, while advanced users can code a webpage from scratch. Alternatively, the integrated wizard can guide you throughout the process of configuring your new project, from choosing its type and entering the document properties to customizing appearance and layout.\r\n\r\nAside from text, pages can include tables, images imported from the local computer, links, anchors, bars and forms, HTML markup, tables of contents, comments and PHP. Providing support for the HTML5 standard, BlueGriffon allows you to insert specific elements, such as articles, buttons, labels, forms and embed audio and video content into your page.\r\n\r\nAccurately tweak, analyze and edit webpages with the help of BlueGriffon&#x2019;s extensive set of tools\r\nAs expected, BlueGriffon allows the preview of the webpage in browser mode, as well as source mode, enabling more experienced designers to edit the code directly.\r\n\r\nThe editor features basic text formatting options and automatic spell checking, offering you the freedom to customize the final look of the webpage according to your preferences. It can emphasize text sections, find acronyms, manage links and let you experiment with various style properties to view the color, geometry and layout combination you like best","last_updated":"2018-07-22T12:06:11.195Z","parsed":{"xt":"urn:btih:e864f2365e4930e8d3f5d1c153552a370bee989f","dn":"BlueGriffon EPUB 3.0.1 (x86x64) Multilingual Full With Medicine[","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e864f2365e4930e8d3f5d1c153552a370bee989f","infoHashBuffer":{"type":"Buffer","data":[232,100,242,54,94,73,48,232,211,245,209,193,83,85,42,55,11,238,152,159]},"name":"BlueGriffon EPUB 3.0.1 (x86x64) Multilingual Full With Medicine[","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}