{"title":"Look Me in the Eye: My Life with Asperger's by John Robison EPUB","magnet":"magnet:?xt=urn:btih:e91abb227b6e04686db5d247b8841f227258e714&dn=Look+Me+in+the+Eye%3A+My+Life+with+Asperger%27s+by+John+Robison+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2291012","seeders":"0","leechers":"0","description":"xx\r\n\r\nLook Me in the Eye: My Life with Asperger&apos;s by John Robison EPUB\r\n\r\nEver since he was small, John Robison had longed to connect with other people. But by the time he was a teenager, his odd habits, including an inclination to blurt out non sequiturs, avoid eye contact, dismantle radios, and dig five-foot holes, had earned him the label &quot;social deviant&quot;. No guidance came from his mother or his father. It was no wonder he gravitated to machines, which could, at least, be counted on.\r\n\r\nAfter fleeing his parents and dropping out of high school, his savant-like ability to visualize electronic circuits landed him a gig with KISS. Later, he drifted into a &quot;real&quot; job, as an engineer for a major toy company. But the higher Robison rose in the company, the more he had to pretend to be &quot;normal&quot; and do what he simply couldn&apos;t: communicate. It was not until he was 40 that an insightful therapist told him he had the form of autism called Asperger&apos;s syndrome. That understanding transformed the way Robison saw himself - and the world.\r\n\r\nA born storyteller, Robison takes you inside the head of a boy teachers and other adults regarded as &quot;defective&quot;. He also provides a fascinating reverse angle on the younger brother he left at the mercy of their nutty parents: the boy who would later change his name to Augusten Burroughs.\r\n\r\nUltimately, this is the story of Robison&apos;s journey from his world into ours, and his new life as a husband, father, and successful small business owner. It&apos;s a strange, sly, indelible account, sometimes alien, yet always deeply human.\r\n\r\nxx","last_updated":"2018-03-24T12:02:08.056Z","parsed":{"xt":"urn:btih:e91abb227b6e04686db5d247b8841f227258e714","dn":"Look Me in the Eye: My Life with Asperger's by John Robison EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e91abb227b6e04686db5d247b8841f227258e714","infoHashBuffer":{"type":"Buffer","data":[233,26,187,34,123,110,4,104,109,181,210,71,184,132,31,34,114,88,231,20]},"name":"Look Me in the Eye: My Life with Asperger's by John Robison EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}