{"title":"A Handful of Happiness: How a Prickly Creature Softened a Prickl","magnet":"magnet:?xt=urn:btih:eb1a60a8019b76247d2fe2fc14987061a68914c3&dn=A+Handful+of+Happiness%3A+How+a+Prickly+Creature+Softened+a+Prickl&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"bookflare","categoryP":"other","categoryS":"e_books","size":"21181315","seeders":"12","leechers":"13","description":"Full Title: A Handful of Happiness: How a Prickly Creature Softened a Prickly Heart\r\n\r\nDescription\r\nA feel-good memior about a man and his hedgehog\r\n\r\nMassimo Vacchetta, an Italian veterinarian specializing in large animals, is recently divorced and feeling heartbroken and depressed&#x2015;until the day that someone brings an orphaned baby hedgehog into his clinic. As the tiny hedgehog cries and whimpers, Massimo immediately understands the extent of the animal&#x2019;s vulnerability and isolation. Recognizing her helplessness and desperation in himself, he connects with her in a way he&#x2019;s never connected with any other animal.\r\n\r\nIn caring for this hedgehog, Massimo uncovers her vibrant personality, and rediscovers his own. Soon, another sick hedgehog lands in his lap. And then another. As people begin to seek him out to heal and care for their injured or orphaned animals, Massimo finally discovers his life&#x2019;s mission.\r\n\r\nAs other sick hedgies are healed and released, Massimo continues to dote on Ninna like a child, constantly fretting about her health and happiness, caring about her in a way he&#x2019;s never cared about anyone or anything else. But the cage that once kept her safe soon becomes a prison, and as much as it breaks Massimo&#x2019;s heart to let her go, he knows she longs to be free.\r\n\r\nThrough this life-affirming story of a man and his hedgehog, we learn that no love is too great and no creature is too small","last_updated":"2018-07-11T12:11:13.244Z","parsed":{"xt":"urn:btih:eb1a60a8019b76247d2fe2fc14987061a68914c3","dn":"A Handful of Happiness: How a Prickly Creature Softened a Prickl","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"eb1a60a8019b76247d2fe2fc14987061a68914c3","infoHashBuffer":{"type":"Buffer","data":[235,26,96,168,1,155,118,36,125,47,226,252,20,152,112,97,166,137,20,195]},"name":"A Handful of Happiness: How a Prickly Creature Softened a Prickl","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}