{"title":"The Human Instinct by Kenneth R. Miller EPUB","magnet":"magnet:?xt=urn:btih:eb7c6032127419944928588aeb3c348da383d077&dn=The+Human+Instinct+by+Kenneth+R.+Miller+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4541942","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Human Instinct by Kenneth R. Miller EPUB\r\n\r\nA radical, optimistic exploration of how humans evolved to develop reason, consciousness, and free will.\r\n\r\nLately, the most passionate advocates of the theory of evolution seem to present it as bad news. Scientists such as Richard Dawkins, Lawrence Krauss, and Sam Harris tell us that our most intimate actions, thoughts, and values are mere byproducts of thousands of generations of mindless adaptation. We are just one species among multitudes and therefore no more significant than any other living creature.\r\n\r\nNow comes Brown University biologist Kenneth R. Miller to make the case that this view betrays a gross misunderstanding of evolution. Natural selection surely explains how our bodies and brains were shaped, but Miller argues that it&#x2019;s not a social or cultural theory of everything. In The Human Instinct, he rejects the idea that our biological heritage means that human thought, action, and imagination are predetermined, describing instead the trajectory that ultimately gave us reason, consciousness, and free will. A proper understanding of evolution, he says, reveals humankind in its glorious uniqueness - one foot planted firmly among all of the creatures we&#x2019;ve evolved alongside and the other in the special place of self-awareness and understanding that we alone occupy in the universe.\r\n\r\nEqual parts natural science and philosophy, The Human Instinct is a moving and powerful celebration of what it means to be human.\r\n\r\nxx","last_updated":"2018-05-02T12:00:49.971Z","parsed":{"xt":"urn:btih:eb7c6032127419944928588aeb3c348da383d077","dn":"The Human Instinct by Kenneth R. Miller EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"eb7c6032127419944928588aeb3c348da383d077","infoHashBuffer":{"type":"Buffer","data":[235,124,96,50,18,116,25,148,73,40,88,138,235,60,52,141,163,131,208,119]},"name":"The Human Instinct by Kenneth R. Miller EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}