{"title":"Dark Dreams: Sexual Violence, Homicide and the Criminal Mind","magnet":"magnet:?xt=urn:btih:eb8b63aca1d8710bb90b65b2855c60cd9b451e9e&dn=Dark+Dreams%3A+Sexual+Violence%2C+Homicide+and+the+Criminal+Mind&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"wormword216","categoryP":"other","categoryS":"e_books","size":"759634","seeders":"2","leechers":"73","description":"Profiler Roy Hazelwood is the world&apos;s leading expert on the strangest and most dangerous of all aberrant offenders--the sexual criminal. In Dark Dreams he reveals the twisted motives and perverse thinking that go into the most reprehensible crimes. He also catalogs the innovative and remarkably effective techniques--techniques that he helped pioneer at the FBI&apos;s Behavioral Science Unit--that allow Law Enforcement agents to construct psychological profiles of the offenders who comit them.\r\n\r\nHazelwood has helped track down some of the most violent and well known criminals in modern history; in Dark Dreams he takes readers into his world--a sinister world inhabited by scores of dangerous offenders for every Roy Hazelwood who would put them behind bars. These are sexual sadists, serial rapists, child molesters, and serial killers. The cases he describes are as shocking as they are perplexing; their resolutions are as fascinating as they are innovative:\r\n\r\n* A young woman disappears from the convenience store where she works. Her body is later found in a field, strapped to a makeshift St. Andrew&apos;s Cross and mutilated beyond description. Who committed this heinous crime? And why?\r\n\r\n* A teenager&apos;s corpse is found hanging in a storm sewer. His clothes are neatly folded by the entrance and a stopwatch lies in the grime beneath him. Is he the victim of a bizarre, ritualistic murder . . . or an elaborate masturbatory fantasy gone awry?\r\n\r\n* A married couple, driving with their toddler in the back seat, pick up a female hitchhiker. They kidnap her and for seven years keep her in a box under their bed as a sexual slave. The wife had agreed to this inhuman arrangement in exchange for a second child. Who was to blame?\r\n\r\nBut as gruesome as the crimes are and as unsettling as the odds seem, Hazelwood, writing with veteran journalsit Stephen Michaud, proves that the right amounts of determination and logic can bring even the most cunning and devious criminals to justice","last_updated":"2018-06-02T12:13:10.957Z","parsed":{"xt":"urn:btih:eb8b63aca1d8710bb90b65b2855c60cd9b451e9e","dn":"Dark Dreams: Sexual Violence, Homicide and the Criminal Mind","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"eb8b63aca1d8710bb90b65b2855c60cd9b451e9e","infoHashBuffer":{"type":"Buffer","data":[235,139,99,172,161,216,113,11,185,11,101,178,133,92,96,205,155,69,30,158]},"name":"Dark Dreams: Sexual Violence, Homicide and the Criminal Mind","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}