{"title":"Water to the Angels by Les Standiford AZW","magnet":"magnet:?xt=urn:btih:eb9991b968c5cc853d8f0ea62f1968ad31240934&dn=Water+to+the+Angels+by+Les+Standiford+AZW&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2898549","seeders":"2","leechers":"0","description":"xx\r\n\r\nWater to the Angels by Les Standiford AZW\r\n\r\nThe author of Last Train to Paradise tells the story of the largest public water project ever created - William Mulholland&apos;s Los Angeles aqueduct - a story of Gilded Age ambition, hubris, greed, and one determined man whose vision shaped the future and continues to impact us today.\r\n\r\nIn 1907 Irish immigrant William Mulholland conceived and built one of the greatest civil engineering feats in history: the aqueduct that carried water 223 miles from the Sierra Nevada mountains to Los Angeles - allowing this small, resource-challenged desert city to grow into a modern global metropolis. Drawing on new research, Les Standiford vividly captures the larger-than-life engineer and the breathtaking scope of his six-year, $23-million project that would transform a region, a state, and a nation at the dawn of its greatest century.\r\n\r\nWith energy and colorful detail, Water to the Angels brings to life the personalities, politics, and power - including bribery, deception, force, and bicoastal financial warfare - behind this dramatic event. At a time when the importance of water is being recognized as never before - considered by many experts to be the essential resource of the twenty-first century - Water to the Angels brings into focus the vigor of a fabled era, the might of a larger-than-life individual, and the scale of a priceless construction project and sheds critical light on a past that offers insights for our future.\r\n\r\nxx","last_updated":"2018-06-03T12:08:05.486Z","parsed":{"xt":"urn:btih:eb9991b968c5cc853d8f0ea62f1968ad31240934","dn":"Water to the Angels by Les Standiford AZW","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"eb9991b968c5cc853d8f0ea62f1968ad31240934","infoHashBuffer":{"type":"Buffer","data":[235,153,145,185,104,197,204,133,61,143,14,166,47,25,104,173,49,36,9,52]},"name":"Water to the Angels by Les Standiford AZW","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}