{"title":"GFRevenge - Halle Von, Bailey Bae (Cheating Together) NEW 18 Apr","magnet":"magnet:?xt=urn:btih:ec07603e551eb2792a8a1ceb0544d19999b481d8&dn=GFRevenge+-+Halle+Von%2C+Bailey+Bae+%28Cheating+Together%29+NEW+18+Apr&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"345981502","seeders":"16","leechers":"10","description":"My girlfriend Bailey had her cute best friend Halle Von over for a sleepover. The girls were just waking up and putting their faces on when I peeked in on them with my camera in hand and watched them getting ready in the bathroom. Halle was shy to be filmed, but my girlfriend Bailey didn&apos;t seem to mind. Besides, all I really wanted was to annoy these sluts enough and tell them that the only way I was going to leave them alone is if they&apos;d flash me their sweet perky tits! After a while, the girls went back to the bedroom where we decided to talk about their sleepover from the previous night--and that&apos;s when I found out that Bailey had cheated on me with Halle! I was stunned but also instantly sprung--had my girlfriend sucked another man&apos;s dick I&apos;d probably lose my shit, but the fact that she was cheating on me by eating pussy? Well, how could I get mad at her for that?! I asked these two to re-create their night, and these sexy sluts couldn&apos;t wait to strip each other out of their clothes and start playing with each other! It was fucking awesome to watch my girlfriend fool around with another girl, but ever better was when the two of them shared sucking my thick cock together! I pounded each of their tight pussies and fucked them until they both came from pure pleasure. I absolutely love fucking another chick with my girlfriend since, after all, there&apos;s nothing better than cheating together!\r\nTags: Threesome (2 Females), Amateur, Couples Fantasies, POV, Cum Shot, Pussy Licking, Facial - Multiple, Facial - POV, Oral Train, Blowjob - POV, 2 Girl Blowjob, Blonde\r\n <a href=\"\nhttp://imgdone.com/image/KPHl\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/KPHl</a>\r\n <a href=\"\nhttp://imgdone.com/image/Kbtw\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/Kbtw</a>","last_updated":"2018-04-19T15:20:08.141Z","parsed":{"xt":"urn:btih:ec07603e551eb2792a8a1ceb0544d19999b481d8","dn":"GFRevenge - Halle Von, Bailey Bae (Cheating Together) NEW 18 Apr","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ec07603e551eb2792a8a1ceb0544d19999b481d8","infoHashBuffer":{"type":"Buffer","data":[236,7,96,62,85,30,178,121,42,138,28,235,5,68,209,153,153,180,129,216]},"name":"GFRevenge - Halle Von, Bailey Bae (Cheating Together) NEW 18 Apr","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}