{"title":"Air Explorer Pro 2.4.0 Multilingual Full With Medicine[BabuPC]","magnet":"magnet:?xt=urn:btih:ec143e12ec964e78c9e070d2551d76ee5a73c033&dn=Air+Explorer+Pro+2.4.0+Multilingual+Full+With+Medicine%5BBabuPC%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BabuPC","categoryP":"applications","categoryS":"windows","size":"7510799","seeders":"6","leechers":"0","description":"Air Explorer Pro\r\n\r\nAir Explorer supports the best cloud servers: OneDrive, Google Drive, 4shared, Box, Dropbox, Mega, Copy, Mediafire, Yandex, Baidu y WebDAV. There are a lot of people who like to backup their most valuable documents on cloud servers, protected by a custom username and password.However, when you want to move or copy a file from one account to the other, you need to first login to the first account, download the file to your PC, then login to the second one and upload it. You can simplify this task by using Air Explorer, an app that allows you to browse through the data you store on several cloud servers with ease.\r\n\r\nStraightforward looks and neatly organized tabs\r\n-Air Explorer comes with a user-friendly GUI (graphical user interface) that makes it easy even for beginners to enter their credentials and connect their online account to this app.\r\n-In addition to exploring the files you store on your cloud servers, you can also search for a certain file throughout all your connected accounts within a dedicated tab, while another one allows you to synchronize two accounts.\r\n\r\nBrowse data stored on Dropbox, Mega, OneDrive, Google Drive and others\r\n-In order to enjoy the functions of Air Explorer, you first need to connect the servers you regularly use to the app. More precisely, you can specify the username and password for one or several accounts, then download or upload files without any hassle.\r\n-Air Explorer supports a wide range of services, such as Dropbox, Box, Google Drive, OneDrive, Mega, Mediafire, WebDav and Yandex, and the login process is as straightforward as possible: enter the username and password, and you are done","last_updated":"2018-10-12T12:26:39.443Z","parsed":{"xt":"urn:btih:ec143e12ec964e78c9e070d2551d76ee5a73c033","dn":"Air Explorer Pro 2.4.0 Multilingual Full With Medicine[BabuPC]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ec143e12ec964e78c9e070d2551d76ee5a73c033","infoHashBuffer":{"type":"Buffer","data":[236,20,62,18,236,150,78,120,201,224,112,210,85,29,118,238,90,115,192,51]},"name":"Air Explorer Pro 2.4.0 Multilingual Full With Medicine[BabuPC]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}