{"title":"The Bloodless Revolution: Radical Vegetarians and the Discovery","magnet":"magnet:?xt=urn:btih:ed2cd5258715e49e36e1c35061067ebe96b4017e&dn=The+Bloodless+Revolution%3A+Radical+Vegetarians+and+the+Discovery&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Horisarte","categoryP":"other","categoryS":"e_books","size":"16860196","seeders":"0","leechers":"0","description":"The Bloodless Revolution: Radical Vegetarians and the Discovery of India, 2012, epub\r\n\r\nTristram Stuart\r\n\r\nIn the 1600s, European travellers discovered Indian vegetarianism. Western culture was changed forever&#x2026;\r\n\r\nWhen early travellers returned from India with news of the country&#x2019;s vegetarians, they triggered a crisis in the European conscience. This panoramic tale recounts the explosive results of an enduring cultural exchange between East and West and tells of puritanical insurgents, Hinduphiles, scientists and philosophers who embraced a radical agenda of reform. These visionaries dissented from the entrenched custom of meat-eating, and sought to overthrow a rapacious consumer society. Their legacy is apparent even today.\r\n\r\n&#x2018;The Bloodless Revolution&#x2019; is a grand history made up by interlocking biographies of extraordinary figures, from the English Civil War to the era of Romanticism and beyond. It is filled with stories of spectacular adventure in India and subversive scientific controversies carved out in a Europe at the dawn of the modern age. Accounts of Thomas Tryon&apos;s Hindu vegetarian society in 17th-century London are echoed by later &#x2018;British Brahmins&#x2019; such as John Zephaniah Holwell, once Governor of Calcutta, who concocted his own half-Hindu, half-Christian religion. Whilst Revolution raged in France, East India Company men John Stewart and John Oswald returned home armed to the teeth with the animal-friendly tenets of Hinduism. Dr George Cheyne, situated at the heart of Enlightenment medicine, brought scientific clout to the movement, converting some of London&#x2019;s leading lights to his &#x2018;milk and seed&#x2019; diet. From divergent perspectives, Descartes, Rousseau, Voltaire and Shelley all questioned whether it was right to eat meat. Society&#x2019;s foremost thinkers engaged in the debate and their challenge to mainstream assumptions sowed the seeds of modern ecological consciousness.\r\n\r\nThis stunning debut is a rich cornucopia of 17th- and 18th-century travel, adventure, radical politics, literature and philosophy. Reaching forward into the 20th-century with the vegetarian ideologies of Hitler and Gandhi, it sheds surprising light on values still central to modern society.\r\n\r\nPrint Length: 416 pages\r\nPublisher: HarperPress (18 Oct. 2012)\r\nSold by: Amazon Media EU S.&#xE0; r.l.\r\nLanguage: English\r\nASIN: B009BZ5W1C\r\n <a href=\"\nhttps://www.amazon.co.uk/Bloodless-Revolution-Radical-Vegetarians-Discovery-ebook/dp/B009BZ5W1C\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.amazon.co.uk/Bloodless-Revolution-Radical-Vegetarians-Discovery-ebook/dp/B009BZ5W1C</a>","last_updated":"2018-09-21T12:00:13.857Z","parsed":{"xt":"urn:btih:ed2cd5258715e49e36e1c35061067ebe96b4017e","dn":"The Bloodless Revolution: Radical Vegetarians and the Discovery","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ed2cd5258715e49e36e1c35061067ebe96b4017e","infoHashBuffer":{"type":"Buffer","data":[237,44,213,37,135,21,228,158,54,225,195,80,97,6,126,190,150,180,1,126]},"name":"The Bloodless Revolution: Radical Vegetarians and the Discovery","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}