{"title":"Money Well Spent by Michael Grabell EPUB","magnet":"magnet:?xt=urn:btih:ed4d74d3f8bcdce21c120ceeaff8b522398b48cd&dn=Money+Well+Spent+by+Michael+Grabell+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"694847","seeders":"0","leechers":"0","description":"xx\r\n\r\nMoney Well Spent by Michael Grabell EPUB\r\n\r\nThe 2012 presidential campaign will, above all else, be a referendum on the Obama administration&#x2019;s handling of the financial crisis, recalling the period when Obama&#x2019;s &#x201C;audacity of hope&#x201D; met the austerity of reality. Central to this is the American Recovery and Reinvestment Act of 2009 - the largest economic recovery plan in American history. Senator Mitch McConnell gave a taste of the enormity of the money committed: if you had spent $1 million a day since Jesus was born, it still would not add up to the price tag of the stimulus package.\r\n\r\nThe story of how this almost entirely partisan piece of legislation - Democrats voted for it, Republicans against it - was passed and, more importantly, how the money was spent and to what effect, is known barely at all. Stepping outside the political fray, ProPublica&#x2019;s Michael Grabell offers a perceptive, balanced, and dramatic story of what happened to the taxpayers&#x2019; money, pursuing the big question through behind-the-scenes interviews and on-the-ground reporting in more than a dozen states across the country.\r\n\r\nMIchael Grabell has been a reporter at ProPublica since 2008, producing stories for USA Today, Salon, NPR, MSNBC, and the CBS Evening News. Before joining ProPublica, he was a reporter at the Dallas Morning News. He has twice been a finalist for the Livingston Award for Young Journalists. He lives in New Jersey.\r\n\r\nxx","last_updated":"2018-06-05T12:09:39.855Z","parsed":{"xt":"urn:btih:ed4d74d3f8bcdce21c120ceeaff8b522398b48cd","dn":"Money Well Spent by Michael Grabell EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ed4d74d3f8bcdce21c120ceeaff8b522398b48cd","infoHashBuffer":{"type":"Buffer","data":[237,77,116,211,248,188,220,226,28,18,12,238,175,248,181,34,57,139,72,205]},"name":"Money Well Spent by Michael Grabell EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}