{"title":"FantasyMassage - Hime Marie (My Black Masseur) NEW 06 June 2018","magnet":"magnet:?xt=urn:btih:ed645ecf8e8ca9019bfa00cd92d0c530d23a407f&dn=FantasyMassage+-+Hime+Marie+%28My+Black+Masseur%29+NEW+06+June+2018&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"295486156","seeders":"0","leechers":"0","description":"Hime Marie just woke up and is brushing her teeth. When she realizes that despite getting some solid sack time in, her back is still killing her. It seems like it&apos;s time to book an appointment with her massage therapist. When she arrives at the massage clinic, Isiah Maxwell is there to greet her. She tells him her back is killing her as he examines her. When he massages her shoulder, he realizes that he&apos;s really going to have to get deep into her skin tissues. Confident that he can help her, he asks her to take off her clothes. She asks him why she would need to do that; she&apos;s never had to do that before. He explains that he needs to oil her up and feels that her clothes are a hindrance. When he assures her that he&apos;ll get her sorted, she agrees and gets undressed. When he comes back to the room, she&apos;s on all fours waiting for him. When she starts working on the shoulders, she&apos;s practically in ecstasy at the relief that his hands are bringing her. She stops him for a moment and says that she&apos;s not sure her masseuse should be doing this. He tells her his one goal is to make her 100% again. When she tells him she&apos;s never had black cock before, he can&apos;t believe his ears. She adds that if his primary concern is to make her feel good then he should give her what she wants. He tells her that they should stay professional but she wants his dick and won&apos;t stop till she gets it. She&apos;s known him for a long time and wants to have her first experience with him. And when he realizes that the customer is always right, he gives her the experience of a lifetime!\r\nCategories Kissing, Pussy Licking, Blonde, Skinny, Blowjob, Deepthroat, Hardcore, Masturbation, Natural Tits, Latina\r\n <a href=\"\nhttp://imgdone.com/image/XCU6E\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/XCU6E</a>\r\n <a href=\"\nhttp://imgdone.com/image/XCt3D\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/XCt3D</a>","last_updated":"2018-06-06T12:09:49.555Z","parsed":{"xt":"urn:btih:ed645ecf8e8ca9019bfa00cd92d0c530d23a407f","dn":"FantasyMassage - Hime Marie (My Black Masseur) NEW 06 June 2018","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ed645ecf8e8ca9019bfa00cd92d0c530d23a407f","infoHashBuffer":{"type":"Buffer","data":[237,100,94,207,142,140,169,1,155,250,0,205,146,208,197,48,210,58,64,127]},"name":"FantasyMassage - Hime Marie (My Black Masseur) NEW 06 June 2018","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}