{"title":"Pornload (Documentary on porn industry) (moviesbyrizzo upload)","magnet":"magnet:?xt=urn:btih:ed92804bfd38cfb85b7cecf38a6a0a851ba4b634&dn=Pornload+%28Documentary+on+porn+industry%29+%28moviesbyrizzo+upload%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"moviesbyrizzo","categoryP":"porn","categoryS":"other","size":"366442080","seeders":"0","leechers":"0","description":" <a href=\"https://www.imdb.com/list/ls008220226/\" rel=\"nofollow\" target=\"_NEW\">https://www.imdb.com/list/ls008220226/</a>\r\n\r\nThis is a documentary by British author Gail Dines on the Porn industry. \r\nWhile there is a bit of a cynical view taken of the fact that the porn\r\nindustry has at times been lucrative apparently (although I think free porn\r\non the net has pretty much made that seem like an idea that no longer is \r\nvalid) she does make the point that those with great amounts of money can often\r\ninfluence political and social spheres with funds spent on lobbying and advertising etc. In my own view a legitimate porn industry raking in lots of money is not an unwelcome sort of proposition provided the content is clean of the sort of perverted types of violent behaviour and cruelly disfigured tastes in cruelty towards women that is shown as evidence in many of the clips included in this documentary from porn flicks and videos from the net it seems.\r\n\r\nGail Dines argues that we are changing cultural norms in matters of sexual appetites and acceptance of deviance of a violent and abusive mindset that she shows is out there towards women in unacceptable displays of such forms of barbarity and in this respect I have to say her recently formed organization which seeks to reform the industry has all the merit in the world to that extent.\r\n\r\nThat all said, I do believe that we should always allow for the industry to exist and prosper, provided it is serving a human need with merited ideas of what should be shown and encouraged from a humanistic point of view keeping in mind that porn, like prostitution does serve a human need that will never in my own view be eliminated from reality because it is the only choice available to some\r\nat times of need and should be kept available, but perhaps licensed in some form\r\nto prevent abuses to women that should never go unpunished and rejected from our midst altogether I say.\r\n\r\nGail Dines also has her views on depictions of inter-racial sex which she makes\r\nclear, while arguing that it is supposedly mainly white men that in her view this\r\nsort of material is consumed by, while noting their rejection of its depictions that are described negatively in this documentary appeal.\r\n\r\n\r\nPlease seed this one too\r\n\r\nMichael Rizzo Chessman\r\n(moviesbyrizzo uploads)","last_updated":"2018-08-20T12:00:54.271Z","parsed":{"xt":"urn:btih:ed92804bfd38cfb85b7cecf38a6a0a851ba4b634","dn":"Pornload (Documentary on porn industry) (moviesbyrizzo upload)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ed92804bfd38cfb85b7cecf38a6a0a851ba4b634","infoHashBuffer":{"type":"Buffer","data":[237,146,128,75,253,56,207,184,91,124,236,243,138,106,10,133,27,164,182,52]},"name":"Pornload (Documentary on porn industry) (moviesbyrizzo upload)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}