{"title":"VritraCompleteEditionPortable.exe","magnet":"magnet:?xt=urn:btih:eda876e55dbea23c69858566560ce705599b511e&dn=VritraCompleteEditionPortable.exe&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"globeplus","categoryP":"applications","categoryS":"windows","size":"107212288","seeders":"0","leechers":"0","description":"PORTABLE - JUST RUN THE EXECUTABLE AFTER DOWNLOAD\r\n\r\n\r\n&quot;The complete edition of the nightmare.&quot;\r\n\r\nA challenge from ancient times delivered to gamers. That excitement from the past has returned.The complete version of VRITRA, the 2D fantasy shooting game, is out now!\r\n\r\nStory\r\n\r\nThe seal that was placed by the gods has finally been broken.Out of the broken seal emerged the Evil Dragon Vritra, feared as the manifestation of the great evil that engulfs heaven and earth.\r\n\r\nVritra&apos;s return spawned evil creatures and cast a cloud of despair over the world, bringing it to the brink of total decay.\r\nSensing the aura of his arch-enemy Vritra, the Hero God Indra clutched the treasure Vajra and headed to Earth.\r\n\r\nThe countless wars of the gods that have been fought since ancient times is about the begin again.\r\nOverview\r\n\r\n    A 2D side-scrolling shooter in which you control a dragon and Vajras to destroy enemies!\r\n    Master the use of &quot;Shots&quot; that can be rapid-fired, as well as the more powerful and destructive &quot;Boost&quot; attacks.\r\n    There are a total of eight types of Vajras that strengthen the dragon! Strategize as you make use of the special properties of each Vajra.\r\n    Your Boost attack changes depending on the type of Vajra you use! Mastering the use of Vajras is the key to victory!\r\n    Your scoring rate increases if you defeat or damage enemies with Boost attacks! Keep a high scoring rate to achieve high scores.\r\n    Complete with a replay function! Review and share your own replays and use them to strategize as you proceed.\r\n\r\n\r\n\r\nFeature 1: Spectacular graphics and sound\r\n\r\nThe game features immersive high-definition graphics and impactful sounds that enhance each scene.This game appeals to players in many ways, with its five stages in total, including new stages that were not in the smartphone version, plus the true last boss that you encounter in Expert mode or above.\r\n\r\nFeature 2: A variety of unique equipment\r\nYou can obtain items to change the attributes of Vajras. Four new types of Vajras have been added, to a total of eight types. Select the Vajra that will give you the most advantage in each scene, and strategize smoothly.\r\n\r\nFeature 3: Simple, yet in-depth strategizing\r\nOnly two buttons are used: Shot and Boost. If you destroy enemies using Boost, your rate goes up.The simple yet in-depth strategizing in this game is what makes it so exciting.\r\n\r\nFeature 4: Replays and high score rankings\r\nIncludes a replay function. Review and share your own replays and use them to strategize as you proceed.In the Steam version, a total of 16 types of high score rankings are available.\r\nFeature 5: Mugen Vritra\r\nThe &quot;Mugen&quot; mode, which was very popular in the smartphone version, is also available in this version!New Vajras are available to players, improving the balance of the game. How long will you be able to survive? \r\n\r\n\r\nenjoy","last_updated":"2018-09-16T12:08:05.907Z","parsed":{"xt":"urn:btih:eda876e55dbea23c69858566560ce705599b511e","dn":"VritraCompleteEditionPortable.exe","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"eda876e55dbea23c69858566560ce705599b511e","infoHashBuffer":{"type":"Buffer","data":[237,168,118,229,93,190,162,60,105,133,133,102,86,12,231,5,89,155,81,30]},"name":"VritraCompleteEditionPortable.exe","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}