{"title":"Chasing Gold by George M. Taber EPUB","magnet":"magnet:?xt=urn:btih:ee0abe9cb15ead62442bc941d618ad3900af699f&dn=Chasing+Gold+by+George+M.+Taber+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2656504","seeders":"0","leechers":"0","description":"xx\r\n\r\nChasing Gold by George M. Taber EPUB\r\n\r\nIn the highly anticipated new book from the best-selling author of Judgment of Paris,George M. Taber reveals the integral role gold played in World War II, from its influence on the Nazi war machine to the ultimate triumph by the Allies and the fall of Berlin.\r\n\r\nFor the entire history of human civilization, gold has enraptured people around the globe. The Nazis were no less enthralled by it and felt gold was the solution to funding Hitler&apos;s war machine. Gold was also on the mind of FDR across the Atlantic, as he worked with Europe&apos;s other leaders to bring the United States and the rest of the world out of a severe depression. FDR was hardly the first head of state to turn to gold in difficult times. Throughout history, it has been the refuge of both nations and people in trouble, working at times when nothing else does. Desperate people can buy a loaf of bread or bribe a border guard. Gold can get desperate nations oil to keep tanks running or munitions to fight a war. If the price is right, there is always someone somewhere willing to buy or sell gold. And it was to become the Nazi&apos;s most important medium of exchange during the war.\r\n\r\nChasing Gold is the story of how the Nazis attempted to grab Europe&apos;s gold to finance history&apos;s bloodiest war. It is filled with high drama and close escapes, laying bare the palate of human emotions. Walking through the tale are giants of world history, as well as ordinary people called upon to undertake heroic action in an extraordinary time.\r\n\r\nxx","last_updated":"2018-04-23T12:00:36.342Z","parsed":{"xt":"urn:btih:ee0abe9cb15ead62442bc941d618ad3900af699f","dn":"Chasing Gold by George M. Taber EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ee0abe9cb15ead62442bc941d618ad3900af699f","infoHashBuffer":{"type":"Buffer","data":[238,10,190,156,177,94,173,98,68,43,201,65,214,24,173,57,0,175,105,159]},"name":"Chasing Gold by George M. Taber EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}