{"title":"Darwin's Camera.epub","magnet":"magnet:?xt=urn:btih:ee5030a223adc411c384bd43405a66ef01323470&dn=Darwin%27s+Camera.epub&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"CopperSun","categoryP":"other","categoryS":"e_books","size":"8600192","seeders":"29","leechers":"11","description":"Darwin&apos;s Camera: Art and Photography in the Theory of Evolution \r\n\r\nBy Phillip Prodger\r\n\r\nPublished by Oxford University Press in 2009-Epub \r\n\r\nDescription\r\n\r\nDarwin&apos;s Camera tells the extraordinary story of how Charles Darwin changed the way pictures are seen and made.\r\n\r\nIn his illustrated masterpiece, Expression of the Emotions in Man and Animals (1871), Darwin introduced the idea of using photographs to illustrate a scientific theory--his was the first photographically illustrated science book ever published. Using photographs to depict fleeting expressions of emotion--laughter, crying, anger, and so on--as they flit across a person&apos;s face, he managed to produce dramatic images at a time when photography was famously slow and awkward. The book describes how Darwin struggled to get the pictures he needed, scouring the galleries, bookshops, and photographic studios of London, looking for pictures to satisfy his demand for expressive imagery. He finally settled on one the giants of photographic history, the eccentric art photographer Oscar Rejlander, to make his pictures. It was a peculiar choice. Darwin was known for his meticulous science, while Rejlander was notorious for altering and manipulating photographs. Their remarkable collaboration is one of the astonishing revelations in Darwin&apos;s Camera.\r\n\r\nDarwin never studied art formally, but he was always interested in art and often drew on art knowledge as his work unfolded. He mingled with the artists on the voyage of HMS Beagle, he visited art museums to examine figures and animals in paintings, associated with artists, and read art history books. He befriended the celebrated animal painters Joseph Wolf and Briton Riviere, and accepted the Pre-Raphaelite sculptor Thomas Woolner as a trusted guide. He corresponded with legendary photographers Lewis Carroll, Julia Margaret Cameron, and G.-B. Duchenne de Boulogne, as well as many lesser lights. Darwin&apos;s Camera provides the first examination ever of these relationships and their effect on Darwin&apos;s work, and how Darwin, in turn, shaped the history of art","last_updated":"2018-07-22T12:14:19.801Z","parsed":{"xt":"urn:btih:ee5030a223adc411c384bd43405a66ef01323470","dn":"Darwin's Camera.epub","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ee5030a223adc411c384bd43405a66ef01323470","infoHashBuffer":{"type":"Buffer","data":[238,80,48,162,35,173,196,17,195,132,189,67,64,90,102,239,1,50,52,112]},"name":"Darwin's Camera.epub","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}