{"title":"The Tinder Murder, A Documentary by Deepika Narayan Bhardwaj","magnet":"magnet:?xt=urn:btih:ee6d35e63435f32b0ea2bdf97b7f18d195e9a7b2&dn=The+Tinder+Murder%2C+A+Documentary+by+Deepika+Narayan+Bhardwaj&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"in2xs","categoryP":"video","categoryS":"other","size":"9268887","seeders":"1","leechers":"2","description":"Chilling Short Documentary About The Real life Tinder Murderer in India\r\n\r\n\r\nThe conspirator/murderer narrates her deed with pride.\r\n\r\nDescription from Scoopwhoop.com:\r\nSpine chilling documentary about a Tinder serial killer - Priya Seth. On May 2, 2018, a 27-year-old man named Dushyant Sharma went on a supposed Tinder date with a woman named Priya Seth. And soon after the &#x2018;date&#x2019;, Dushyant went missing. Not long after, Dushyant&#x2019;s family was informed of his abduction for a ransom amount of Rs. 10 Lakhs and that was just the beginning of his misery. This short documentary by Deepika Bhardwaj captures his ordeal along with stories of Seth&#x2019;s several other victims. Watch this spine-chilling film about these horrific crimes. And tread with caution the next time you want to take an online friendship into the real world.\r\n\r\nDescription from newspaper, The Hindustan Times (June 25, 2018): \r\nWhen a 29-year-old man from Jaipur swiped right on the profile of a woman on Tinder, he would not have expected to end up dead days later &#x2014; chopped up into pieces and stuffed in a suitcase. The man, Dushyant Sharma, was held captive by 27-year-old Priya Seth, her boyfriend and a friend at a rented flat ... On May 2, Seth allegedly invited Sharma to her flat and asked him to pay R10 lakh. With the help of Dikshant Kamra (20) and Lakshya Walia (21), Seth also robbed Sharma of his ATM card after tying him up with wires and calling his father for a ransom ... &#x201C;But when Sharma visited her, she found out that he was from Jaipur and did not have much money in his account. They thought if he was allowed to go away, he may blow the lid on them so they killed him&#x201D; ... The three accused allegedly strangled Sharma and chopped his body into pieces.\r\n\r\nLanguage: Hindi with hard-coded subtitles in English.\r\n\r\nVideo: H264 - MPEG-4 AVC (part 10) (avc 1)\r\nAudio: MPEG AAC (mp4a)","last_updated":"2018-06-30T12:08:27.109Z","parsed":{"xt":"urn:btih:ee6d35e63435f32b0ea2bdf97b7f18d195e9a7b2","dn":"The Tinder Murder, A Documentary by Deepika Narayan Bhardwaj","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ee6d35e63435f32b0ea2bdf97b7f18d195e9a7b2","infoHashBuffer":{"type":"Buffer","data":[238,109,53,230,52,53,243,43,14,162,189,249,123,127,24,209,149,233,167,178]},"name":"The Tinder Murder, A Documentary by Deepika Narayan Bhardwaj","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}