{"title":"The Storm Before the Storm by Joe Russell EPUB","magnet":"magnet:?xt=urn:btih:ef0ce6522f657bcec4fd88f23aee48eaa4b5b437&dn=The+Storm+Before+the+Storm+by+Joe+Russell+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"321965","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Storm Before the Storm by Joe Russell EPUB\r\n\r\nAs a prepper, Dave Galanos has always made an effort to do what he can to prepare for the unexpected. But when something goes terribly wrong halfway through a backpacking trip with his wife and family, his world is turned upside down, and he is tested in a way he had never planned for. \r\n\r\nThe trip into the Alleghenys of West Virginia starts off well enough but takes an unexpected turn when the two women, Sandra and her sister, Jen, leave camp and don&#x2019;t return from a nearby stream. Dave and Mike, Jen&#x2019;s new boyfriend, go looking for them and find evidence that the women may have been kidnapped. Miles from civilization and with no working cell phones, Dave and Mike will set off to find Sandra and Jen, unconnected and unconcerned about what is happening in the world around them. \r\n\r\nDave has been hardened by real-world self-defense scenarios in the past and has naturally equipped himself with tools that may be required for an unexpected circumstance. He will have to work together with Mike, who he sees as more of an annoyance and a liability than a useful ally. They will have to work together to beat the clock, the elements, and a group of dangerous locals in order to rescue their companions in this realistic, rugged, and action-packed story of preparedness and survival. \r\n\r\nThe storm is just beginning. Will Dave and his companions have what it takes to survive? \r\n\r\nThe Storm Before the Storm is the premier novel by postapocalyptic author Joe Russell and the first installment in the American Sundown series.\r\n\r\nxx","last_updated":"2018-05-08T12:00:42.581Z","parsed":{"xt":"urn:btih:ef0ce6522f657bcec4fd88f23aee48eaa4b5b437","dn":"The Storm Before the Storm by Joe Russell EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ef0ce6522f657bcec4fd88f23aee48eaa4b5b437","infoHashBuffer":{"type":"Buffer","data":[239,12,230,82,47,101,123,206,196,253,136,242,58,238,72,234,164,181,180,55]},"name":"The Storm Before the Storm by Joe Russell EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}