{"title":"Church of Spies by Mark Riebling (.epub)","magnet":"magnet:?xt=urn:btih:ef93e0e804b153a4251e2cf6b60f1e19ea109c14&dn=Church+of+Spies+by+Mark+Riebling+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"679428","seeders":"1","leechers":"1","description":"Church of Spies: The Pope&apos;s Secret War Against Hitler by Mark Riebling\r\n\r\nRequirements: .ePUB reader, 664 KB\r\n\r\nGenre: Non-Fiction &gt; Biographies &amp; Memoirs\r\n\r\nOverview: \r\n\r\nHailed as &quot;powerful and provocative&quot; (Washington Post), &quot;heart-pounding&quot; (New York Times) and &quot;brilliant&quot; (Kirkus), intelligence expert Mark Riebling&apos;s groundbreaking book Wedge inspired &quot;no fewer than seven assorted congressional committees, internal evaluators, and blue-ribbon panels&quot; (Wall Street Journal). Now, in the long-awaited Church of Spies, Riebling documents an epic secret battle in the Second World War -- and reframes one of the great historical controversies of our age. \r\n\r\nThe Vatican&apos;s stance toward Nazism is fiercely debated. History has accused wartime pontiff Pius the Twelfth of complicity in the Holocaust and dubbed him &quot;Hitler&apos;s Pope.&quot; But a key part of the story has remained untold. \r\n\r\nPius ran the world&apos;s largest church, smallest state, and oldest spy service. Saintly but secretive, he skimmed from church charities to pay covert couriers, and surreptitiously tape-recorded his meetings with top Nazis. When he learned of the Holocaust, Pius played his cards close to his chest. He sent birthday cards to Hitler--while plotting to overthrow him. \r\n\r\nChurch of Spies documents this cross-and-dagger intrigue in shocking detail. Gun-toting Jesuits stole blueprints to Hitler&apos;s homes. A Catholic book publisher flew a sports plane over the Alps with secrets filched from the head of Hitler&apos;s bodyguard. The keeper of the Vatican crypt ran a spy ring that betrayed German war plans and wounded Hitler in a briefcase bombing. \r\n\r\nThe plotters made history in ways they hardly expected. They inspired European unification, forged a U.S.-Vatican alliance that spanned the Cold War, and challenged Church teachings on Jews. Yet Pius&apos; secret war muted his public response to Nazi crimes. Fearing that overt protest would impede his covert actions, he never spoke the &quot;fiery words&quot; he wanted. \r\n\r\nTold with heart-pounding suspense, based on secret transcripts and unsealed files, Church of Spies throws open the Vatican&apos;s doors to reveal some of the most astonishing events in the history of the papacy","last_updated":"2018-09-08T12:26:11.924Z","parsed":{"xt":"urn:btih:ef93e0e804b153a4251e2cf6b60f1e19ea109c14","dn":"Church of Spies by Mark Riebling (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ef93e0e804b153a4251e2cf6b60f1e19ea109c14","infoHashBuffer":{"type":"Buffer","data":[239,147,224,232,4,177,83,164,37,30,44,246,182,15,30,25,234,16,156,20]},"name":"Church of Spies by Mark Riebling (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}