{"title":"The End of Alchemy by Mervyn King EPUB","magnet":"magnet:?xt=urn:btih:f0009659c63615fe22c81f2c0a3e986fde1b654f&dn=The+End+of+Alchemy+by+Mervyn+King+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"501824","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe End of Alchemy by Mervyn King EPUB\r\n\r\nSomething is wrong with our banking system. We all sense that, but Mervyn King knows it firsthand; his 10 years at the helm of the Bank of England, including at the height of the financial crisis, revealed profound truths about the mechanisms of our capitalist society. In The End of Alchemy, he offers us an essential work about the history and future of money and banking, the keys to modern finance.\r\n\r\nThe Industrial Revolution built the foundation of our modern capitalist age. Yet the flowering of technological innovations during that dynamic period relied on the widespread adoption of two much older ideas: the creation of paper money and the invention of banks that issued credit. We take these systems for granted today, yet at their core both ideas were revolutionary and almost magical. Common paper became as precious as gold, and risky long-term loans were transformed into safe short-term bank deposits. As King argues, this is financial alchemy - the creation of extraordinary financial powers that defy reality and common sense. Faith in these powers has led to huge benefits; the liquidity they create has fueled economic growth for two centuries now. However, they have also produced an unending string of economic disasters, from hyperinflations to banking collapses to the recent global recession and current stagnation.\r\n\r\nHow do we reconcile the potent strengths of these ideas with their inherent weaknesses? King draws on his unique experience to present fresh interpretations of these economic forces and to point the way forward for the global economy. His bold solutions cut through current overstuffed and needlessly complex legislation to provide a clear path to durable prosperity and the end of overreliance on the alchemy of our financial ancestors.\r\n\r\nxx","last_updated":"2018-01-25T12:09:21.384Z","parsed":{"xt":"urn:btih:f0009659c63615fe22c81f2c0a3e986fde1b654f","dn":"The End of Alchemy by Mervyn King EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f0009659c63615fe22c81f2c0a3e986fde1b654f","infoHashBuffer":{"type":"Buffer","data":[240,0,150,89,198,54,21,254,34,200,31,44,10,62,152,111,222,27,101,79]},"name":"The End of Alchemy by Mervyn King EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}