{"title":"Media Training for Authors: Promote Your Book in the News","magnet":"magnet:?xt=urn:btih:f159b89a382b6e09458cd6ec1f105e9d2e4ba760&dn=Media+Training+for+Authors%3A+Promote+Your+Book+in+the+News&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"tuts756","categoryP":"other","categoryS":"other","size":"4657558927","seeders":"0","leechers":"0","description":"Description\r\n\r\nMedia training can make you look natural in front of any camera. Imagine becoming a regular fixture on the talk show circuit and in the national media as a well-known author. Writing a good book isn&#x2019;t easy, but getting in front of enough people to generate buzz and demand for your books can be even harder. This Media Training for Authors course will teach you step-by-step how to prepare for media interviews. Specifically, you will learn how to look good on TV, how to frame a media message, how to answer reporters&#x2019; questions and how to speak in sound bites.If you want to sell a lot of books, you will need to be able to sell your ideas and your expertise to the public through regular media appearances. You can begin learning how to master the media right now in this comprehensive, interactive course.TJ Walker is a media trainer with 30 years of experience as a media coach to best-selling authors, experts, CEOs, Presidents of countries, Prime Ministers, and Nobel Peace Prize winners. Walker is also the author of the USA Today #1 Bestseller &#x201C;Secret to Foolproof Presentations&#x201D; (also a Business Week and Wall Street Journal Bestseller). Walker once set the Guinness book of World Records for most talk show appearances ever in a 24 our period (104) while promoting one of his public speaking books. Walker is also the author of Media Training A to Z.\r\n\r\nThere is a 100% Money-Back Guarantee for this media training course. And the instructor also provides an enhanced guarantee.\r\n\r\n&#x201C;5 Stars! With 130 separate lectures included in this course, including 5 books and 3 audio interviews, this course is one of the most comprehensive training courses I&#x2019;ve come across for media training. And the fact that it&#x2019;s geared specifically towards me and my readers (authors) is a huge bonus for me! I&#x2019;m only 30% of the way through the material thus far, but I just had to write a post on my blog to share this course with my readers. They&#x2019;re going to love what TJ has to teach them about effectively marketing themselves (and their books) to the media, and how to come across as a seasoned professional, even if it&#x2019;s their first time in front of the camera. I highly recommend this course!&#x201D; Tara R. Alemany\r\nWho is the target audience?\r\n\r\n    Authors\r\n    Aspiring authors\r\n    Anyone promoting a book through the media\r\n\r\nRequirements\r\n\r\n    Students will need to video record themselves using a cell phone or webcam","last_updated":"2018-03-24T12:01:30.995Z","parsed":{"xt":"urn:btih:f159b89a382b6e09458cd6ec1f105e9d2e4ba760","dn":"Media Training for Authors: Promote Your Book in the News","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f159b89a382b6e09458cd6ec1f105e9d2e4ba760","infoHashBuffer":{"type":"Buffer","data":[241,89,184,154,56,43,110,9,69,140,214,236,31,16,94,157,46,75,167,96]},"name":"Media Training for Authors: Promote Your Book in the News","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}