{"title":"Gateway to the Moon by Mary Morris EPUB","magnet":"magnet:?xt=urn:btih:f1a15f4174bc64623c45dca340d2310d4f6c7ec8&dn=Gateway+to+the+Moon+by+Mary+Morris+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5550413","seeders":"0","leechers":"0","description":"xx\r\n\r\nGateway to the Moon by Mary Morris EPUB\r\n\r\nFrom award-winning novelist Mary Morris comes the remarkable story of a remote New Mexican town coming to grips with a dark history it never imagined. In 1492, the Jewish and Muslim populations of Spain were expelled, and Columbus set sail for America. Luis de Torres, a Spanish Jew, accompanies Columbus as his interpreter. His journey is only the beginning of a long migration, across many generations. Over the centuries, de Torres&apos; descendants travel from Spain and Portugal to Mexico, finally settling in the hills of New Mexico. Five hundred years later, it is in these same hills that Miguel Torres, a young amateur astronomer, finds himself trying to understand the mystery that surrounds him and the town he grew up in.\r\n\r\nEntrada de la Luna is a place that holds a profound secret - one that its residents cannot even imagine. It is also a place that ambitious children, such as Miguel, try to leave. Poor health, broken marriages, and poverty are the norm. Luck is unusual. When Miguel sees a flyer for a babysitting job, he jumps at the opportunity, and begins work for a Jewish family new to the area. Rachel Rothstein is not the sort of parent Miguel expected. A frustrated artist, Rachel moved her family from New York in search of a fresh start, but so far New Mexico has not solved any of the problems she brought with her. Miguel loves the work, yet he is surprised to find many of the Rothstein family&apos;s customs similar to ones he&apos;s grown up with and never understood.\r\n\r\nInterwoven throughout the present-day narrative are the powerful stories of the ancestors of Entrada&apos;s residents, highlighting the torture, pursuit, and resistance of the Jewish people. A beautiful novel of shared history, Gateway to the Moon is a moving and memorable portrait of a family and its journey through the centuries.\r\n\r\nxx","last_updated":"2018-04-11T12:09:59.607Z","parsed":{"xt":"urn:btih:f1a15f4174bc64623c45dca340d2310d4f6c7ec8","dn":"Gateway to the Moon by Mary Morris EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f1a15f4174bc64623c45dca340d2310d4f6c7ec8","infoHashBuffer":{"type":"Buffer","data":[241,161,95,65,116,188,100,98,60,69,220,163,64,210,49,13,79,108,126,200]},"name":"Gateway to the Moon by Mary Morris EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}