{"title":"Fracture by Philipp Blom EPUB","magnet":"magnet:?xt=urn:btih:f2822e493033cc9b9b5af972f04479c8b6133a5b&dn=Fracture+by+Philipp+Blom+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5423097","seeders":"0","leechers":"0","description":"xx\r\n\r\nFracture by Philipp Blom EPUB\r\n\r\nWhen the Great War ended in 1918, the West was broken. Religious faith, patriotism, and the belief in human progress had all been called into question by the mass carnage experienced by both sides. Shell-shocked and traumatized, the West faced a world it no longer recognized: The old order had collapsed, replaced by an age of machines. The world hurtled forward on gears and crankshafts, and terrifying new ideologies arose from the wreckage of past belief.\r\n\r\nHistorian Philipp Blom argues that in the aftermath of World War I, citizens of the West launched into hedonistic, aesthetic, and intellectual adventures of self-discovery. It was a period of both bitter disillusionment and visionary progress in which artists, scientists, and philosophers grappled with the question of how to live and what to believe in a broken age. America closed its borders to European refugees and turned away from the desperate poverty caused by the Great Depression. On both sides of the Atlantic, disenchanted voters flocked to Communism and Fascism, forming political parties based on violence and revenge that presaged the horror of a new World War.\r\n\r\nVividly re-creating this era of unparalleled ambition, artistry, and innovation, Blom captures the seismic shifts that defined the interwar period and continue to shape our world today.\r\n\r\nxx","last_updated":"2018-06-03T12:00:52.542Z","parsed":{"xt":"urn:btih:f2822e493033cc9b9b5af972f04479c8b6133a5b","dn":"Fracture by Philipp Blom EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f2822e493033cc9b9b5af972f04479c8b6133a5b","infoHashBuffer":{"type":"Buffer","data":[242,130,46,73,48,51,204,155,155,90,249,114,240,68,121,200,182,19,58,91]},"name":"Fracture by Philipp Blom EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}