{"title":"No True Glory by Bing West EPUB","magnet":"magnet:?xt=urn:btih:f2b894cd80de98d5d20e84259b77a298ba737813&dn=No+True+Glory+by+Bing+West+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"443222","seeders":"11","leechers":"7","description":"xx\r\n\r\nNo True Glory by Bing West EPUB\r\n\r\nFallujah: Iraq&apos;s most dangerous city unexpectedly emerged as the major battleground of the Iraqi insurgency. For 20 months, one American battalion after another tried to quell the violence, culminating in a bloody, full-scale assault. Victory came at a terrible price: 151 Americans and thousands of Iraqis were left dead.\r\n\r\nThe epic battle for Fallujah revealed the startling connections between policy and combat that are a part of the new reality of war.\r\n\r\nThe Marines had planned to slip into Fallujah &quot;as soft as fog&quot;. But after four American contractors were brutally murdered, President Bush ordered an attack on the city, against the advice of the Marines. The assault sparked a political firestorm, and the Marines were forced to withdraw amid controversy and confusion, only to be ordered a second time to take a city that had become an inferno of hate and the lair of the archterrorist al-Zarqawi.\r\n\r\nBased on months spent with the battalions in Fallujah and hundreds of interviews at every level (senior policymakers, negotiators, generals, and soldiers and Marines on the front lines) No True Glory is a testament to the bravery of the American soldier and a cautionary tale about the complex, and often costly, interconnected roles of policy, politics, and battle in the twenty-first century.\r\n\r\nxx","last_updated":"2018-01-22T21:40:21.645Z","parsed":{"xt":"urn:btih:f2b894cd80de98d5d20e84259b77a298ba737813","dn":"No True Glory by Bing West EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f2b894cd80de98d5d20e84259b77a298ba737813","infoHashBuffer":{"type":"Buffer","data":[242,184,148,205,128,222,152,213,210,14,132,37,155,119,162,152,186,115,120,19]},"name":"No True Glory by Bing West EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}