{"title":"The Lightkeepers by Abby Geni EPUB","magnet":"magnet:?xt=urn:btih:f4198146b2cbbc0924738cfa806d272f4f4c3c00&dn=The+Lightkeepers+by+Abby+Geni+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1115736","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Lightkeepers by Abby Geni EPUB\r\n\r\nIn The Lightkeepers, we follow Miranda, a nature photographer who travels to the Farallon Islands, an exotic and dangerous archipelago off the coast of California, for a one-year residency capturing the landscape. Her only companions are the scientists studying there, odd and quirky refugees from the mainland living in rustic conditions; they document the fish populations around the island, the bold trio of sharks called the Sisters that hunt the surrounding waters, and the overwhelming bird population that, at times, creates the need to wear hard hats as protection from their attacks.\r\n\r\nShortly after her arrival, Miranda is assaulted by one of the inhabitants of the islands. A few days later, her assailant is found dead, perhaps the result of an accident. As the novel unfolds, Miranda gives witness to the natural wonders of this special place as she grapples with what has happened to her and deepens her connection to (and her suspicions of) her companions, all while falling under the thrall of the legends of the place nicknamed &quot;the Islands of the Dead&quot;. And when more violence occurs, each member of this strange community falls under suspicion.\r\n\r\nThe Lightkeepers upends the traditional structure of a mystery novel - an isolated environment, a limited group of characters who might not be trustworthy, a death that may or may not have been accidental, a balance of discovery and action - while also exploring wider themes of the natural world, the power of loss, and the nature of recovery. It is a luminous debut novel from a talented and provocative new writer.\r\n\r\nxx","last_updated":"2018-03-13T12:04:27.773Z","parsed":{"xt":"urn:btih:f4198146b2cbbc0924738cfa806d272f4f4c3c00","dn":"The Lightkeepers by Abby Geni EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f4198146b2cbbc0924738cfa806d272f4f4c3c00","infoHashBuffer":{"type":"Buffer","data":[244,25,129,70,178,203,188,9,36,115,140,250,128,109,39,47,79,76,60,0]},"name":"The Lightkeepers by Abby Geni EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}