{"title":"The Rise and Fall of the Dinosaurs by Steve Brusatte EPUB","magnet":"magnet:?xt=urn:btih:f4c044fcf6c67f54086df5fc88b6c69c5f70e9f3&dn=The+Rise+and+Fall+of+the+Dinosaurs+by+Steve+Brusatte+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"16131273","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Rise and Fall of the Dinosaurs by Steve Brusatte EPUB\r\n\r\nA sweeping and groundbreaking history of the age of dinosaurs, from one of our finest young scientists.\r\n\r\nThe dinosaurs. 66 million years ago, the Earth&apos;s most fearsome and spectacular creatures vanished. Today their extraordinary true story remains one of our planet&apos;s great mysteries.\r\n\r\nIn this stunning narrative spanning more than 200 million years, Steve Brusatte, a young American paleontologist who has emerged as one of the foremost stars of the field - discovering 10 new species and leading groundbreaking scientific studies and fieldwork - masterfully tells the complete, surprising, and new history of the dinosaurs, drawing on cutting-edge science to dramatically bring to life their lost world and illuminate their enigmatic origins, spectacular flourishing, astonishing diversity, cataclysmic extinction, and startling living legacy. Captivating and revelatory, The Rise and Fall of the Dinosaurs is a book for the ages.\r\n\r\nBrusatte traces the evolution of dinosaurs from their inauspicious start as small shadow dwellers - themselves the beneficiaries of a mass extinction caused by volcanic eruptions at the beginning of the Triassic period - into the dominant array of species every wide-eyed child memorizes today, T. rex, Triceratops, Brontosaurus, and more. This gifted scientist and writer re-creates the dinosaurs&apos; peak during the Jurassic and Cretaceous, when thousands of species thrived, and winged and feathered dinosaurs, the prehistoric ancestors of modern birds, emerged. The story continues to the end of the Cretaceous period, when a giant asteroid or comet struck the planet and nearly every dinosaur species (but not all) died out, in the most extraordinary extinction event in earth&apos;s history, one full of lessons for today as we confront a &quot;sixth extinction&quot;.\r\n\r\nBrusatte also recalls compelling stories from his globe-trotting expeditions during one of the most exciting eras in dinosaur research - which he calls &quot;a new golden age of discovery&quot; - and offers thrilling accounts of some of the remarkable findings he and his colleagues have made, including primitive human-sized tyrannosaurs; monstrous carnivores even larger than T. rex; and paradigm-shifting feathered raptors from China.\r\n\r\nAn electrifying scientific history that unearths the dinosaurs&apos; epic saga, The Rise and Fall of the Dinosaurs will be a definitive and treasured account for decades to come.\r\n\r\nxx","last_updated":"2018-04-26T12:05:05.376Z","parsed":{"xt":"urn:btih:f4c044fcf6c67f54086df5fc88b6c69c5f70e9f3","dn":"The Rise and Fall of the Dinosaurs by Steve Brusatte EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f4c044fcf6c67f54086df5fc88b6c69c5f70e9f3","infoHashBuffer":{"type":"Buffer","data":[244,192,68,252,246,198,127,84,8,109,245,252,136,182,198,156,95,112,233,243]},"name":"The Rise and Fall of the Dinosaurs by Steve Brusatte EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}