{"title":"The Real Michael Swann by Bryan Reardon EPUB","magnet":"magnet:?xt=urn:btih:f4c964d9544196dbe1d65413b871539171ba5e3a&dn=The+Real+Michael+Swann+by+Bryan+Reardon+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1345077","seeders":"26","leechers":"3","description":"xx\r\n\r\nThe Real Michael Swann by Bryan Reardon EPUB\r\n\r\nIn a new novel from New York Times best-selling author Bryan Reardon, a suburban family is rocked in the wake of a terrorist attack on American soil. \r\n\r\nOn a typical late summer day, Julia Swann is on the phone with her husband, Michael, when the call abruptly goes dead. Then the news rolls in: A bomb has gone off at Penn Station, where Michael was waiting for a train home. New York City is in a state of chaos. \r\n\r\nA frantic Julia races to the city to look for Michael, her panic interwoven with memories of meeting and falling in love with the husband she&apos;s now desperate to find. When someone finds a flier she&apos;s posted and tells her they may have seen her husband, her dreams seem to be answered. Yet as she tries to find him, her calls go unanswered. \r\n\r\nWeaving between the aftermath of the explosion and Julia&apos;s memories of her life with Michael, new developments raise troubling questions. Did Michael survive the explosion? Why hasn&apos;t he contacted her? What was he doing when their last call was cut off? Was he - or is he still - the man she fell in love with? \r\n\r\nPart family drama, part tragic love story, and part disaster narrative that hits terrifyingly close to home, The Real Michael Swann is a deftly plotted suspense novel with an unflinching portrait of a marriage at its heart, challenging us to confront the unthinkable - both in our country and in our own homes.\r\n\r\nxx","last_updated":"2018-06-14T12:15:21.389Z","parsed":{"xt":"urn:btih:f4c964d9544196dbe1d65413b871539171ba5e3a","dn":"The Real Michael Swann by Bryan Reardon EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f4c964d9544196dbe1d65413b871539171ba5e3a","infoHashBuffer":{"type":"Buffer","data":[244,201,100,217,84,65,150,219,225,214,84,19,184,113,83,145,113,186,94,58]},"name":"The Real Michael Swann by Bryan Reardon EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}