{"title":"The Sword of the South by David Weber EPUB","magnet":"magnet:?xt=urn:btih:f4d118641fe46cf295ea1b943d03ce1813247161&dn=The+Sword+of+the+South+by+David+Weber+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1240720","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Sword of the South by David Weber EPUB\r\n\r\nNumber one in a new epic fantasy series by 28-time New York Times and international best seller David Weber, set within his Bahzell Bahnakson/War God universe.\r\n\r\nA swordsman who has been robbed of his past must confront an evil wizard, with a world at stake.\r\n\r\nKnow thyself. It&apos;s always good to know who you are, but sometimes that&apos;s a little difficult. Kenhodan has no last name because he has no past...or not one he remembers, anyway. What he does have are a lot of scars and a lot of skills - some exhilarating and some terrifying - and a purpose. Now, if he only knew where he&apos;d gotten them and what their purpose was....\r\n\r\nWencit of Rm, the most powerful wizard in the world, knows the answers to Kenhodan&apos;s questions, but he can&apos;t or won&apos;t share them with him, except to inform him that he&apos;s a critical part of Wencit&apos;s millennium-long battle to protect Norfressa from conquest by dark sorcery. Bahzell Bahnakson, champion of Tomank, doesn&apos;t know those answers, and the War God isn&apos;t sharing them with him, except to inform Bahzell that the final confrontation with the Dark Lords of fallen Kontovar is about to begin, and that, somehow, Kenhodan is one of the keys to its final outcome.\r\n\r\nWulfra of Torfo doesn&apos;t know those answers, either, but she does know Wencit of Rm is her implacable foe and that, somehow, Kenhodan is one of the weapons he intends to use against her...assuming she can&apos;t kill both of them first.\r\n\r\nBut, in the far northern port city of Belhadan, an 11-year-old girl with a heart of harp music knows the answers to all of Kenhodan&apos;s questions...and dares not share them with anyone, even the ancient wild wizard who loves her more dearly than life itself.\r\n\r\nIt&apos;s not easy to face the future when you can&apos;t even remember your own past, but if saving an entire world from evil sorcerers, demons, devils, and dark gods was easy, anyone could do it.\r\n\r\nxx","last_updated":"2018-05-15T12:00:35.869Z","parsed":{"xt":"urn:btih:f4d118641fe46cf295ea1b943d03ce1813247161","dn":"The Sword of the South by David Weber EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f4d118641fe46cf295ea1b943d03ce1813247161","infoHashBuffer":{"type":"Buffer","data":[244,209,24,100,31,228,108,242,149,234,27,148,61,3,206,24,19,36,113,97]},"name":"The Sword of the South by David Weber EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}