{"title":"Blood Moon by John Sedgwick EPUB","magnet":"magnet:?xt=urn:btih:f591e3f40d1640e5eed5c909f17ef8b5aaa287ba&dn=Blood+Moon+by+John+Sedgwick+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"47955948","seeders":"0","leechers":"0","description":"xx\r\n\r\nBlood Moon by John Sedgwick EPUB\r\n\r\nThis sweeping American epic reveals one of the greatest untold stories of the 19th century: the fierce rivalry between two great Cherokee chiefs that led to war, forced migration, and the devastation of a once-proud nation.\r\n\r\nBlood Moon is the story of the century-long blood feud between two rival Cherokee chiefs from the early years of the United States through the infamous Trail of Tears and into the Civil War. While little remembered today, their mutual hatred shaped the tragic history of the tribe far more than anyone, even the reviled President Andrew Jackson, ever did.\r\n\r\nIn this epic saga, John Sedgwick brings to life an untold chapter of American history through the relationship between one chief called The Ridge, a fearsome warrior who spoke no English but whose exploits on the battlefield were legendary, and John Ross, who was the Cherokees&#x2019; primary chief for nearly 40 years, yet displayed the Scottish side of his mixed-blood heritage and spoke not a word of Cherokee. To protect their sacred landholdings from American encroachment, these two men negotiated with almost every American president from George Washington through Abraham Lincoln. At first friends and allies, they broke on the subject of Removal, breeding an enmity that led to a bloody civil war within Cherokee Nation that culminated in the two factions battling each other in the War Between the States.\r\n\r\nDramatic, far-reaching, and unforgettable, Blood Moon paints a portrait of these two inspirational leaders who worked together to lift their people to the height of culture and learning as the most civilized tribe in the nation and then drop them to the depths of ruin and despair as they turned against each other. Theirs is a story of land, pride, honor, and loss that forms much of the country&#x2019;s mythic past today.\r\n\r\nxx","last_updated":"2018-05-08T12:00:34.056Z","parsed":{"xt":"urn:btih:f591e3f40d1640e5eed5c909f17ef8b5aaa287ba","dn":"Blood Moon by John Sedgwick EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f591e3f40d1640e5eed5c909f17ef8b5aaa287ba","infoHashBuffer":{"type":"Buffer","data":[245,145,227,244,13,22,64,229,238,213,201,9,241,126,248,181,170,162,135,186]},"name":"Blood Moon by John Sedgwick EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}