{"title":"Reckless by Robert K. Brigham (.epub)","magnet":"magnet:?xt=urn:btih:f6772aaccaca2687562d631938d746b9df6f0070&dn=Reckless+by+Robert+K.+Brigham+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"3826707","seeders":"0","leechers":"0","description":"Reckless: Henry Kissinger and the Tragedy of Vietnam by Robert K. Brigham \r\n\r\nRequirements: .ePUB reader, 3.65 MB\r\n\r\nGenre: Non Fiction &gt; History\r\n\r\nOverview: \r\n\r\nHenry Kissinger&apos;s role in the Vietnam War prolonged the American tragedy and doomed the government of South Vietnam\r\n\r\nThe American war in Vietnam was concluded in 1973 after eight years of fighting, bloodshed, and loss. Yet the terms of the truce that ended the war were effectively identical to what had been offered to the Nixon administration four years earlier. Those four years cost America and Vietnam thousands of lives and billions of dollars, and they were the direct result of the supposed master plan of the most important voice in American foreign policy: Henry Kissinger.\r\n\r\nUsing newly available archival material from the Nixon Presidential Library, Kissinger&apos;s personal papers, and material from the archives in Vietnam, Robert K. Brigham punctures the myth of Kissinger as an infallible mastermind. Instead, he constructs a portrait of a rash, opportunistic, and suggestible politician. It was personal political rivalries, the domestic political climate, and strategic confusion that drove Kissinger&apos;s actions. There was no great master plan or Bismarckian theory that supported how the US continued the war or conducted peace negotiations. Its length was doubled for nothing but the ego and poor judgment of a single figure.\r\n\r\nThis distant tragedy, perpetuated by Kissinger&apos;s actions, forever changed both countries. Now, perhaps for the first time, we can see the full scale of that tragedy and the machinations that fed it","last_updated":"2018-09-08T12:26:01.765Z","parsed":{"xt":"urn:btih:f6772aaccaca2687562d631938d746b9df6f0070","dn":"Reckless by Robert K. Brigham (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f6772aaccaca2687562d631938d746b9df6f0070","infoHashBuffer":{"type":"Buffer","data":[246,119,42,172,202,202,38,135,86,45,99,25,56,215,70,185,223,111,0,112]},"name":"Reckless by Robert K. Brigham (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}