{"title":"Final Fantasy XV Debug Symbols","magnet":"magnet:?xt=urn:btih:f6bb1b42e629e72376c29bdd8c98222db015eea8&dn=Final+Fantasy+XV+Debug+Symbols&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"h_a_ggy","categoryP":"games","categoryS":"pc","size":"471293708","seeders":"0","leechers":"0","description":"============ NEVER REPOSTED IN PUBLIC BEFORE ============\r\n\r\n...this release contains the debug symbols (PDB file) for the Steam debug build (revision 1138403) of FINAL FANTASY XV WINDOWS EDITION that Square Enix accidentally enabled all game owners to download for a few minutes in March 2018. For convenience, the files from the original &quot;patch&quot; release (most importantly game executable) and linked DLLs are also included, as well as full Hex-Rays decompiler output from IDA 7.0.\r\n\r\nWarning: Low entropy, this archive decompresses to about 2 GB.\r\nExpect IDA to take a long time processing ffxv_s.exe and the PDB.\r\nUnfortunately, Hex-Rays does not put structure definitions into the whole program output (ffxv_s_pseudocode.c), but they are included and recognized by IDA.\r\n\r\n============      WHAT THIS IS AND ISN&apos;T      ============\r\n\r\n(If you&apos;re a GAMES JOURNALIST, this part is especially important for you)\r\n\r\nTo stop any rumors before they appear:\r\n\r\n- This is NOT any sort of source code leak.\r\n- The code shown below is automatically generated by commonly available software based on the debug build and symbols. It lacks a lot of information actual source code would contain, is significantly less readable, at times outright wrong, and can&apos;t simply be edited and recompiled to produce a modified game.\r\n- This is NOT a new leak and NOT the result of a hack. This is part of what Square Enix themselves accidentally published in March 2018 for a few minutes. It just wasn&apos;t included in the reupload someone posted at the time.\r\n- Okay, WHAT THIS ACTUALLY IS: Data that makes it significantly easier and quicker for skilled reverse engineers to analyse the game&apos;s inner workings (out of curiosity) and/or develop mods or modding tools far beyond what Square Enix would ever publish themselves (think frameworks like &quot;ScriptHookV&quot; for &quot;GTA V&quot; or whole new multiplayer modes like &quot;JC2MP&quot; for &quot;Just Cause 2&quot;).\r\n\r\nWith that out of the way...\r\n\r\n- Those things don&apos;t build themselves though. An interested, skilled reverse engineer still needs to put in significant time to build them. There is no guarantee this will happen.\r\n- If you&apos;re interested in learning RE, you might want to start with something simpler than the modern graph-based 3D game engine C++ mammoth that is Luminous Engine, even if you don&apos;t have debug symbols.\r\n- So, if you are not a reverse engineer or collector, you have no reason to download this.\r\n- As should be obvious from the size, this release does not contain the full game data. If you need to actually run this build, refer to previous uploads of v1138403.\r\n\r\n============             CONTACT             ============\r\n\r\nhaggy(at)airmail(dot)cc\r\npgp keyID 0x78DCFA01\r\nor see haggy_pub.asc in archive","last_updated":"2018-07-19T12:01:34.785Z","parsed":{"xt":"urn:btih:f6bb1b42e629e72376c29bdd8c98222db015eea8","dn":"Final Fantasy XV Debug Symbols","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f6bb1b42e629e72376c29bdd8c98222db015eea8","infoHashBuffer":{"type":"Buffer","data":[246,187,27,66,230,41,231,35,118,194,155,221,140,152,34,45,176,21,238,168]},"name":"Final Fantasy XV Debug Symbols","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}