{"title":"Born with Teeth: A Memoir by Kate Mulgrew EPUB","magnet":"magnet:?xt=urn:btih:f749963c6945ce994945f1648779981a08048a13&dn=Born+with+Teeth%3A+A+Memoir+by+Kate+Mulgrew+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3593093","seeders":"29","leechers":"4","description":"xx\r\n\r\nBorn with Teeth: A Memoir by Kate Mulgrew EPUB\r\n\r\nRaised by unconventional Irish Catholics who knew &quot;how to drink, how to dance, how to talk, and how to stir up the devil&quot;, Kate Mulgrew grew up with poetry and drama in her bones. But in her mother, a would-be artist burdened by the endless arrival of new babies, young Kate saw the consequences of a dream deferred. Determined to pursue her own no matter the cost, at 18 she left her small Midwestern town for New York, where, studying with the legendary Stella Adler, she learned the lesson that would define her as an actress: &quot;Use it,&quot; Adler told her. Whatever disappointment, pain, or anger life throws in your path, channel it into the work.\r\n\r\nIt was a lesson she would need. At 22, just as her career was taking off, she became pregnant and gave birth to a daughter. Having already signed the adoption papers, she was allowed only a fleeting glimpse of her child. As her star continued to rise, her life became increasingly demanding and fulfilling, a whirlwind of passionate love affairs, life-saving friendships, and bone-crunching work. Through it all Mulgrew remained haunted by the loss of her daughter until, two decades later, she found the courage to face the past and step into the most challenging role of her life both on and off screen.\r\n\r\nWe know Kate Mulgrew for the strong women she&apos;s played - Captain Janeway on Star Trek; the tough-as-nails Red on Orange Is the New Black. Now we meet the most inspiring and memorable character of all: herself. By turns irreverent and soulful, laugh-out-loud funny and heart-piercingly sad, Born with Teeth is the breathtaking memoir of a woman who dares to live life to the fullest, on her own terms.\r\n\r\nxx","last_updated":"2018-07-03T12:14:01.053Z","parsed":{"xt":"urn:btih:f749963c6945ce994945f1648779981a08048a13","dn":"Born with Teeth: A Memoir by Kate Mulgrew EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f749963c6945ce994945f1648779981a08048a13","infoHashBuffer":{"type":"Buffer","data":[247,73,150,60,105,69,206,153,73,69,241,100,135,121,152,26,8,4,138,19]},"name":"Born with Teeth: A Memoir by Kate Mulgrew EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}