{"title":"Analized - Ana Foxx (Ana Foxxs Asshole Gaped Wide) NEW 29 June 2","magnet":"magnet:?xt=urn:btih:f74c2fd7952259208c25064cb4f0fa2dfefdd39a&dn=Analized+-+Ana+Foxx+%28Ana+Foxxs+Asshole+Gaped+Wide%29+NEW+29+June+2&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"893765554","seeders":"0","leechers":"0","description":"Ana Foxxx fingers her asshole as she strips out of her red lingerie, showing off her tight black body &#x2013; athletic, with perky small tits, and a perfect round ass. She&apos;s a specimen from heaven, which means one thing here at ANALIZED.COM: she needs her face fucked, pussy punished, and ass stretched as wide as it will go. James Deen approaches and breaks Ana from her striptease. He tells her to relax as he shoves his cock up her tight butthole. Ana takes a brief pounding, and then drops to her knees to fill her throat with dick. She slobbers all over James&apos; cock, giving an eager blowjob. But he wants control, and so he grabs her by the back of the head as he delivers a rough face fucking. Ana&apos;s wig comes off amidst the oral carnage. James urges her on, making her crawl up the stairs, to the couch, where he continues to cock blast her holes. She provides her mouth first, and then hops on top, for a stretch of reverse cowgirl, giving up control as her legs fly backwards and James pounds into her guts. James throws Ana down and pulls his cock out from her ass. She holds her hole open, gaping the red wide between her black skin. James&apos; cock, fresh with ass juice, goes back to Ana&apos;s pussy, and stays there, fucking hard, until he&apos;s ready to cum. Ana keeps her face to the couch as James pulls out and shoots a massive load of hot semen all over the side of her face. She sticks her tongue out, trying to lap the cum from her cheeks. But the effort&apos;s not enough. Finally, Ana uses her fingers to scoop up the last droplets from her skin and shove them into her mouth.\r\nTags: Anal, Athletic, Black, Facial, Gaping, Great Ass, Natural, Pornstar, Rimming, Rough Sex \r\n <a href=\"\nhttp://imgdone.com/image/kS11L\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/kS11L</a>\r\n <a href=\"\nhttp://imgdone.com/image/kSGsC\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/kSGsC</a>","last_updated":"2018-07-01T12:01:06.370Z","parsed":{"xt":"urn:btih:f74c2fd7952259208c25064cb4f0fa2dfefdd39a","dn":"Analized - Ana Foxx (Ana Foxxs Asshole Gaped Wide) NEW 29 June 2","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f74c2fd7952259208c25064cb4f0fa2dfefdd39a","infoHashBuffer":{"type":"Buffer","data":[247,76,47,215,149,34,89,32,140,37,6,76,180,240,250,45,254,253,211,154]},"name":"Analized - Ana Foxx (Ana Foxxs Asshole Gaped Wide) NEW 29 June 2","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}