{"title":"Mindful Compassion by Paul Gilbert EPUB","magnet":"magnet:?xt=urn:btih:f7f38f7c56fdf9c1ec7445dcf66384591932ad74&dn=Mindful+Compassion+by+Paul+Gilbert+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"810902","seeders":"57","leechers":"6","description":"xx\r\n\r\nMindful Compassion by Paul Gilbert EPUB\r\n\r\nThis ground-breaking new book combines the best of compassion-focused therapy with the most effective mindfulness techniques. The result is an extremely effective approach to overcoming everyday emotional and psychological problems and improving one&apos;s sense of well being. Based on the latest work from Professor Paul Gilbert OBE, best-selling author of The Compassionate Mind, and Buddhist expert Choden.\r\n\r\nProfessor Gilbert has spent the past 20 years developing a new therapy called Compassion-Focused Therapy (CFT) which has an gained international following. In recent years, mindfulness is being used increasingly to treat common mental health problems such as depression, stress and stress-related insomnia. In this ground-breaking new book, Professor Gilbert, along with his co-author Choden, combines the best of Compassion-Focused Therapy with the most effective mindfulness techniques.\r\n\r\nThe result is an extremely effective approach to overcoming everyday emotional and psychological problems and improving one&apos;s sense of wellbeing. Professor Paul Gilbert OBE is world-renowned for his work on depression, shame and self-criticism. He is head of the Mental Health Research Unit, University of Derby. He is the author of the best-selling The Compassionate Mind and Overcoming Depression. Choden: Formally a monk for seven years within the Tibetan Buddhist tradition, Choden (aka Sean McGovern) completed a three year, three month retreat in 1997 and has been a practicing Buddhist since 1985. He is originally from South Africa where he trained as a lawyer and where he learned meditation under the guidance of Rob Nairn, an internationally renowned Buddhist teacher. He is now involved in developing secular mindfulness and compassion programmes drawing upon the wisdom and methods of the Buddhist tradition, as well as contemporary insights from psychology and neuroscience. He is an honorary fellow of the University of Aberdeen and teaches on their Postgraduate Study Programme in Mindfulness (MSc) that is the first of its kind to include compassion in its curriculum. He lives on the Isle of Arran.\r\n\r\nxx","last_updated":"2018-09-19T12:53:30.220Z","parsed":{"xt":"urn:btih:f7f38f7c56fdf9c1ec7445dcf66384591932ad74","dn":"Mindful Compassion by Paul Gilbert EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f7f38f7c56fdf9c1ec7445dcf66384591932ad74","infoHashBuffer":{"type":"Buffer","data":[247,243,143,124,86,253,249,193,236,116,69,220,246,99,132,89,25,50,173,116]},"name":"Mindful Compassion by Paul Gilbert EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}