{"title":"Amos Oz - Novels, Stories, Essays and Memoir (28 books)","magnet":"magnet:?xt=urn:btih:f7f7eb9e52c4a177b6b3254cd8ad170ec1ff2b90&dn=Amos+Oz+-+Novels%2C+Stories%2C+Essays+and+Memoir+%2828+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"66402745","seeders":"0","leechers":"0","description":"\nAMOS OZ (b. 1939) is an Israeli novelist, journalist and public intellectual, widely considered to be his country&apos;s most famous living writer.  He has received many honours and awards, among them the Legion of Honour of France, the Goethe Prize, the Prince of Asturias Award in Literature, the Heinrich Heine Prize and the Israel Prize.\n\nOz&apos;s symbolic, poetic novels reflect the splits and strains in Israeli culture.  Locked in conflict are the traditions of intellect and the demands of the flesh, reality and fantasy, rural Zionism and the longing for European urbanity, and the values of the founding settlers and the perceptions of their skeptical offspring.  Oz felt himself unable to share the optimistic outlook and ideological certainties of Israel&apos;s founding generation, and his writings present an ironic view of life in Israel.\n\nHis first book, WHERE THE JACKALS HOWL (1965), is a disturbing and moving collection of short stories about kibbutz life.  MY MICHAEL (1968) is a haunting love story and a rich, reflective portrait of Jerusalem in the 1950s.  A PERFECT PEACE (1982), set in the  months leading up to the Six-Day War, portrays life on a fictional kibbutz, Granot, where the founding generation and their children struggle to come to terms with each other and the ideological tensions within Israeli society.  FIMA (1994), set in Jerusalem, portrays a man, and a generation, dreaming noble dreams but doing nothing.  SCENES FROM VILLAGE LIFE (2011) is a memorable novel-in-stories that offers a brilliant, unsettling glimpse of what goes on beneath the surface of everyday life.  In the eight interconnected stories in BETWEEN FRIENDS (2012), Oz returns to the kibbutz of the late 1950s, drawing masterly profiles of idealistic men and women enduring personal hardships in the shadow of one of the greatest collective dreams of the twentieth century.  JUDAS (2014) investigates the nature of betrayal by weaving a contemporary dialogue about Israel with an alternate history of Judas Iscariot and his motivations. \n\nAfter the Six Day War in 1967, he became active in the Israeli peace movement and with organizations that advocated a two-state solution to the Israeli-Palestinian conflict.  IN THE LAND OF ISRAEL (1983) records Oz&apos;s observations and reflections as, notebook in hand, he traveled throughout Israel and the West Bank to talk with workers, soldiers, religious zealots, aging pioneers, new immigrants, desperate Arabs, and visionaries, asking them questions about Israel&#x2019;s past, present, and future.  The essays in THE SLOPES OF LEBANON (1989) offer Oz&apos;s views on Israel&apos;s offensive into Lebanon in 1982; fanaticism of all stripes; the PLO; Israeli terrorism; the new militarism and the growing intolerance toward the Arab population in Israel; Jewish attitudes toward the Holocaust, and its misappropriation by the right and left alike; Claude Lanzmann&#x2019;s film Shoah; the dream of Zionism and its failures; and much more.\n\nThe political essays in UNDER THIS BLAZING LIGHT (1995) include an examination of the Israeli-Palestinian conflict as a dispute between &quot;Right and Right&quot;; a look at the meaning of socialism in the Israeli context; and reflections on the concept of &quot;Homeland&quot;, the nature of the kibbutz, and the character of Zionism.  A TALE OF LOVE AND DARKNESS (2004) is Oz&apos;s acclaimed memoir of coming of age in the midst of Israel&apos;s turbulent birth pangs, his mother&apos;s tragic suicide, and his decision to change his name and join a kibbutz.  JEWS AND WORDS (2012) is a collection of meditations on, and analyses of, various Jewish texts.\n\n\nThis is an updated version of an earlier torrent.  The following books are in PDF and/or ePUB format as indicated:\n\n\n                        == NOVELS &amp; SHORT FICTION ==\n\n* Between Friends (Harcourt, 2013).  Translated by Sondra Silverston. -- ePUB\n\n* Black Box (Vintage, 1989).  Translated by Nicholas de Lange. -- PDF + ePUB\n\n* Don&apos;t Call It Night (Harcourt, 1996).  Translated by Nicholas de Lange. -- PDF + ePUB\n\n* Elsewhere, Perhaps (Harcourt, 1985).  Translated by Nicholas de Lange. -- ePUB\n\n* Fima (Harcourt, 1993).  Translated by Nicholas de Lange. -- PDF + ePUB\n\n* Hill of Evil Counsel, The (Harcourt, 1978).  Translated by Nicholas de Lange. -- PDF + ePUB\n\n* Judas (Harcourt, 2016).  Translated by Nicholas de Lange. -- ePUB\n\n* My Michael (Harcourt, 2005).  Translated by Nicholas de Lange. -- ePUB\n\n* Panther in the Basement (Harcourt, 1997).  Translated by Nicholas de Lange. -- PDF + ePUB\n\n* A Perfect Peace (Harcourt, 1985).  Translated by Hillel Halkin. -- PDF + ePUB\n\n* Rhyming Life and Death (Vintage, 2010).  Translated by Nicholas de Lange. -- ePUB\n\n* Same Sea, The  (Harcourt, 2001). Translated by Nicholas de Lange. -- ePUB\n\n* Scenes from Village Life (Harcourt, 2011). Translated by Nicholas de Lange. -- ePUB\n\n* Soumchi (Harcourt, 1993).  Translated by Amos Oz and Penelope Farmer. -- PDF + ePUB\n\n* Suddenly in the Depths of the Forest (Harcourt, 2011).  Translated by Sondra Silverston. -- ePUB\n\n* To Know a Woman (Harcourt, 1991).  Translated by Nicholas de Lange. -- PDF + ePUB\n\n* Touch the Water, Touch the Wind (Harcourt, 2011). Translated by Nicholas de Lange. -- ePUB\n\n* Unto Death: Two Novellas (Harcourt, 1978).  Translated by Nicholas de Lange. -- PDF + ePUB\n\n* Where the Jackels Howl &amp; Other Stories (Bantam, 1982 / Harcourt, 2012).  Translated by Nicholas De Lange and Philip Simpson. -- PDF + ePUB\n\n\n                             == NON-FICTION ==\n\n* Art of Fiction, The (Paris Review, Fall 1996).  Interview by Shusha Guppy. -- PDF\n\n* How to Cure a Fanatic (Vintage, 2012). -- ePUB\n\n* In the Land of Israel (Harcourt, 1983).  Translated by Maurie Goldberg-Bartura. -- PDF + ePUB\n\n* Israel, Palestine and Peace: Essays (Harcourt, 1995). -- ePUB\n\n* Jews and Words [with Fania Oz-Salzberger] (Yale UP, 2012). -- ePUB\n\n* Slopes of Lebanon, The (Harcourt, 1989).  Translated by Maurie Goldberg-Bartura. -- PDF + ePUB\n\n* Story Begins, The: Essays on Literature (Harcourt, 1999).  Translated by Maggie Bar-Tura. -- PDF\n\n* Tale of Love and Darkness, A (Harcourt, 2004).  Translated by Nicholas De Lange. -- ePUB\n\n* Under This Blazing Light: Essays (Cambridge UP, 1995).  Translated by Nicholas de Lange. -- PDF\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-06-15T12:00:40.549Z","parsed":{"xt":"urn:btih:f7f7eb9e52c4a177b6b3254cd8ad170ec1ff2b90","dn":"Amos Oz - Novels, Stories, Essays and Memoir (28 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f7f7eb9e52c4a177b6b3254cd8ad170ec1ff2b90","infoHashBuffer":{"type":"Buffer","data":[247,247,235,158,82,196,161,119,182,179,37,76,216,173,23,14,193,255,43,144]},"name":"Amos Oz - Novels, Stories, Essays and Memoir (28 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}