{"title":"Robot-Proof by Joseph E. Aoun AZW3","magnet":"magnet:?xt=urn:btih:f8297051bf92ac05b22b4b1c3a74a9432852862c&dn=Robot-Proof+by+Joseph+E.+Aoun+AZW3&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"598179","seeders":"0","leechers":"0","description":"xx\r\n\r\nRobot-Proof: Higher Education in the Age of Artificial Intelligence by Joseph E. Aoun AZW3\r\n\r\nIn Robot-Proof, Northeastern University president Joseph Aoun proposes a way to educate the next generation of college students to invent, to create, and to discover - to fill needs in society that even the most sophisticated artificial intelligence agent cannot. A &quot;robot-proof&quot; education, Aoun argues, is not concerned solely with topping up students&apos; minds with high-octane facts. Rather, it calibrates them with a creative mindset and the mental elasticity to invent, discover, or create something valuable to society - a scientific proof, a hip-hop recording, a web comic, a cure for cancer. Aoun lays out the framework for a new discipline, humanics, which builds on our innate strengths and prepares students to compete in a labor market in which smart machines work alongside human professionals.\r\n\r\nThe new literacies of Aoun&apos;s humanics are data literacy, technological literacy, and human literacy. Students will need data literacy to manage the flow of big data, and technological literacy to know how their machines work, but human literacy - the humanities, communication, and design - to function as a human being. Life-long learning opportunities will support their ability to adapt to change.\r\n\r\nxx","last_updated":"2018-10-28T12:01:25.733Z","parsed":{"xt":"urn:btih:f8297051bf92ac05b22b4b1c3a74a9432852862c","dn":"Robot-Proof by Joseph E. Aoun AZW3","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f8297051bf92ac05b22b4b1c3a74a9432852862c","infoHashBuffer":{"type":"Buffer","data":[248,41,112,81,191,146,172,5,178,43,75,28,58,116,169,67,40,82,134,44]},"name":"Robot-Proof by Joseph E. Aoun AZW3","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}