{"title":"American Soldier by General Tommy R. Franks EPUB","magnet":"magnet:?xt=urn:btih:f8603bd8717e9c17caf4278c036f468b7326fb00&dn=American+Soldier+by+General+Tommy+R.+Franks+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3234814","seeders":"0","leechers":"0","description":"xx\r\n\r\nAmerican Soldier by General Tommy R. Franks EPUB\r\n\r\nFew individuals have the chance to contribute so much of themselves to the American story as General Tommy Franks. In American Soldier, he captures it all.\r\nThe Commander in Chief of the United States Central Command from July 2000 through July 2003, General Tommy Franks made history leading American and Coalition forces to victory in Afghanistan and Iraq, the decisive battles that launched the war on terrorism.\r\n\r\nGeneral Franks retraces his journey from a small-town boyhood through a lifetime of military service, including his heroic tour as an Artillery officer in Vietnam, where he was wounded three times.\r\n\r\nDrawing on military records declassified for this book, Franks offers the first true insider&apos;s account of the war on terrorism. He puts you in the Operations Center for the launch of Operation Enduring Freedom just weeks after 9/11, capturing its uncertain early days and the historic victory that followed.\r\n\r\nWhen President Bush focused world attention on the threat of Iraq, Franks seized the moment to implement a bold new vision of joint warfare in planning Operation Iraqi Freedom. Rejecting Desert Storm-style massive troop deployment in favor of flexibility and speed, Franks was questioned by the defense establishment, including Secretary of State Colin Powell. Yet his vision was proven on the ground: Within three weeks, Baghdad had fallen.\r\n\r\nFranks describes the covert diplomacy that helped secure international cooperation for the war, and speaks frankly of intelligence shortcomings that endangered our troops, and of the credible WMD threats that influenced every planning decision. He offers an unvarnished portrait of the &quot;disruptive and divisive&quot; Washington bureaucracy, and a candid assessment of the war&apos;s aftermath. Yet in the end, as American Soldier demonstrates, the battles in Afghanistan and Iraq remain heroic victories, wars of liberation won by troops whose valor was &quot;unequalled by anything in the annals of war&quot;.\r\n\r\nxx","last_updated":"2018-05-26T12:00:36.184Z","parsed":{"xt":"urn:btih:f8603bd8717e9c17caf4278c036f468b7326fb00","dn":"American Soldier by General Tommy R. Franks EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f8603bd8717e9c17caf4278c036f468b7326fb00","infoHashBuffer":{"type":"Buffer","data":[248,96,59,216,113,126,156,23,202,244,39,140,3,111,70,139,115,38,251,0]},"name":"American Soldier by General Tommy R. Franks EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}