{"title":"EROGE! Sex and Games Make Sexy Games","magnet":"magnet:?xt=urn:btih:f8c8e03f09f23c757768082990b7581056fe268d&dn=EROGE%21+Sex+and+Games+Make+Sexy+Games&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"porn","categoryS":"games","size":"2480428310","seeders":"25","leechers":"34","description":"The player takes the role of Mochizuki Tomoya, a guy that lives on his own with only a day job at a convenience store keeping him afloat. While he really likes eroge, he can&apos;t draw, isn&apos;t much of a writer or composer, and doesn&apos;t know much about business. Still, his dream is to get a job at an eroge studio in hopes of creating what he loves, eroge.\n\nTomoya&apos;s luck takes a turn for the better when he sees a help wanted ad for the local studio Flower, and after a meeting with the company president (who to his surprise looks like an elementary school kid), manages to get a job as administrator of the company&apos;s website. Tomoya&apos;s glee at being part of the eroge industry is short-lived, as he soon learns that Flower is on the chopping block due to their first title being a massive failure.\n\nAfter playing through Flower&apos;s first title, Tomoya realizes that his co-workers don&apos;t know anything about eroge, lacking the insight and understanding needed to make a good game. After some nudging from the president of Flower&apos;s parent company and some soul searching of his own, our protagonist takes it upon himself to save Flower by teaching the four girls on staff the ins and outs of what makes an eroge good. The story thus focuses on Tomoya&apos;s role as a psuedo-consultant while getting to know the four heroines of the story as the player is given an interesting look at the world of eroge development","last_updated":"2018-03-15T12:13:10.308Z","parsed":{"xt":"urn:btih:f8c8e03f09f23c757768082990b7581056fe268d","dn":"EROGE! Sex and Games Make Sexy Games","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f8c8e03f09f23c757768082990b7581056fe268d","infoHashBuffer":{"type":"Buffer","data":[248,200,224,63,9,242,60,117,119,104,8,41,144,183,88,16,86,254,38,141]},"name":"EROGE! Sex and Games Make Sexy Games","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}