{"title":"BraceFaced - Cleo Bardot (The Headgear Hottie) NEW 10 July 2018","magnet":"magnet:?xt=urn:btih:f8d5b2fe41d190985d5c2fe41af54b808eaa0f49&dn=BraceFaced+-+Cleo+Bardot+%28The+Headgear+Hottie%29+NEW+10+July+2018&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"444146936","seeders":"1","leechers":"0","description":"Cleo Bardot is feeling really self conscious after her visit to the orthodontist. Not only did he make give her braces, he is also making her wear a big harness on her head! He says it is to keep the scoliosis in check, but Cleo is pretty sure he is just screwing her so he can bill more to the insurance company. She hates it! She calls her boyfriend, Tyler, and tells him she cannot go out with him tonight. He tells her she is being ridiculous and comes over anyways. When she opens the door, he struggles to keep the look of revulsion off his face. There she is, his hot girlfriend, looking like she got her head stuck in a bear trap. To add insult to injury, Cleo chose green braces. Perhaps she thought they would compliment the blazing red of her chin strap and head gear? She goes on to complain to a very unsure looking Tyler that her mouth is always dry now that she has braces. She goes to get some water without offering him anything at all. Inexplicably, she decides to drink out of the kitchen faucet like a dog in the backyard. Or she tries to anyways. Defying all reason, Cleo gets her dumb ass stuck in the sink, with the faucet wedged firmly in the metallic contraption wrapped around her face. Tyler comes over to help her out, trying to pull her free from behind. With her ass pressed up against him, his cock gets rock hard. Turns out the head gear is not that hideous if you do not look at it directly. Cleo asks Tyler to fuck her and he responds by ping to his knees and eating her pussy, getting it nice and ready for his cock. While he is fucking her from behind, he thrusts so hard that head gear goes flying of Cleo! But we know what you are thinking, gentle viewer, but do not worry, she lost the head gear, but she still has her braces.\r\n <a href=\"\nhttp://imgdone.com/image/kracF\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/kracF</a>\r\n <a href=\"\nhttp://imgdone.com/image/kroZq\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/kroZq</a>","last_updated":"2018-07-10T12:15:43.327Z","parsed":{"xt":"urn:btih:f8d5b2fe41d190985d5c2fe41af54b808eaa0f49","dn":"BraceFaced - Cleo Bardot (The Headgear Hottie) NEW 10 July 2018","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f8d5b2fe41d190985d5c2fe41af54b808eaa0f49","infoHashBuffer":{"type":"Buffer","data":[248,213,178,254,65,209,144,152,93,92,47,228,26,245,75,128,142,170,15,73]},"name":"BraceFaced - Cleo Bardot (The Headgear Hottie) NEW 10 July 2018","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}