{"title":"Britains Got Talent Season 12 (720p)","magnet":"magnet:?xt=urn:btih:f97fb756467d28ee8dac07d1dc4cbbfe0263f41e&dn=Britains+Got+Talent+Season+12+%28720p%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Invader97","categoryP":"video","categoryS":"hd___tv_shows","size":"31658006901","seeders":"0","leechers":"1","description":"Britain&apos;s Got Talent (often shortened to BGT) is a British television talent show competition which started in June 2007 and originated from the Got Talent franchise. The show is a Thames production (formerly Talkback Thames) distributed by FremantleMedia and is produced in association with Syco TV. The show is broadcast on ITV and its sister show Britain&apos;s Got More Talent is broadcast on ITV2. Anyone of any age with some sort of talent can audition for the show. Acts compete against each other in order to gain the audience support while trying to win the title of &quot;The winner of Britain&apos;s Got Talent&quot;. The original judging panel consisted of the show&apos;s creator Simon Cowell, Amanda Holden and Piers Morgan. Kelly Brook was brought in as a fourth judge in series 3, but was axed after one audition site. Morgan did not return for series 5 and Cowell was only present during the live shows, while David Hasselhoff and Michael McIntyre joined the panel. Alesha Dixon and David Walliams joined the panel in series 6 as replacements for McIntyre and Hasselhoff.\r\n\r\nSeries Twelve of Britain&apos;s Got Talent was broadcast from 14 April to 3 June 2018. The live episodes were broadcast from Hammersmith Apollo, and were presented by Declan Donnelly only, after Anthony McPartlin suspended his TV commitments in March 2018; although he was not present in the live episodes, he still appeared in the audition episodes, as these had been already filmed in January and February 2018. This series featured a higher number of participants for the judges to select semi-finalists from, not counting those who received the Golden Buzzer. Also, the Judges&apos; Vote returned to the show&apos;s format. Enjoy!","last_updated":"2018-06-05T12:10:08.537Z","parsed":{"xt":"urn:btih:f97fb756467d28ee8dac07d1dc4cbbfe0263f41e","dn":"Britains Got Talent Season 12 (720p)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f97fb756467d28ee8dac07d1dc4cbbfe0263f41e","infoHashBuffer":{"type":"Buffer","data":[249,127,183,86,70,125,40,238,141,172,7,209,220,76,187,254,2,99,244,30]},"name":"Britains Got Talent Season 12 (720p)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}