{"title":"Rule Britannia Music, Mischief and Morals Documentary Series","magnet":"magnet:?xt=urn:btih:fa67483e5561c155412a357691f041948538a8dc&dn=Rule+Britannia+Music%2C+Mischief+and+Morals+Documentary+Series&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Ravenwilde","categoryP":"video","categoryS":"tv_shows","size":"3951105935","seeders":"0","leechers":"26","description":"Rude Britannia\r\n\r\nDocumentary hosted by Julian Rhind-Tutt exploring British traditions of satire and bawdy and lewd humour. \r\n\r\nA History Most Satirical, Bawdy, Lewd and Offensive \r\n\r\nBegins in the early 18th century and finds in Georgian Britain a nation openly and shockingly rude. It includes a look at the graphic art of Hogarth, Gillray, Rowlandson and Cruikshank and the theatrical world of John Gay and Henry Fielding. Singer Lucie Skeaping helps show the Georgian taste for lewd and bawdy ballads, and there is a dip into the literary tradition of rude words via Pope, Swift, Byron and Sterne. \r\n\r\nPresents Bawdy Songs and Lewd Photographs \r\n\r\nA look at how British traditions of satire and bawdy and lewd humour survived the era of Victorian values and thrived in the first half of the 20th century. It examines the moral panic that came with the arrival of photography, as saucy images became readily available, and there is a look at the satirical, rude world of early comic book icon Ally Sloper. Plus, how a 20th-century seaside culture of rudeness emerged with peepshows on the pier and the picture postcard art of Donald McGill. \r\n\r\nYou Never Had it So Rude \r\n\r\nThe final part of a series exploring British traditions of satire and bawdy humour shows how a mass democracy of rude emerged in the 1960s revolutions and continues today. It explores the renaissance of rude political cartooning, the comic art of Viz magazine, the theatre of Joe Orton, the radio of Round the Horne and the underground magazine Oz. The history of rude television is traced from Till Death Us Do Part to Little Britain, and how rude comedy began to be seen as sexist and racist","last_updated":"2018-03-30T12:15:21.980Z","parsed":{"xt":"urn:btih:fa67483e5561c155412a357691f041948538a8dc","dn":"Rule Britannia Music, Mischief and Morals Documentary Series","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fa67483e5561c155412a357691f041948538a8dc","infoHashBuffer":{"type":"Buffer","data":[250,103,72,62,85,97,193,85,65,42,53,118,145,240,65,148,133,56,168,220]},"name":"Rule Britannia Music, Mischief and Morals Documentary Series","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}