{"title":"The Lost Bank by Kirsten Grind AZW3","magnet":"magnet:?xt=urn:btih:fbd09b767c330e8f41d9bd3fc481e0ac36a60fa1&dn=The+Lost+Bank+by+Kirsten+Grind+AZW3&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1438811","seeders":"6","leechers":"9","description":"xx\r\n\r\nThe Lost Bank by Kirsten Grind AZW3\r\n\r\nDuring the most dizzying days of the financial crisis, Washington Mutual, a bank with hundreds of billions of dollars in its coffers, suffered a crippling bank run. The story of its final, brutal collapse in the autumn of 2008, and its controversial sale to JPMorgan Chase, is an astonishing account of how one bank lost itself to greed and mismanagement, and how the entire financial industry - and even the entire country - lost its way as well.\r\n\r\nKirsten Grind&#x2019;s The Lost Bank is a magisterial and gripping account of these events, tracing the cultural shifts, the cockamamie financial engineering, and the hubris and avarice that made this incredible story possible. The men and women who become the central players in this tragedy - the regulators and the bankers, the home buyers and the lenders, the number crunchers and the shareholders - are heroes and villains, perpetrators and victims, often switching roles with one another as the drama unfolds.\r\n\r\nWritten as compellingly as the finest fiction, The Lost Bank makes it clear that the collapse of Washington Mutual was not just the largest bank failure in American history. It is a story of talismanic qualities, reflecting the incredible rise and the precipitous collapse of not only an institution, but of trust, fortunes, and the marketplaces for risk across the world.\r\n\r\nAbout the author: Kirsten Grind has received more than a dozen national awards for her work, including a Pulitzer Prize finalist citation for her work covering the collapse of Washington Mutual. A reporter for the Wall Street Journal, she lives in New York City.\r\n\r\nxx","last_updated":"2018-01-28T12:03:51.193Z","parsed":{"xt":"urn:btih:fbd09b767c330e8f41d9bd3fc481e0ac36a60fa1","dn":"The Lost Bank by Kirsten Grind AZW3","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fbd09b767c330e8f41d9bd3fc481e0ac36a60fa1","infoHashBuffer":{"type":"Buffer","data":[251,208,155,118,124,51,14,143,65,217,189,63,196,129,224,172,54,166,15,161]},"name":"The Lost Bank by Kirsten Grind AZW3","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}