{"title":"Kingdom Come : Deliverance v1.5.0 + DLC","magnet":"magnet:?xt=urn:btih:fbff4dfc538f6e0bb68d59993c3be501e56e94d1&dn=Kingdom+Come+%3A+Deliverance+v1.5.0+%2B+DLC&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"deliverymaster","categoryP":"games","categoryS":"pc","size":"23969738752","seeders":"7","leechers":"5","description":"Year of manufacture: 2018\r\nGenre: Action, 3D, RPG\r\nDeveloper: Warhorse Studios\r\nPublisher: Warhorse Studios\r\nPublication Type: RePack\r\nLanguage: RUS | ENG\r\nLanguage of voice: ENG\r\nCrack: CODEX\r\n\r\nYou are Henry the son of a blacksmith. Once in the whirlpool of the events of the Civil War, you helplessly watch the invaders storm your village and carve your friends and family. By miraculously avoiding a cruel fate, you will raise your sword for retribution. Take revenge for the death of your parents and help drive away the invaders! Bohemia, located in the heart of Europe, is famous for its cultural traditions, silver reserves and many castles. After the death of the beloved ruler, Emperor Charles IV, dark times have come for the kingdom: war, corruption and strife tear this precious stone of the Holy Roman Empire. One of Carl&apos;s sons, Vaslav, inherited the crown of his father. Unlike him, Vaclav - naive, self-indulgent and non-ambitious monarch. His half brother and King of Hungary Sigismund the Red Fox feels a weakness in his brother. Under the guise of an act of goodwill, Sigismund goes to Bohemia and abducts her half-brother. Without a king on the throne, Sigismund is free to rob Bohemia and seize its wealth. In the epicenter of this chaos - you, Henry, the son of a blacksmith. Your peaceful life is destroyed when a squad of mercenaries burns your village to the ground, at the behest of King Sigismund. But fate has a sense of humor, and you are among the few survivors of this massacre. Without home, family and future, you are in the service of Lord Radzig Kobyl, who creates resistance to the forces of the invaders. Destiny draws you into this bloody conflict and throws it into the very heat of the raging civil war, where you help to fight for the future of Bohemia.\r\n\r\nDLC : \r\n\r\nKingdom Come: Deliverance - Treasures of the Past\r\n\r\nHow to play : \r\n\r\nMount\r\nInstall\r\nPlay","last_updated":"2018-06-07T12:12:22.218Z","parsed":{"xt":"urn:btih:fbff4dfc538f6e0bb68d59993c3be501e56e94d1","dn":"Kingdom Come : Deliverance v1.5.0   DLC","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fbff4dfc538f6e0bb68d59993c3be501e56e94d1","infoHashBuffer":{"type":"Buffer","data":[251,255,77,252,83,143,110,11,182,141,89,153,60,59,229,1,229,110,148,209]},"name":"Kingdom Come : Deliverance v1.5.0   DLC","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}