{"title":"The Ex by Alafair Burke EPUB","magnet":"magnet:?xt=urn:btih:fc92d836fee661832584135ed67f1e4757682703&dn=The+Ex+by+Alafair+Burke+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"635913","seeders":"1","leechers":"3","description":"xx\r\n\r\nThe Ex by Alafair Burke EPUB\r\n\r\nIn this breakout standalone novel of suspense in the vein of Gone Girl and The Girl on a Train, a woman agrees to help an old boyfriend who has been framed for murder&#x2014;but begins to suspect that she is the one being manipulated.\r\n\r\nAnd look for Alafair Burke&apos;s latest heart-racing novel of psychological suspense, The Wife, coming in January 2018.\r\n\r\nTwenty years ago she ruined his life. Now she has the chance to save it.\r\n\r\nWidower Jack Harris has resisted the dating scene ever since the shooting of his wife Molly by a fifteen-year-old boy three years ago. An early morning run along the Hudson River changes that when he spots a woman in last night&#x2019;s party dress, barefoot, enjoying a champagne picnic alone, reading his favorite novel. Everything about her reminds him of what he used to have with Molly. Eager to help Jack find love again, his best friend posts a message on a popular website after he mentions the encounter. Days later, that same beautiful stranger responds and invites Jack to meet her in person at the waterfront. That&apos;s when Jack&apos;s world falls apart.\r\n\r\nOlivia Randall is one of New York City&apos;s best criminal defense lawyers. When she hears that her former fianc&#xE9;, Jack Harris, has been arrested for a triple homicide&#x2014;and that one of the victims was connected to his wife&apos;s murder&#x2014;there is no doubt in her mind as to his innocence. The only question is who would go to such great lengths to frame him&#x2014;and why?\r\n\r\nFor Olivia, representing Jack is a way to make up for past regrets, to absolve herself of guilt from a tragic decision, a secret she has held for twenty years. But as the evidence against him mounts, she is forced to confront her doubts. The man she knew could not have done this. But what if she never really knew him?\r\n\r\nxx","last_updated":"2018-03-13T12:16:02.654Z","parsed":{"xt":"urn:btih:fc92d836fee661832584135ed67f1e4757682703","dn":"The Ex by Alafair Burke EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fc92d836fee661832584135ed67f1e4757682703","infoHashBuffer":{"type":"Buffer","data":[252,146,216,54,254,230,97,131,37,132,19,94,214,127,30,71,87,104,39,3]},"name":"The Ex by Alafair Burke EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}