{"title":"My Midnight Years by Ronald Kitchen EPUB","magnet":"magnet:?xt=urn:btih:fd3e9cc273c6878ce65863e1ca573597fc9c12e8&dn=My+Midnight+Years+by+Ronald+Kitchen+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3092909","seeders":"0","leechers":"0","description":"xx\r\n\r\nMy Midnight Years: Surviving Jon Burge&apos;s Police Torture Ring and Death Row by Ronald Kitchen, Thai Jones, Logan M. McBride EPUB\r\n\r\nRonald Kitchen was 21, on his way to buy milk for his four-year-old, when he was picked up by the Chicago police, brutally tortured, and coerced to confess to five counts of heinous murder. He spent 22 years in prison, 13 of those on death row, labeled as a monster. Kitchen was only one of the many victims of Jon Burge and his notorious Midnight Crew that terrorized and incarcerated black men - 118 have come forward so far - on the south side of Chicago for nearly two decades.\r\n\r\nNot one to give up, Kitchen co-founded the Death Row 10 from his maximum security cell block. Together, these men fought to expose the grave injustices that led to their wrongful convictions. The Death Row 10 appeared on 60 Minutes II, Nightline, Oprah, and Geraldo Rivera and, with the help of lawyers and activists outside, were instrumental in turning the tide against the death penalty in Illinois. Kitchen was finally exonerated in 2013 and filed a high-profile lawsuit against the Chicago Police Department, Jon Burge, Mayor Richard Daley, and the Cook County State&apos;s Attorney.\r\n\r\nKitchen&apos;s story is outrageous and heartbreaking. Largely absent from the current social justice narratives are the testimonies of the victims themselves. Kitchen is a rare survivor who has turned his suffering into a public cause and is poised to become a powerful spokesperson. The atrocities of the Midnight Crew have been brought to light through Kitchen&apos;s actions and are now part of the discussion as the nation engages in an unprecedented conversation about racism.\r\n\r\nXX","last_updated":"2018-09-10T12:02:09.802Z","parsed":{"xt":"urn:btih:fd3e9cc273c6878ce65863e1ca573597fc9c12e8","dn":"My Midnight Years by Ronald Kitchen EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fd3e9cc273c6878ce65863e1ca573597fc9c12e8","infoHashBuffer":{"type":"Buffer","data":[253,62,156,194,115,198,135,140,230,88,99,225,202,87,53,151,252,156,18,232]},"name":"My Midnight Years by Ronald Kitchen EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}