{"title":"City of Secrets by Stewart O’Nan EPUB","magnet":"magnet:?xt=urn:btih:fd6e6f8181cb3bbf2dac69f26ecdd6c606b69b86&dn=City+of+Secrets+by+Stewart+O%26rsquo%3BNan+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"922326","seeders":"16","leechers":"9","description":"xx\r\n\r\nCity of Secrets by Stewart O&#x2019;Nan EPUB\r\n\r\nFrom master storyteller Stewart O&apos;Nan comes a timely moral thriller about the Jewish underground resistance in Jerusalem after the Second World War.\r\n\r\nIn 1945, with no homes to return to, Jewish refugees set out for Palestine by the tens of thousands. Those who made it were hunted as illegals by the British mandatory authorities there and relied on the underground to shelter them; taking fake names, they blended with the population, joining the wildly different factions fighting for the independence of Israel.\r\n\r\nCity of Secrets follows one survivor, Brand, as he tries to regain himself after losing everyone he&apos;s ever loved. Now driving a taxi provided - like his new identity - by the underground, he navigates the twisting streets of Jerusalem as well as the overlapping, sometimes deadly loyalties of the resistance. Alone, haunted by memories, he tries to become again the man he was before the war - honest, strong, capable of moral choices. He falls in love with Eva, a fellow survivor and member of his cell; reclaims his faith; and commits himself to the revolution, accepting secret missions that grow more and more dangerous even as he begins to suspect he&apos;s being used by their cell&apos;s dashing leader, Asher. By the time Brand understands the truth, it&apos;s too late, and the tragedy that ensues changes history.\r\n\r\nA noirish, deeply felt novel of intrigue and identity written in O&apos;Nan&apos;s trademark lucent style, City of Secrets asks how both despair and faith can lead us astray and what happens when, with the noblest intentions, we join movements beyond our control.\r\n\r\nxx","last_updated":"2018-01-26T12:03:40.356Z","parsed":{"xt":"urn:btih:fd6e6f8181cb3bbf2dac69f26ecdd6c606b69b86","dn":"City of Secrets by Stewart O&rsquo;Nan EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fd6e6f8181cb3bbf2dac69f26ecdd6c606b69b86","infoHashBuffer":{"type":"Buffer","data":[253,110,111,129,129,203,59,191,45,172,105,242,110,205,214,198,6,182,155,134]},"name":"City of Secrets by Stewart O&rsquo;Nan EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}