{"title":"Life Film Noir: 75 Years by The Editors of Life (.epub)","magnet":"magnet:?xt=urn:btih:fdaa941018bf33aef7add1a1604b1bd27d3b6fc3&dn=Life+Film+Noir%3A+75+Years+by+The+Editors+of+Life+%28.epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"NawalaTPB","categoryP":"other","categoryS":"e_books","size":"22481204","seeders":"1","leechers":"0","description":"LIFE Film Noir: 75 Years of the Greatest Crime Films by The Editors of LIFE\r\n\r\nRequirements: .ePUB reader, 21.4MB\r\n\r\nGenre: Non-Fiction &gt; History\r\n\r\nOverview: \r\n\r\nBy incorporating and transforming foreign influences, film noir became a uniquely American art form. Though it was overlooked at first, this powerful genre would give Humphrey Bogart and Robert Mitchum career-defining roles, fuel Joan Crawford&apos;s middle-age comeback, and set the stage for the work of Martin Scorsese and Quentin Tarantino. Noir illuminated the dark side of the American dream, but despite its characteristic bleakness, these films are somehow always fun. \r\n\r\nFilm Noir: 75 Years of the Greatest Crime Films revisits 20 of the genre&apos;s best, from the first noir The Maltese Falcon to L.A. Confidential. We commence by delving into &quot;Classic Noir,&quot; films released between 1941 and 1958 with their angular chiaroscuro and Teutonic angst combined with the influence of pup and hard-boiled crime fiction. Stunning photography walks us through Shadow of a Doubt, Double Indemnity, Laura, Mildred Pierce, Out of the Past, The Third Man, In a Lonely Place, Niagara, The Night of the Hunter, Touch of Evil and more. Next in our &quot;Neo Noir&quot; section, you will see the transformation of noir from 1967 onward with films like Bonnie and Clyde, Dirty Harry, Chinatown, Taxi Driver, Body Heat, Blood Simple, Blue Velvet, Pulp Fiction and more. Articles about how the genre was born, tabloids and film noir, offscreen noir, and what factors lead film back to black punctuate these spreads. Enter the cinematic world of &quot;doom, fate, fear, and betrayal,&quot; as beloved film critic Roger Ebert said, with Film Noir: 75 Years of the Greatest Crime Films","last_updated":"2018-09-08T12:24:40.679Z","parsed":{"xt":"urn:btih:fdaa941018bf33aef7add1a1604b1bd27d3b6fc3","dn":"Life Film Noir: 75 Years by The Editors of Life (.epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fdaa941018bf33aef7add1a1604b1bd27d3b6fc3","infoHashBuffer":{"type":"Buffer","data":[253,170,148,16,24,191,51,174,247,173,209,161,96,75,27,210,125,59,111,195]},"name":"Life Film Noir: 75 Years by The Editors of Life (.epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}