{"title":"Waterloo by Bernard Cornwell EPUB","magnet":"magnet:?xt=urn:btih:fdd91e4d78092e50825ec0969ea9a0a3d9d9e86a&dn=Waterloo+by+Bernard+Cornwell+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4722270","seeders":"5","leechers":"1","description":"xx\r\n\r\nWaterloo by Bernard Cornwell EPUB\r\n\r\nFrom the New York Times best-selling author comes the definitive history of one of the greatest battles ever fought - a riveting nonfiction chronicle published to commemorate the two-hundredth anniversary of Napoleon&apos;s last stand.\r\n\r\nOn June 18, 1815, the armies of France, Britain, and Prussia descended upon a quiet valley south of Brussels. In the previous three days, the French army had beaten the Prussians at Ligny and fought the British to a standstill at Quatre-Bras. The Allies were in retreat. The little village north of where they turned to fight the French army was called Waterloo. The blood-soaked battle to which the town gave its name would become a landmark in European history.\r\n\r\nIn his first work of nonfiction, Bernard Cornwell combines his storytelling skills with a meticulously researched history to give a riveting chronicle of every dramatic moment from Napoleon&apos;s daring escape from Elba to the smoke and gore of the three battlefields and their aftermath. Through quotes from the letters and diaries of Emperor Napoleon, the Duke of Wellington, and the ordinary officers and soldiers, Cornwell brings to life how it actually felt to fight those famous battles as well as the moments of amazing bravery on both sides that left the outcome hanging in the balance until the bitter end.\r\n\r\nPublished to coincide with the battle&apos;s bicentennial in 2015, Waterloo is a tense and gripping story of heroism and tragedy - and of the final battle that determined the fate of nineteenth-century Europe.\r\n\r\nxx","last_updated":"2018-06-03T12:13:33.238Z","parsed":{"xt":"urn:btih:fdd91e4d78092e50825ec0969ea9a0a3d9d9e86a","dn":"Waterloo by Bernard Cornwell EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fdd91e4d78092e50825ec0969ea9a0a3d9d9e86a","infoHashBuffer":{"type":"Buffer","data":[253,217,30,77,120,9,46,80,130,94,192,150,158,169,160,163,217,217,232,106]},"name":"Waterloo by Bernard Cornwell EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}