{"title":"Etgar Keret - Short Stories and a Memoir (8 books)","magnet":"magnet:?xt=urn:btih:fe8eabab8d1668386fe974c801cf9292f80a49c8&dn=Etgar+Keret+-+Short+Stories+and+a+Memoir+%288+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"6023404","seeders":"33","leechers":"2","description":"\nETGAR KERET (b. 1967) is a leading Israeli writer known for his short stories, graphic novels, and scriptwriting for film and television.  His bestselling short-story collections have been translated into twenty-nine languages.  Keret has received the Prime Minister&apos;s award for literature, as well as the Ministry of Culture&apos;s Cinema Prize.  In 2006 he was chosen as an outstanding artist of the prestigious Israel Cultural Excellence Foundation, and in 2010 was awarded the Chevalier medallion of France&apos;s Ordre des Arts et des Lettres.\n\nBrief, intense, painfully funny, and shockingly honest, Keret&apos;s stories are snapshots that illuminate with intelligence and wit the hidden truths of life.  As with the best writers of fiction, hilarity and anguish are the twin pillars of his work.  His writing style is lean, using everyday language, slang, and dialect.  His stories are often surreal, but believably so, leaving you in a curious world much like yours, where the boundaries of possibility are easily changing.  His work has influenced many writers of his generation as well as bringing a renewed surge in popularity for the short story form in Israel in the second half of the 1990s.\n\nIn addition to seven short story collections, this torrent includes SEVEN GOOD YEARS (2015), a memoir consisting of pin-sharp snapshots of life on the permanent knife-edge of what Israelis call hamatzav (&quot;the situation&quot;), tempering nervous comedy with aching tenderness.  It is a life-affirming look at the human need to find good in the least likely places, and the stories we tell ourselves to make sense of our capricious world.\n\n\nThe following books are in ePUB format:\n\n* Bus Driver Who Wanted to Be God &amp; Other Stories (Riverhead, 2015).  Translated by Miriam Shlesinger et al.\n\n* Girl on the Fridge, The (FSG, 2008).  Translated by Miriam Shlesinger and Sondra Silverston.\n\n* Missing Kissinger (Vintage, 2008).  Translated by Miriam Shlesinger and Sondra Silverston.\n\n* Kneller&apos;s Happy Campers (Chatto &amp; Windus, 2009).  Translated by Miriam Shlesinger.\n\n* Nimrod Flipout, The (FSG, 2006).  Translated by Miriam Shlesinger and Sondra Silverston.\n\n* Seven Good Years: A Memoir (Riverhead, 2015).  Translated by Sondra Silverston, Miriam Shlesinger, Jessica Cohen and Anthony Berris.\n\n* Suddenly, A Knock on the Door (FSG, 2012).  Translated by Miriam Shlesinger, Sondra Silverston and Nathan Englander.\n\n* Tel Aviv Noir (Akashic, 2014).  Edited by Etgar Keret and Assaf Gavron.  Translated by Yardenne Greenspan.\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!\n","last_updated":"2018-06-17T12:01:33.197Z","parsed":{"xt":"urn:btih:fe8eabab8d1668386fe974c801cf9292f80a49c8","dn":"Etgar Keret - Short Stories and a Memoir (8 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fe8eabab8d1668386fe974c801cf9292f80a49c8","infoHashBuffer":{"type":"Buffer","data":[254,142,171,171,141,22,104,56,111,233,116,200,1,207,146,146,248,10,73,200]},"name":"Etgar Keret - Short Stories and a Memoir (8 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}