{"title":"The Arsonist by Stephanie Oakes EPUB","magnet":"magnet:?xt=urn:btih:ff083eeb3d16711aa114c5f7f5a7dc18430a6f10&dn=The+Arsonist+by+Stephanie+Oakes+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"988152","seeders":"15","leechers":"5","description":"xx\r\n\r\nThe Arsonist by Stephanie Oakes EPUB\r\n\r\nCode Name Verity meets I Am the Messenger in this offering from Morris Award finalist Stephanie Oakes, in which three riveting points of view are woven together in a story that&apos;s part historical mystery, part contemporary coming-of-age, and completely unputdownable.\r\n\r\nMolly Mavity is not a normal teenage girl. For one thing, her father is an infamous serial arsonist and murderer, and his execution date is fast approaching. For another, Molly refuses to believe that her mother is dead, and she waits for the day when they&apos;ll be reunited - despite all evidence that this will never happen.\r\n\r\nPepper Al-Yusef is not your average teenage boy. A Kuwaiti immigrant with epilepsy, serious girl problems, and the most useless seizure dog in existence, he has to write a series of essays over the summer - or fail to graduate high school.\r\n\r\nAnd Ava Dreyman - the bold and beautiful East German resistance fighter whose murder at 17 led to the destruction of the Berlin Wall - is unlike anyone you&apos;ve met before.\r\n\r\nWhen Molly gets a package leading her to Pepper, they&apos;re tasked with solving a decades-old mystery: find out who killed Ava back in 1989. Using Ava&apos;s diary for clues, Molly and Pepper realize there&apos;s more to her life - and death - than meets the eye. Someone is lying to them. And someone out there is guiding them along, desperate for answers.\r\n\r\nAt turns heart-racing and heartbreaking, The Arsonist is an intricate tapestry - of love, loss, and the mysterious connections between us all.\r\n\r\nxx","last_updated":"2018-02-07T12:06:11.869Z","parsed":{"xt":"urn:btih:ff083eeb3d16711aa114c5f7f5a7dc18430a6f10","dn":"The Arsonist by Stephanie Oakes EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ff083eeb3d16711aa114c5f7f5a7dc18430a6f10","infoHashBuffer":{"type":"Buffer","data":[255,8,62,235,61,22,113,26,161,20,197,247,245,167,220,24,67,10,111,16]},"name":"The Arsonist by Stephanie Oakes EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}