{"title":"The Outsiders by William N. Thorndike EPUB","magnet":"magnet:?xt=urn:btih:ff90dc85939d8c4965ecc0d1de6a99da5f0c006e&dn=The+Outsiders+by+William+N.+Thorndike+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"636050","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Outsiders by William N. Thorndike EPUB\r\n\r\n&quot;It is impossible to produce superior performance unless you do something different.&quot; - John Templeton.\r\n\r\nWhat makes a successful CEO? Most people call to mind a familiar definition: a seasoned manager with deep industry expertise. Others might point to the qualities of today&apos;s so-called celebrity CEOs charisma, virtuoso communication skills, and a confident management style. But what really matters when you run an organization? What is the hallmark of exceptional CEO performance? Quite simply, it is the returns for the shareholders of that company over the long term.\r\n\r\nIn this refreshing, counterintuitive book, author Will Thorndike brings to bear the analytical wisdom of a successful career in investing, closely evaluating the performance of companies and their leaders. You will meet eight individualistic CEOs whose firms&apos; average returns outperformed the S&amp;P 500 by a factor of twenty in other words, an investment of $10,000 with each of these CEOs, on average, would have been worth over $1.5 million twenty-five years later. You may not know all their names, but you will recognize their companies: General Cinema, Ralston Purina, The Washington Post Company, Berkshire Hathaway, General Dynamics, Capital Cities Broadcasting, TCI, and Teledyne.\r\n\r\nIn The Outsiders, you&apos;ll learn the traits and methods striking for their consistency and relentless rationality that helped these unique leaders achieve such exceptional performance. Humble, unassuming, and often frugal, these &quot;outsiders&quot; shunned Wall Street and the press, and shied away from the hottest new management trends. Instead, they shared specific traits that put them and the companies they led on winning trajectories: a laser-sharp focus on per share value as opposed to earnings or sales growth; an exceptional talent for allocating capital and human resources; and the belief that cash flow, not reported earnings, determines a company&apos;s long-term value.\r\n\r\nDrawing on years of research and experience, Thorndike tells eye-opening stories, extracting lessons and revealing a compelling alternative model for anyone interested in leading a company or investing in one and reaping extraordinary returns.\r\n\r\nxx","last_updated":"2018-01-25T12:09:52.861Z","parsed":{"xt":"urn:btih:ff90dc85939d8c4965ecc0d1de6a99da5f0c006e","dn":"The Outsiders by William N. Thorndike EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ff90dc85939d8c4965ecc0d1de6a99da5f0c006e","infoHashBuffer":{"type":"Buffer","data":[255,144,220,133,147,157,140,73,101,236,192,209,222,106,153,218,95,12,0,110]},"name":"The Outsiders by William N. Thorndike EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}