{"title":"The Gone World by Tom Sweterlitsch EPUB","magnet":"magnet:?xt=urn:btih:ffd2d0c80f497014463653015564c739cc72b722&dn=The+Gone+World+by+Tom+Sweterlitsch+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2897982","seeders":"19","leechers":"5","description":"xx\r\n\r\nThe Gone World by Tom Sweterlitsch EPUB\r\n\r\nInception meets True Detective in this science-fiction thriller of spellbinding tension and staggering scope. The Gone World follows a special agent into a savage murder case with grave implications for the fate of mankind.\r\n\r\nShannon Moss is part of a clandestine division within the Naval Criminal Investigative Service. In Western Pennsylvania, 1997, she is assigned to solve the murder of a Navy SEAL&apos;s family - and to locate his teenage daughter, who has disappeared. Though she can&apos;t share the information with conventional law enforcement, Moss discovers that the missing SEAL was an astronaut aboard the spaceship USS Libra - a ship assumed lost to the darkest currents of Deep Time. Moss knows firsthand the mental trauma of time travel and believes the SEAL&apos;s experience with the future has triggered this violence.\r\n\r\nDetermined to find the missing girl and driven by a troubling connection from her own past, Moss travels ahead in time to explore possible versions of the future, seeking evidence or insight that will crack the present-day case. To her horror, the future reveals that it&apos;s not only the fate of a family that hinges on her work, for what she witnesses rising over time&apos;s horizon and hurtling toward the present is the Terminus: the terrifying and cataclysmic end of humanity itself.\r\n\r\nLuminous and unsettling, The Gone World bristles with world-shattering ideas yet remains at its heart an intensely human story.\r\n\r\nxx","last_updated":"2018-02-07T12:04:51.623Z","parsed":{"xt":"urn:btih:ffd2d0c80f497014463653015564c739cc72b722","dn":"The Gone World by Tom Sweterlitsch EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ffd2d0c80f497014463653015564c739cc72b722","infoHashBuffer":{"type":"Buffer","data":[255,210,208,200,15,73,112,20,70,54,83,1,85,100,199,57,204,114,183,34]},"name":"The Gone World by Tom Sweterlitsch EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}