{"title":"Exxxtrasmall - Zoey Bloom (Petite Teen Plowed By Huge Football P","magnet":"magnet:?xt=urn:btih:fff5c5e6c2f80c674c88a7dce4a81c3420c4d379&dn=Exxxtrasmall+-+Zoey+Bloom+%28Petite+Teen+Plowed+By+Huge+Football+P&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"845068688","seeders":"23","leechers":"24","description":"Its rush season and Zoey desperately wants to join this sorority. Shes willing to do anything, including sneaking into the quarterbacks bedroom to steal a pair of boxers for a pledge scavenger hunt. Zoey quietly sneaks into his room and springs into Nancy Drew mood. Shes never met Dustin, but by the look of his clothes scattered around his room, hes a big guy. The lube and used condoms she finds are good clues that this guy really likes to fuck. Like a lot. Just as shes about to snap a selfie, wearing his underwear on her head like a beret, she hears keys at the door. She ducks inside his closet, hoping to hide behind his clothes. Dustin enters his dorm room, looking for his wallet. He digs around a bit and finds this cute, petite freshman hiding in his closet, seemingly unaware that shes still wearing his underwear on her head like a crown. What the fuck? Zoey nervously comes out, trying to explain what shes doing there. She throws herself to her knees and begs him not to call the cops. He agrees, but on one condition: hes in charge. Get on the bed, he commands and then instructs her to play with her panties, since shes so into underwear. She hikes up her short skirt to show off her thong. She slides her panties off and gives him a nice view. Turn over, he barks before starting to spank her tiny but firm ass. It hurts, but she loves it so he goes and gets his greek paddle and smacks her ass hard, leaving it pink. He tells her to turn around, and puts his monster cock right in her face. Its the size of her forearm and she cant wait to stuff it in her mouth. Dustin is a giant compared to petite little Zoey. He pins her down and fucks her hard from behind, then effortlessly picks her up. She wraps her legs around his tall, lean frame and he fucks her senseless.\r\nTags: 18 Year, Blowjob, Brunette, Deepthroat, Doggystyle, Hardcore, Petite, Schoolgirl, Straight, Student, Teen, Tiny\r\n <a href=\"\nhttp://imgdone.com/image/XMI8E\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/XMI8E</a>\r\n <a href=\"\nhttp://imgdone.com/image/XMbEV\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/image/XMbEV</a>","last_updated":"2018-05-24T12:05:24.476Z","parsed":{"xt":"urn:btih:fff5c5e6c2f80c674c88a7dce4a81c3420c4d379","dn":"Exxxtrasmall - Zoey Bloom (Petite Teen Plowed By Huge Football P","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fff5c5e6c2f80c674c88a7dce4a81c3420c4d379","infoHashBuffer":{"type":"Buffer","data":[255,245,197,230,194,248,12,103,76,136,167,220,228,168,28,52,32,196,211,121]},"name":"Exxxtrasmall - Zoey Bloom (Petite Teen Plowed By Huge Football P","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}